<?php

return [
    'when-title' => 'Δημιουργικότητα, κωδικοποίηση και συνεργασία χωρίς όρια',
    'when-text' => '<p>Η EU Code Week είναι μία δυναμική πρωτοβουλία που δίνει τη δυνατότητα σε άτομα όλων των ηλικιών να εξερευνήσουν τον προγραμματισμό, τη δημιουργικότητα και την επίλυση προβλημάτων. Καταρρίπτει τα εμπόδια στις ψηφιακές δεξιότητες, καθιστώντας τον προγραμματισμό πιο προσιτό και συμπεριληπτικό. Από τις σχολικές τάξεις έως τους κοινοτικούς χώρους, συνδέει εκπαιδευτικούς, μαθητές και λάτρεις της τεχνολογίας, ζωντανεύοντας ιδέες μέσω της ψηφιακής καινοτομίας και ενισχύοντας τη συνεργασία σε όλη την Ευρώπη.</p>',
    'codeweek_in_numbers-title' => 'Από μία σπίθα σε ένα κίνημα',
    'codeweek_in_numbers-text' => 
                                    '<p>Αυτό που ξεκίνησε το 2013 ως μια μικρή πρωτοβουλία έχει εξελιχθεί σε ένα κίνημα που διαρκεί όλο το χρόνο και που φτάνει σε εκατομμύρια ανθρώπους. Η EU Code Week είναι πλέον μια συνεχής πρωτοβουλία, με χιλιάδες δραστηριότητες που λαμβάνουν χώρα καθ\' όλη τη διάρκεια του έτους στην Ευρώπη και όχι μόνο. Η εκδήλωση διάρκειας δύο εβδομάδων κάθε Οκτώβριο είναι το αποκορύφωμα αυτών των προσπαθειών — ένας εορτασμός μιας ώθησης με γνώμονα την κοινότητα για να γίνει ο προγραμματισμός, η ψηφιακή δημιουργικότητα και η εκπαίδευση STEM προσβάσιμη σε όλους.</p>

                    <p>Με δεκάδες χιλιάδες δραστηριότητες και ένα διαρκώς αναπτυσσόμενο δίκτυο δασκάλων, μαθητών και συνεργατών, η Code Week συνεχίζει να εμπνέει την καινοτομία και να εξοπλίζει την επόμενη γενιά με τις δεξιότητες για να διαμορφώσει το μέλλον.
                    </p>',
    'run_by_volunteers-title' => 'Υποστηρίζεται από μία διεθνή κοινότητα',
    'run_by_volunteers-text' => 
                                '<p>Η EU Code Week αποτελείται από μια παθιασμένη κοινότητα εκπαιδευτικών, πρεσβευτών και συνεργατών που ζωντανεύουν τον προγραμματισμό σε όλη την Ευρώπη. Οι Πρεσβευτές του Code Week συντονίζουν τις δραστηριότητες στις χώρες τους, ενώ οι Κορυφαίοι Δάσκαλοι είναι μια αυξανόμενη κοινότητα με περισσότερους από 450 εκπαιδευτικούς από όλη την Ευρώπη, που ενθαρρύνουν σχολεία, δασκάλους και μαθητές να οργανώσουν δραστηριότητες και να τις καταχωρήσουν στον <a href="/community?country_iso=IE">χάρτη του Code Week</a>.
                                </p>
                                <p>Οποιοσδήποτε μπορεί να συνεισφέρει προσθέτοντας τη δική του δραστηριότητα στον χάρτη. Μαζί, μπορούμε να κάνουμε την κωδικοποίηση προσβάσιμη σε όλους!
                                </p>',
    'supported_by_commission-title' => 'Με τη στήριξη της Ευρωπαϊκής Επιτροπής',
    'supported_by_commission-text' => 
                                        '<p>Η EU Code Week ξεκίνησε το 2013 από τους Young Advisors for the Digital Agenda Europe. Η Ευρωπαϊκή Επιτροπή υποστηρίζει την EU Code Week ως μέρος της στρατηγικής της για μια <a href="http://ec.europa.eu/priorities/digital-single-market/">ψηφιακή ενιαία αγορά</a>. Στο <a href="https://education.ec.europa.eu/focus-topics/digital-education/action-plan">σχέδιο δράσης για την ψηφιακή εκπαίδευση</a>, η Επιτροπή ενθαρρύνει ιδιαίτερα τα σχολεία να συμμετάσχουν στην πρωτοβουλία.
                                        </p>',
    'schools-title' => 'Ενδυναμώνοντας την τάξη',
    'schools-text' => 
                        '<p>Καθηγητές όλων των μαθημάτων και σχολεία όλων των βαθμίδων έχουν σημαντικό ρόλο στην EU Code Week. Συμμετέχοντας, μπορείτε να εμπνεύσετε τους μαθητές σας να εξερευνήσουν τον προγραμματισμό και την ψηφιακή δημιουργικότητα με έναν ελκυστικό και πρακτικό τρόπο. Λάβετε μέρος και ανακαλύψτε πώς να διοργανώσετε την δική σας δραστηριότητα στο <a href="/schools">CodeWeek.eu/Schools</a>
                        </p>',

    'why_coding-title' => 'Γιατί προγραμματισμός; Γιατί το μέλλον είναι δικό σας.',
    'why_coding-text' => 
                        '<p>Ο προγραμματισμός δεν είναι απλά το γράψιμο γραμμών κώδικα – έχει να κάνει με το σχηματισμό ιδεών, την επίλυση προβλημάτων, και τη δημιουργία του κόσμου που θέλετε να δείτε.</p>
                        <p>Η τεχνολογία είναι παντού γύρω μας και η κωδικοποίηση δίνει τη δυνατότητα σε όλους να μετατρέψουν τη φαντασία σε πραγματικότητα, είτε πρόκειται για το σχεδιασμό εφαρμογών, την κατασκευή ρομπότ ή την αντιμετώπιση των πραγματικών προκλήσεων. Αναπτύσσει τη δημιουργικότητα, την επίλυση προβλημάτων και τη συνεργασία — δεξιότητες που ανοίγουν πόρτες σε κάθε τομέα.</p>
                        <p>Η EU Code Week είναι η ευκαιρία σας να εξερευνήσετε, να δημιουργήσετε και να γίνετε μέρος αυτού του ψηφιακού μετασχηματισμού που οδηγεί στην ψηφιακή εκπαίδευση, την καινοτομία και την ενδυνάμωση της κοινότητας! 
                        </p>

                    <p>Ο Αντιπρόεδρος της Ευρωπαϊκής Επιτροπής Viktor Negrescu λέει για τον συνεχιζόμενο αντίκτυπο της EU Code Week: «Είμαι ένθερμος υποστηρικτής του εκδημοκρατισμού της πρόσβασης στην τεχνολογία… εάν θέλουμε η Ευρώπη να παραμείνει ανταγωνιστική, πρέπει να επενδύσουμε στις ψηφιακές δεξιότητες. Είμαι βέβαιος ότι η Κοινοπραξία Code4Europe θα κάνει εξαιρετική δουλειά — καλή τύχη σε εσάς και συνεχίστε να προγραμματίζετε!».</p>',

    'why_coding-quote' => '<p>Ο Alessandro Bogliolo, συντονιστής της ομάδας εθελοντών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, δήλωσε:<blockquote>
                            <p>«Από καταβολής κόσμου κάναμε ένα σωρό πράγματα με την πέτρα, το σίδερο, το χαρτί και το μολύβι·που μεταμόρφωσαν τις ζωές μας. Τώρα ζούμε σε μιαν άλλη εποχή όπου ο κόσμος μας είναι πλασμένος με κώδικες. Διαφορετικές εποχές συνεπάγονται ζήτηση για διαφορετικές θέσεις εργασίας και δεξιότητες. Κατά τη διάρκεια της Εβδομάδας Προγραμματισμού θέλουμε να προσφέρουμε σε κάθε Ευρωπαίο την ευκαιρία να ανακαλύψει τη συγγραφή κώδικα και να διασκεδάσει με αυτήν. Ας μάθουμε, λοιπόν, πώς να συγγράφουμε κώδικες, για να διαμορφώσουμε το μέλλον μας».</p>
                        </blockquote>
                    </p>',
    'join_codeweek-title' => 'Γίνετε μέρος του κινήματος',
    'join_codeweek-text' => 
                            '<p>Η EU Code Week είναι κάτι περισσότερο από μια εκδήλωση — είναι μια επανάσταση με γνώμονα την κοινότητα! <a href="/guide">Πραγματοποιήστε μια δραστηριότητα προγραμματισμού </a> στην πόλη σας, λάβετε μέρος στην <a href="/codeweek4all">πρόκληση Code Week 4 All</a> και συνδεθείτε με καινοτόμους ομοϊδεάτες πέρα από τα σύνορα.</p>
                            <p>Θέλετε να έχετε ακόμα μεγαλύτερο αντίκτυπο; Συνδεθείτε με τον τοπικό σας κόμβο για να βρείτε τη δική σας <a href="/community?country_iso=IE">κοινότητα</a> και να συμβάλετε στη διαμόρφωση του μέλλοντος της κωδικοποίησης στη χώρα σας! 
                            </p>
                            <p>Μπορείτε επίσης να ενημερώνεστε για τις πρωτοβουλίες της τοπικής κοινότητας και τις διεθνείς εξελίξεις μέσω του <a href="/blog/">blog</a> μας.
                            </p>',
    'partners_and_sponsors' => 'Γνωρίστε τους συνεργάτες και τους χορηγούς μας',
    'about_banner_title'=>'Ενδυναμώνοντας την Ευρώπη με ψηφιακές δεξιότητες',
    'about_banner_content'=>'Η EU Code Week διεγείρει τη δημιουργικότητα, την επίλυση προβλημάτων και τη συνεργασία, καθιστώντας την κωδικοποίηση και τις ψηφιακές δεξιότητες προσβάσιμες σε όλους, όλο το χρόνο.',
    'partners_and_sponsors-title' => 'Η Κοινοπραξία Code4Europe: Οδηγώντας το μέλλον της Code Week',
    'partners_and_sponsors-content'=>
                                        '<p>Η Κοινοπραξία Code4Europe που ηγείται τώρα της EU Code Week, αποτελείται από περισσότερους από 40 εταίρους στον κλάδο της εκπαίδευσης και της τεχνολογίας από 20 χώρες. Μαζί, διασφαλίζουμε τη συνεχή ανάπτυξη της Code Week, επεκτείνοντας την ψηφιακή εκπαίδευση και ενισχύοντας τη συνεργασία σε όλη την Ευρώπη.
                                        </p>
                                        <p>Με μια ισχυρή κοινότητα εκπαιδευτικών, πρεσβευτών και ηγετών του κλάδου, διαμορφώνουμε το μέλλον του προγραμματισμού– καθιστώντας την πιο προσιτό, συμπεριληπτικό και αποτελεσματικό.
                                        </p>',

];
