<?php

   /*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [

    'languages' => [
        'en' => 'Αγγλικά',
        'fr' => 'Γαλλικά',
        'bg' => 'Βουλγαρικά',
        'mt' => 'Μαλτέζικα',
        'hr' => 'Κροατικά',
        'de' => 'Γερμανικά',
        'pl' => 'Πολωνικά',
        'cs' => 'Τσέχικα',
        'el' => 'Ελληνικά',
        'pt' => 'Πορτογαλικά',
        'da' => 'Δανέζικα',
        'hu' => 'Ουγγρικά',
        'ro' => 'Ρουμάνικα',
        'nl' => 'Ολλανδικά',
        'ga' => 'Ιρλανδικά',
        'sk' => 'Σλοβακικά',
        'it' => 'Ιταλικά',
        'sl' => 'Σλοβενικά',
        'et' => 'Εσθονικά',
        'lv' => 'Λετονικά',
        'es' => 'Ισπανικά',
        'fi' => 'Φινλανδικά',
        'lt' => 'Λιθουανικά',
        'sv' => 'Σουηδικά',
        'al' => 'Αλβανικά',
        'ba' => 'Βοσνιακά',
        'mk' => 'Σλαβομακεδονικά',
        'me'=> 'Μαυροβουνιακά',
        'rs' => 'Σερβικά'
    ],

    'resources_local_title'=>'Πόροι για τον προγραμματισμό από',
    'are_you_a_teacher' => 'Είσαι εκπαιδευτικός;',
    'get_involved_banner' => 'Κάνε κλικ εδώ για να μάθεις πώς να συμμετάσχεις!',
    'days'=>'Ημέρες',
    'hours'=>'Ώρες',
    'minutes'=>'Λεπτά',
    'seconds'=>'Δευτερόλεπτα'

];
