<?php

   /*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [

    'languages' => [
        'en' => 'ΑΓΓΛΙΚΑ',
        'fr' => 'ΓΑΛΛΙΚΑ',
        'bg' => 'ΒΟΥΛΓΑΡΙΚΑ',
        'mt' => 'ΜΑΛΤΕΖΙΚΑ',
        'hr' => 'ΚΡΟΑΤΙΚΑ',
        'de' => 'ΓΕΡΜΑΝΙΚΑ',
        'pl' => 'ΠΟΛΩΝΙΚΑ',
        'cs' => 'ΤΣΕΧΙΚΑ',
        'el' => 'ΕΛΛΗΝΙΚΑ',
        'pt' => 'ΠΟΡΤΟΓΑΛΙΚΑ',
        'da' => 'ΔΑΝΕΖΙΚΑ',
        'hu' => 'ΟΥΓΓΡΙΚΑ',
        'ro' => 'ΡΟΥΜΑΝΙΚΑ',
        'nl' => 'ΟΛΛΑΝΔΙΚΑ',
        'ga' => 'ΙΡΛΑΝΔΙΚΑ',
        'sk' => 'ΣΛΟΒΑΚΙΚΑ',
        'it' => 'ΙΤΑΛΙΚΑ',
        'sl' => 'ΣΛΟΒΕΝΙΚΑ',
        'et' => 'ΕΣΘΟΝΙΚΑ',
        'lv' => 'ΛΕΤΟΝΙΚΑ',
        'es' => 'ΙΣΠΑΝΙΚΑ',
        'fi' => 'ΦΙΝΛΑΝΔΙΚΑ',
        'lt' => 'ΛΙΘΟΥΑΝΙΚΑ',
        'sv' => 'ΣΟΥΗΔΙΚΑ',
        'al' => 'ΑΛΒΑΝΙΚΑ',
        'ba' => 'ΒΟΣΝΙΑΚΑ',
        'mk' => 'ΣΛΑΒΟΜΑΚΕΔΟΝΙΚΑ',
        'me' => 'ΜΑΥΡΟΒΟΥΝΙΑΚΑ',
        'rs' => 'ΣΕΡΒΙΚΑ',
        'mt' => 'Μαλτέζικα',
        'tr' => 'Τουρκικά'
    ],

    'resources_local_title'=>'Πόροι για τον προγραμματισμό από',
    'are_you_a_teacher' => 'Είσαι εκπαιδευτικός;',
    'get_involved_banner' => 'Κάνε κλικ εδώ για να μάθεις πώς να συμμετάσχεις!',
    'days'=>'Ημέρες',
    'hours'=>'Ώρες',
    'minutes'=>'Λεπτά',
    'seconds'=>'Δευτερόλεπτα'

];
