<?php

return [
    'chatbot' => [
        'title' => 'Δημιούργησε ένα διαλογικό ρομπότ',
        'author' => 'Ομάδα Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'purposes' => [
            'Διαδραστικοί γρίφοι προγραμματισμού',
            'Χρησιμοποίησε τον προγραμματισμό για να δημιουργήσεις διαλόγους ανάμεσα σε ένα διαλογικό ρομπότ και έναν χρήστη'
        ],
        'description' =>
            'Προγραμμάτισε μια συζήτηση ανάμεσα σε ένα διαλογικό ρομπότ και έναν χρήστη ο οποίος προσπαθεί να λύσει έναν γρίφο. Προσπάθησε να φτιάξεις ένα διαλογικό ρομπότ το οποίο να μπορεί να συνομιλεί σαν άνθρωπος. Αντί για γρίφο μπορείς να δημιουργήσεις έναν διάλογο ανάμεσα σε ένα διαλογικό ρομπότ και έναν χρήστη.',
        'instructions' => [
            'Σκέψου έναν γρίφο',
            'Συνδέσου στο',
            'ή δημιούργησε νέο λογαριασμό. (Όταν δημιουργείς νέο λογαριασμό να έχεις κατά νου ότι τα πραγματικά ονόματα δεν επιτρέπονται στο Pencil Code για λόγους προστασίας προσωπικών δεδομένων.)',
            'Πάτησε επάνω στο Imagine (Φαντάσου) και στο Make your own (Φτιάξε το δικό σου)',
            'Χρησιμοποίησε μπλοκ ή τη λειτουργία που βασίζεται σε κείμενο, για να γράψεις τον γρίφο σου',
            'Εναλλακτικά, μπορείς να χρησιμοποιήσεις',
            'αυτόν τον κώδικα',
            'και να τον προσαρμόσεις στον γρίφο σου ή μπορείς να επιλέξεις Answering a riddle (Απάντηση σε έναν γρίφο) από το μενού και να την επεξεργαστείς'
        ],
        'example' => 'Δες αυτό το παράδειγμα γρίφου.',
        'more' => [
            'Αυτός ο κώδικας έχει προσαρμοστεί από δραστηριότητα του Pencil Code',
            'Answering the Riddle'
        ]
    ],

    'paper-circuit' => [
        'title' =>
            'Προγραμμάτισε αλλά χωρίς σύνδεση στο διαδίκτυο: Δημιούργησε κύκλωμα επάνω σε ένα χαρτί',
        'author' => 'Ομάδα Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'purposes' => [
            'Ενίσχυση της δημιουργικότητας',
            'ανάπτυξη δεξιοτήτων επίλυσης προβλημάτων'
        ],
        'description' => [
            'Σχεδίασε ένα αντικείμενο της επιλογής σου. Μπορεί να είναι ένας νυχτερινός ουρανός, μια πασχαλίτσα, ένα ρομπότ, ένα χριστουγεννιάτικο δέντρο ή οτιδήποτε βάλει ο νους σου. Μπορείς ελεύθερα να εξατομικεύσεις το έργο σου, με οπτικά βοηθήματα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού: μπορείς να εξερευνήσεις την',
            'εργαλειοθήκη εκπαιδευτικού της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
            'και να κατεβάσεις όσα λογότυπα ή οπτικά βοηθήματα θέλεις. Μπορείς ακόμη να δημιουργήσεις μια πρόσκληση για την Ευρωπαϊκή Εβδομάδα Προγραμματισμού, χρησιμοποιώντας ένα κύκλωμα επάνω σε χαρτί. Πρόσθεσε ένα εμψυχωτικό μήνυμα στο κύκλωμά σου, ώστε να προτρέψεις άλλους εκπαιδευτικούς να συμμετάσχουν στην Εβδομάδα Προγραμματισμού και / ή να επισκεφτούν τον ειδικό ιστότοπο για τα σχολεία. '
        ],
        'instructions' => [
            'Σχεδίασε ένα αντικείμενο και αποφάσισε ποια τμήματα θα φωτίζονται(π. χ. τα αστέρια).',
            'Φτιάξε μια τρύπα στο χαρτί με ένα μολύβι και πέρασε ένα αυτοκόλλητο LED σε κάθε φωτισμένη πλευρά. ',
            'Σχεδίασε ένα κύκλο όπου θα τοποθετήσεις την κουμπί-πλακέ μπαταρία. ',
            'Σχεδίασε μια διαδρομή + και μια διαδρομή-στην άλλη μεριά του χαρτιού. Βεβαιώσου ότι το μακρύτερο πόδι του αυτοκόλλητου κυκλώματος LED συνδέεται στην πλευρά “ + ” της μπαταρίας, και το κοντύτερο στην πλευρά “-” της μπαταρίας. ',
            'Άπλωσε την ταινία χαλκού στις διαδρομές. ',
            'Διπλώστε το χαρτί με τέτοιον τρόπο ώστε, όταν το χαρτί καλύπτει την μπαταρία, να ανάβει το LED. Μπορείς να χρησιμοποιήσεις έναν συνδετήρα για να είναι σίγουρο ότι η επαφή με την ταινία χαλκού είναι καλή.',
            'Βγάλε μια φωτογραφία του κυκλώματός σου επάνω στο χαρτί και κοινοποίησέ το στο Instagram, εξηγώντας γιατί θεωρείς ότι αξίζει τον κόπο να συμμετάσχεις σε αυτήν την πρωτοβουλία.  '
        ],
        'example' => 'Δες ορισμένα παραδείγματα κυκλωμάτων επάνω σε χαρτί',
        'materials' => [
            'χαρτί ή χαρτόνι',
            'κηρομπογιές ή μαρκαδόρος',
            'κουμπί-πλακέ μπαταρία',
            'ταινία χαλκού',
            'αυτοκόλλητα κυκλώματος LED',
            'συνδετήρας'
        ]
    ],

    'dance' => [
        'title' => 'Στήσε έναν χορό',
        'author' => 'Ομάδα Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'purposes' => [
            'Για να μάθεις βασικές έννοιες προγραμματισμού',
            'Για να μάθεις πώς να δίνεις ζωή σε χαρακτήρες'
        ],
        'description' =>
            'Σε αυτήν την πρόκληση, θα δημιουργήσεις μια παρέα ηρώων, οι οποίοι θα χορέψουν όλοι μαζί. Θα χρησιμοποιήσεις ενσωματωμένη βιβλιοθήκη πολυμέσων για να επιλέξεις τους χαρακτήρες και τα μουσικά κομμάτια ή μπορείς να δημιουργήσεις τα δικά σου. Θα δώσεις ζωή στους χαρακτήρες, κάνοντάς τους να χορεύουν και να μιλάνε μεταξύ τους. ',
        'instructions' => [
            'Συνδέσου στο',
            'ως εκπαιδευτικός. Δημιούργησε λογαριασμούς μαθητών και στείλε τους στους μαθητές σου. Εναλλακτικά, στείλε έναν κωδικό τάξης και βάλε τους μαθητές σου να εγγραφούν με την ηλεκτρονική διεύθυνση του σχολείου τους. Αν είσαι μαθητής, μπορείς να συμμετάσχεις ως μαθητής, αλλά θα σου ζητηθεί να δώσεις την ηλεκτρονική διεύθυνση των γονιών σου, για να εγκρίνουν τον λογαριασμό σου. ',
            'Πάτησε',
            'και δώσε έναν τίτλο',
            'Πήγαινε στο',
            'για να προσθέσεις ένα υπόβαθρο, πατώντας το εικονίδιο με το γρανάζι. Επίλεξε ένα υπόβαθρο από τη βιβλιοθήκη πολυμέσων, ανέβασε τη δική σου εικόνα ή μπορείς, επίσης, να βγάλεις μια φωτογραφία και να την ανεβάσεις. Επίλεξε ένα μουσικό κομμάτι και πρόσθεσέ το στο σκηνικό:',
            'Πάτησε το',
            'κουμπί για να προσθέσεις χαρακτήρες ή αντικείμενα στα οποία θα δώσεις ζωή, κάνοντάς τα να κινούνται, να μιλάνε και να αλληλεπιδρούν μεταξύ τους. Πρόσθεσε δύο ή τρεις χαρακτήρες της επιλογής σου. Μπορείς να ζωγραφίσεις εσύ τους ηθοποιούς σου ή να τροποποιήσεις τους ήδη υπάρχοντες. Πρόσθεσε διαφορετικά ρούχα στον χαρακτήρα σου, πατώντας επάνω στο εικονίδιο με το μολύβι. ',
            'Πάτησε επάνω σε κάθε χαρακτήρα και δώσε του ζωή, προσθέτοντας τα ακόλουθα μπλοκ',
            'Πρόσθεσε ένα',
            'say block(μπλοκ λόγου)',
            'και βάλε τους ηθοποιούς σου να μιλάνε μεταξύ τους. Άλλαξε το σχήμα στις φούσκες ομιλίας καθώς και τη γραμματοσειρά και το μέγεθος του κειμένου σου'
        ],
        'example' => [
            'Πάρε ιδέες από',
            'αυτό το παράδειγμα',
            'ρομπότ που χορεύουν. Μπορείς ελεύθερα να το χρησιμοποιήσεις και να βασιστείς επάνω του για να φτιάξεις παραλλαγές του. '
        ]
    ],

    'compose-song' => [
        'title' => 'Φτιάξε μια μουσική σύνθεση',
        'author' => 'Ευρωπαϊκή Εβδομάδα Προγραμματισμού',
        'purposes' => [
            'Να μάθεις προγραμματισμό μέσα από τη μουσική',
            'Να ξεχωρίζεις είδη μουσικής και όργανα',
            'Να συνθέσεις ένα τραγούδι, μιξάροντας μουσικά κομμάτια'
        ],
        'description' =>
            'Σε αυτήν την πρόκληση, θα φτιάξεις μια μουσική σύνθεση, χρησιμοποιώντας μια γλώσσα προγραμματισμού. Μπορείς να χρησιμοποιήσεις ενσωματωμένα ηχητικά κομμάτια ή να ηχογραφήσεις τα δικά σου και να τα μιξάρεις για να δημιουργήσεις μια μουσική σύνθεση. Εκτέλεσε τον κώδικά σου στον σταθμό επεξεργασίας ψηφιακού ήχου και άκουσε την μουσική που συνέγραψες σε κώδικα. Παίξε με τους διάφορους ήχους και τα διάφορα εφέ, προκειμένου να τροποποιήσεις το μουσικό κομμάτι σου. ',
        'instructions' => [
            'Συνδέσου στο',
            'Πάτησε εδώ για να δημιουργήσεις ένα σενάριο',
            'Ονόμασε το σενάριό σου και επίλεξε τη γλώσσα',
            'ως γλώσσα προγραμματισμού',
            'Άρχισε να συγγράφεις τον κώδικά σου ανάμεσα στο',
            'και',
            'γραμμές',
            'Περιηγήσου στα μουσικά κομμάτια στη',
            'βιβλιοθήκη ήχων',
            'και επίλεξε τα μουσικά είδη, τους καλλιτέχνες και τα όργανα που σου αρέσουν',
            'Για να προσθέσεις ένα μουσικό κομμάτι στο τραγούδι σου, πληκτρολόγησε',
            'Ανάμεσα στις παρενθέσεις, θα πρέπει να υπάρχουν οι 4 ακόλουθες παράμετροι, χωρισμένα με κόμματα',
            'Μουσικά κομμάτια(Sound clip)',
            'Τοποθέτησε τον κέρσορά σου ανάμεσα στις παρενθέσεις, πήγαινε στη βιβλιοθήκη ήχων, επίλεξε ένα κομμάτι, και επικόλλησέ το, πατώντας επάνω στο μπλε εικονίδιο επικόλλησης',
            'Αριθμός κομματιού(Track number)',
            'οι αριθμοί κομματιών σε βοηθάνε να οργανώνεις τους ήχους σου ανά είδος οργάνου(φωνητικά, μπάσο, ντραμς, πλήκτρα, κ. λπ.). Πρόσθεσε όσους αριθμούς κομματιών(όργανα) θέλεις. Οι αριθμοί κομματιών εμφανίζονται ως σειρές που εκτείνονται σε όλο το μήκος του σταθμού επεξεργασίας ψηφιακού ήχου(Digital Audio Workstation)',
            'Αρχή μέτρου(Start measure)',
            'δείχνει πότε ο ήχος θα αρχίσει να παίζει. Τα μέτρα είναι μουσικές χρονικές μονάδες. Ένα μέτρο έχει 4 χτύπους',
            'Τέλος μέτρου(End measure)',
            'δείχνει πότε ο ήχος θα σταματήσει να παίζει',
            'Μια τέτοια γραμμή κώδικα θα έχει αυτήν την ακόλουθη εμφάνιση',
            'Μπορείς να προσθέσεις διάφορα εφέ, όπως ένταση για να ενισχύσεις τον ήχο της σύνθεσής σου. Η ένταση κυμαίνεται από-60,0 ντεσιμπέλ έως 12,0 ντεσιμπέλ, με το 0,0 να είναι η αρχική ένταση. ',
            'Γράψε',
            'Στην παρένθεση, γράψε τον αριθμό του κομματιού, VOLUME, GAIN, στάθμη έντασης, το μέτρο όπου ξεκινάει, τη στάθμη και το μέτρο όπου τελειώνει',
            'Αυτό είναι ένα παράδειγμα ενός εφέ ομαλής εξασθένισης του ήχου(fade-in)',
            'και ομαλής ενδυνάμωσης του ήχου(fade-out)'
        ],
        'example' => [
            'Άκουσε',
            'ένα παράδειγμα τραγουδιού κωδικοποιημένου με Earsketch',
            'Μπορείς να εισαγάγεις τον κώδικα και να τον επεξεργαστείς'
        ]
    ],
    'sensing-game' => [
        'title' => 'Φτιάξε ένα παιχνίδι με τους αισθητήρες της βιντεοκάμερας',
        'author' => 'Ομάδα Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'purposes' => [
            'Για να προγραμματίζεις κινούμενα αντικείμενα',
            'Για αναπτύξεις την κατανόηση του τρόπου ελέγχου της ψηφιακής κίνησης με σωματικές κινήσεις',
            'Για να συνθέτεις ένα τραγούδι, μιξάροντας μουσικά κομμάτια'
        ],
        'description' =>
            'Σε αυτήν την πρόκληση, θα δημιουργήσεις ένα απλό παιχνίδι το οποίο χρησιμοποιεί μια βιντεοκάμερα ως αισθητήρα για την ανίχνευση κίνησης, πράγμα που σημαίνει ότι θα μπορείς να ελέγχεις το κινούμενο αντικείμενό σου με σωματικές κινήσεις. Σε αυτό το παιχνίδι, η αποστολή είναι να συλλέξεις όσο το δυνατό περισσότερες φούσκες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού σε 30 δευτερόλεπτα. Αντί να συλλέγεις φούσκες, μπορείς να δημιουργήσεις ένα παιχνίδι στο οποίο κυνηγάς έναν χαρακτήρα ή σκας μπαλόνια με τα χέρια σου. ',
        'instructions' => [
            'Συνδέσου στο',
            'Πάτησε',
            'Πρόσθεσε επέκταση',
            'και επίλεξε',
            'Αισθητήρες της βιντεοκάμερας',
            'Θα ανιχνεύσει πόσο γρήγορα κινείται ένα αντικείμενο. Αν ο αριθμός είναι μικρότερος, θα είναι πιο ευαίσθητο στην κίνηση. ',
            'Πρόσθεσε μια μορφή. Επίλεξε έναν ήχο και πρόσθεσέ τον στη μορφή σου. Αν θέλεις, μπορείς να προσθέσεις',
            'Δημιούργησε κλώνο',
            'για να διπλασιάσεις τη μορφή σου. ',
            'Δημιούργησε δύο μεταβλητές: μία για',
            'Βαθμολογία',
            'και την άλλη για',
            'Χρονοδιακόπτη',
            'και πρόσθεσέ τα στη μορφή. Όρισε τον χρονοδιακόπτη σε 30 και πρόσθεσε',
            'Άλλαξε χρονοδιακόπτη κατά-1',
            'Δημιούργησε νέα μορφή',
            'Τέλος παιχνιδιού',
            'για να τελειώσει το παιχνίδι. Μπορείς επίσης να δημιουργήσεις μια μορφή με τον τίτλο του παιχνιδιού, π. χ., σύλλεξε όλες τις φούσκες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού. '
        ],
        'example' => [
            'Παίξε ένα παιχνίδι με τους αισθητήρες της βιντεοκάμερας Σύλλεξε όλες τις φούσκες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού. Μπορείς ελεύθερα να φτιάξεις παραλλαγές',
            'αυτού του έργου'
        ]
    ],

    'calming-leds' => [
        'title' =>
            'Ηρεμιστικά LED: δημιούργησε μια απλή διάταξη με το micro:bit',
        'author' => 'Εκπαιδευτικό ίδρυμα Micro:bit',
        'duration' => '20 λεπτά',
        'materials' => [
            'μια διάταξη micro:bit και ένα πακέτο μπαταριών(εφόσον διατίθεται)',
            'ένας φορητός υπολογιστής ή ένα tablet με τα οποία να μπορείς να επισκεφτείς το Microsoft MakeCode και το Youtube',
            'microbit. org για τους πόρους της δραστηριότητας'
        ],
        'description' =>
            'Οι μαθητές δημιουργούν μια ψηφιακή διάταξη, χρησιμοποιώντας LED που μπορούν να τους βοηθήσουν να ελέγξουν την αναπνοή τους και να νιώσουν πιο ήρεμοι. Θα τους ζητηθεί να συγγράψουν έναν απλό κώδικα, διερευνώντας κινήσεις και αλληλουχίες. ',
        'instructions' => [
            'Στόχος είναι να δημιουργήσουν μια διάταξη ηρεμιστικών LED, η οποία να λειτουργεί και την οποία θα μπορείτε να χρησιμοποιείτε για να ελέγχετε την αναπνοή σας. Αυτή η διάταξη μπορεί να δημιουργηθεί σε έναν πραγματικό πίνακα micro:bit ή στον προσομοιωτή τού προγράμματος επεξεργασίας MakeCode. ',
            'Η πρόκληση μπορεί να ολοκληρωθεί, χρησιμοποιώντας το πρόγραμμα επεξεργασίας MakeCode και συγγράφοντας μια απλή αλληλουχία κώδικα, όπως εμφανίζεται στο βίντεο / στιγμιότυπο οθόνης. ',
            'Για να αναπτύξουν την πρόκληση, οι μαθητές μπορούν να δουν διάφορα animation και να βγάλουν όλη τη δημιουργικότητά τους στο animation που θα ήθελαν να βλέπουν ώστε να τους βοηθάει να νιώθουν ήρεμοι ή ευχαριστημένοι. ',
            'Περισσότερες πληροφορίες και οδηγίες για το βίντεο σε',
            'αυτόν τον σύνδεσμο'
        ],
        'example' =>
            'Επισκεφτείτε αυτήν τη σελίδα για οδηγίες και βίντεο της πρόκλησης που έχετε ολοκληρώσει, καθώς και για το πώς να συγγράφετε κώδικα',
        'purposes' => [
            'Για να σχεδιάσετε ένα απλό ψηφιακό κατασκεύασμα με βοηθητικό σκοπό',
            'Για να διερευνήσετε τις αλληλουχίες και τις κινήσεις και πώς αυτά λειτουργούν',
            'Για να τεστάρετε απλό κώδικα και να διορθώνετε σφάλματά του',
            'Για να επαναλαμβάνετε ένα σχέδιο, κάνοντας πιο γρήγορες ή αργές τις κινήσεις'
        ]
    ],
    'computational-thinking -and-computational-fluency' => [
        'title' =>
            'Υπολογιστική σκέψη και υπολογιστική ευχέρεια με το ScratchJr',
        'author' =>
            'Σταμάτης Παπαδάκης – Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού Ελλάδα',
        'purposes' => [
            'Για να εξοικειωθείτε με νέες εντολές και περιβάλλοντα εργασίας. ',
            'Για να δημιουργήσετε απλά προγράμματα με εύκολες εντολές αιτίας-αποτελέσματος. ',
            'Για να διενεργείτε απλή διόρθωση σφαλμάτων μέσω της δοκιμής και πλάνης. '
        ],
        'description' =>
            'Σε αυτήν την πρόκληση, τα παιδιά θα ενσωματώσουν έννοιες υπολογιστικής σκέψης στα έργα τους, χρησιμοποιώντας την εφαρμογή ScratchJr, για να κάνουν τις ιστορίες τους πιο ενδιαφέρουσες, συναρπαστικές και συγκινητικές. ',
        'instructions' => [
            'Δεν απαιτείται από τα παιδιά να  γνωρίζουν το ScratchJr. Όλες οι οδηγίες και οι επιλογές των μενού είναι αναγνωρίσιμες μέσα από σύμβολα και χρώματα. Η πρόκληση μπορεί να ολοκληρωθεί μέσα στην τάξη, το εργαστήριο ή ακόμη και σε έναν ανοικτό χώρο, καθώς δεν χρειάζεται να υπάρχει διαδίκτυο. ',
            'Τα παιδιά χρησιμοποιούν την πόλη ως υπόβαθρο, και αξιοποιούν μπλοκ κώδικα για να φτιάξουν ένα αυτοκίνητο το οποίο, οδηγώντας, διασχίζει την πόλη. '
        ],
        'example' => [
            'Τα παιδιά μπορούν να χρησιμοποιήσουν ήχο και μπλοκ κίνησης και να αρχίσουν πάλι μπλοκ για να κάνουν τους χαρακτήρες να χορεύουν. ',
            'Τα παιδιά επιλέγουν ένα υπόβαθρο και έναν χαρακτήρα και χρησιμοποιούν ένα μπλοκ κίνησης για να κάνουν ένα αυτοκίνητο να διασχίσει, οδηγώντας, την πόλη. Τα παιδιά μπορούν να χρησιμοποιούν το μπλοκ ταχύτητας για να επιταχύνουν ή να επιβραδύνουν έναν χαρακτήρα. '
        ],
        'materials' => [
            'Η δωρεάν εφαρμογή',
            'λειτουργεί σε διάφορα λειτουργικά συστήματα και είδη έξυπνων συσκευών',
            'Επίσης, ο',
            'ιστότοπος προσφέρει πληθώρα δωρεάν εκπαιδευτικών υλικών'
        ],
        'duration' => '90 λεπτά'
    ],
    'ai-hour-of-code' => [
        'title' => 'Η ώρα ΤΝ του κώδικα',
        'author' => 'Minecraft Education Edition',
        'purposes' => [
            'Για να δημιουργήσετε λύσεις προγραμματισμού οι οποίες να περιλαμβάνουν αλληλουχίες, συμβάντα, βρόγχους και υποθέσεις',
            'Να κατανέμετε τα βήματα που είναι αναγκαία για την επίλυση ενός προβλήματος σε επακριβή αλληλουχία εντολών',
            'Να διερευνήσετε έννοιες προγραμματισμού'
        ],
        'description' =>
            'Ένα χωριό απειλείται από μια πυρκαγιά και πρέπει εσύ να προγραμματίσεις μια λύση!Γνώρισε τον βοηθό σου στον προγραμματισμό, τον πράκτορα Minecraft, έπειτα προγραμμάτισε τον πράκτορα να περιηγηθεί στο δάσος και να συλλέξει δεδομένα. Αυτά τα δεδομένα θα βοηθήσουν τον πράκτορα να προβλέψει πού θα ανάψουν φωτιές. Μετά προγραμμάτισε τον πράκτορα να βοηθήσει στην πρόληψη της εξάπλωσης της πυρκαγιάς, σώσε το χωριό και φέρε τη ζωή και πάλι στο δάσος. Μάθε τα βασικά για τον προγραμματισμό και διερεύνησε ένα παράδειγμα τεχνητής νοημοσύνης(ΤΝ) από τον πραγματικό κόσμο. ',
        'instructions' => 'Κατέβασε το σχεδιάγραμμα του μαθήματος εδώ',
        'materials' => [
            'Εγκατέστησε το Minecraft: Education Edition',
            'Μετά την εγκατάσταση του Minecraft Education Edition, η πρόκληση βρίσκεται σε',
            'αυτόν τον ιστότοπο'
        ]
    ],
    'create-a-dance' => [
        'title' => 'Οργάνωσε έναν χορό με την Ωδή στον Κώδικα!',
        'purposes' =>
            'Για να εξασκηθείς στον προγραμματισμό με αστείο τρόπο και να νιώσεις ότι συμμετέχεις στην κοινότητα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού. ',
        'description' => [
            'Οργάνωσε έναν χορό με την Ωδή στον Κώδικα!Χρησιμοποίησε το',
            'εκπαιδευτικό υλικό Πάρτι χορού',
            'για να προγραμματίσεις έναν χορό με την Ωδή στον Κώδικα. Ο επίσημος ύμνος της Ευρωπαϊκής Εβδομάδας Προγραμματισμού συγκαταλέγεται στις επιλογές του Πάρτι χορού. '
        ],
        'instructions' => [
            'Οι εντολές παρουσιάζονται με βίντεο μέσα',
            'στο εκπαιδευτικό υλικό',
            'και επίσης αναγράφονται πάνω πάνω σε κάθε επίπεδο'
        ],
        'example' =>
            'Μπορείς να βρεις παρουσιάσεις δημιουργιών μαθητών στην επόμενη σελίδα',
        'materials' => 'Το εκπαιδευτικό υλικό Code. org'
    ],
    'create-a-simulation' => [
        'title' => 'Δημιούργησε μια προσομοίωση!',
        'purposes' => [
            'Για να μάθεις για τις προσομοιώσεις, ενώ παράλληλα εισαγάγονται οι ακόλουθες μεταβλητές: δημιουργία πλήθους, ρυθμοί ανάκαμψης, χρήση μασκών και εμβόλια. ',
            'Για να ενεργοποιηθούν προγενέστερες γνώσεις σχετικά με κρούσματα ιών στον πραγματικό κόσμο, οι οποίες θα εφαρμοστούν σε ένα φανταστικό σενάριο. '
        ],
        'description' =>
            'Σύγγραψε κώδικα για να δημιουργήσεις και να εκτελέσεις τη δική σου προσομοίωση των κρουσμάτων του ιού στη Monster Town. Μάθε να συγγράφεις κώδικες και να κάνεις προβλέψεις σχετικά με το τι θα συμβεί στους κατοίκους της Monster Town. ',
        'instructions' => [
            'Οι εντολές παρουσιάζονται με βίντεο μέσα',
            'στο εκπαιδευτικό υλικό',
            'και επίσης αναγράφονται πάνω πάνω σε κάθε επίπεδο'
        ],
        'example' =>
            'Όταν τελειώσεις, μπορείς να κοινοποιήσεις την προσομοίωσή σου σε άλλους. Κοινοποίησε το δικό σου μήνυμα για το τι πιστεύεις ότι μπορούμε να κάνουμε ώστε να βοηθήσουμε να παραμείνουν οι άλλοι υγιείς, όταν φτάνει στην πόλη ένας υιός. ',
        'materials' => 'Το εκπαιδευτικό υλικό Code. org'
    ],
    'create-your-own-masterpiece' => [
        'title' => 'Δημιούργησε το δικό σου αριστούργημα!',
        'audience' => 'Κατάλληλο για όλες τις ηλικίες',
        'purpose' =>
            'Για να εισαγάγετε έννοιες της επιστήμης υπολογιστών με οπτικό τρόπο και να ξυπνήσετε τη δημιουργικότητα',
        'description' =>
            'Δημιουργήστε το δικό σας αριστούργημα με έναν καλλιτέχνη!Χρησιμοποιήστε μπλοκ κώδικα προκειμένου να κάνετε τον καλλιτέχνη σας να δημιουργήσει ένα μοναδικό έργο τέχνης. ',
        'instructions' => 'Οι εντολές αναγράφονται πάνω πάνω σε κάθε επίπεδο',
        'example' =>
            'Παραδείγματα καλλιτεχνών μπορείτε να βρείτε σε αυτήν τη σελίδα κάτω από το σχέδιο',
        'materials' => [
            'Το πρώτο επίπεδο του εκπαιδευτικού υλικού, μπορείτε να το βρείτε',
            'ΕΔΩ'
        ]
    ],
    'cs-first-unplugged-activities' => [
        'title' =>
            'Επιστήμη υπολογιστών Πρώτες δραστηριότητες χωρίς σύνδεση στο διαδίκτυο',
        'purposes' => [
            'Για τη στήριξη των μαθητών που μαθαίνουν από το σπίτι',
            'Για να κάνουν όλοι ένα διάλειμμα από τις οθόνες τους'
        ],
        'description' =>
            'Το Επιστήμη υπολογιστών Πρώτες δραστηριότητες είναι ένα σετ δραστηριοτήτων που παρουσιάζει στους μαθητές μια σειρά εννοιών της επιστήμης υπολογιστών, χωρίς υπολογιστή. Σχεδιάσαμε αυτό το μάθημα για να αποδείξουμε ότι η επιστήμη υπολογιστών είναι κάτι που υπερβαίνει κατά πολύ απλώς τον κώδικα. ',
        'instructions' => [
            'Θα βρεις το εγχειρίδιο για όλες τις δραστηριότητες στα αγγλικά εδώ',
            'σύνδεσμος',
            'καθώς επίσης και σχεδιάγραμμα μαθήματος στα αγγλικά σε αυτόν τον',
            'Οι δραστηριότητες σε αυτό το μάθημα μπορούν να ολοκληρώνονται ξεχωριστά η καθεμία και με οποιαδήποτε σειρά',
            'Ο εκπαιδευτικός μπορεί να φωτογραφίσει τη διαδικασία εκμάθησης και να την κοινοποιήσει στο Instagram αξιοποιώντας το #CodeWeekChallengeGoogle #GrowWithGoogle'
        ],
        'materials' => [
            'Πέρα από το εγχειρίδιο δραστηριοτήτων, ορισμένες δραστηριότητες απαιτούν ή ίσως βοηθιούνται από πρόσθετα υλικά.',
            'Μικρές μάρκες (σαν ξερά φασόλια) τις οποίες θα χρησιμοποιήσουμε σε έναν χάρτη Network a Neighborhood (δικτύωση μιας γειτονιάς).',
            'Ψαλίδια για να κόψουμε τον τροχό κρυπτογράφησης για την αποστολή κρυφών μηνυμάτων.',
            'Χαρτόνι και κόλλα για να κάνουμε πιο στέρεο τον τροχό κρυπτογράφησης για την αποστολή κρυφών μηνυμάτων.',
            'Μια πινέζα, οδοντογλυφίδα ή έναν συνδετήρα, τον οποίον έχουμε ισιώσει, για να φτιάξουμε τον τροχό κρυπτογράφησης για την αποστολή κρυφών μηνυμάτων.'
        ]
    ],
    'family-care' => [
        'title' => 'Οικογενειακή φροντίδα',
        'experience' => 'Ανοικτό σε όλους',
        'duration' => '5 έως 10 ώρες',
        'author' => '',
        'purposes' => [
            'Για να διερευνήσουμε το θέμα «οικογενειακή φροντίδα» το οποίο είναι κάτι που βρίσκεται μπροστά μας καθημερινά·',
            'Για να δούμε τα προβλήματα ως ευκαιρίες και να βρούμε δημιουργικές λύσεις·',
            'Για να χρησιμοποιήσουμε τον προγραμματισμό για την καινοτόμο εφαρμογή των λύσεων σας·',
            'Για να σχεδιάσουμε αφίσες και να παρουσιάσουμε τις λύσεις σας σε τρίτους·',
            'Για να χρησιμοποιήσουμε τα μέσα κοινωνικής δικτύωσης, ώστε να αυξήσουμε τον απόηχο των έργων σας.'
        ],
        'description' => [
            'Τι σας έρχεται στο νου όταν λέμε σπίτι; Ένα ωραίο σπίτι; Ένα πλούσιο δείπνο που ετοίμασαν οι γονείς; Ένας μυστικός χώρος για τον εαυτό σας; Ένα ζεστό σπίτι ανατροφοδοτεί το σώμα και το πνεύμα μας, όπως ένα βενζινάδικο. Μέσα στη φασαρία και τη βιάση της σύγχρονης ζωής, οι γονείς βιάζονται πάντα για τη δουλειά. Όταν πηγαίνεις βόλτα με φίλους, δεν μπορείς να αφήσεις πίσω τα γατάκια σου. Πώς όμως μπορείς να φροντίζεις την παρέα σου όταν δεν είστε μαζί; Το θέμα της πρόκλησης είναι',
            'Οικογενειακή φροντίδα',
            'Με βάση αυτό το θέμα, οι μαθητές ενθαρρύνονται να αναπτύξουν μια ιδέα για να εκφράσουν αγάπη και να προσφέρουν φροντίδα μέσα από τον προγραμματισμό και το υλισμικό. Ορίστε ορισμένα ζητήματα προς σκέψη',
            'Πόσα μέλη της οικογένειας ζουν στο σπίτι; Ποια είναι αυτά; Έχεις κανένα πρόβλημα από τη συμβίωση μαζί τους; Τι είδους φροντίδα χρειάζεσαι;',
            'Ξέρεις κάποιον, στην κοινότητά σου, που να στερείται φροντίδας από την οικογένεια, περισσότερο από ό,τι οι άλλοι; Πώς μπορείς να τον βοηθήσεις;'
        ],
        'instructions' => [
            'Ανταλλάξτε απόψεις και μελετήστε το θέμα της οικογενειακής φροντίδας',
            'Κατάλογος με τυχόν προβλήματα',
            'Βρείτε πιθανές λύσεις',
            'Επιλέξτε μια λύση',
            'Προγραμματίστε και φτιάξτε σιγά σιγά τη δομή',
            'Σχεδιάστε μια αφίσα για να παρουσιάσετε το έργο',
            'Παρουσιάστε τη στους εκπαιδευτικούς σας και στην οικογένειά σας'
        ],
        'example' => [
            'Μπορείτε να βρείτε ορισμένα παραδείγματα από εδώ',
            'και'
        ],
        'materials' => [
            'Εργαλείο προγραμματισμού:',
            'ή κατεβάστε την',
            'εκδοχή για υπολογιστή',
            'Η mBlock είναι μια γλώσσα προγραμματισμού η οποία βασίζεται στο Scratch',
            'Αυτή η πρόκληση είναι επίσης μια προσαρμογή του διαγωνισμού MakeX global Spark, ενός προγράμματος δημιουργικού σχεδιασμού, βασισμένου στα έργα, για νέους από 6 έως 13 χρονών. ',
            'Η συμμετέχουσα ομάδα θα πρέπει να εστιαστεί στο συγκεκριμένο θέμα και να μηχανευτεί μια λύση μέσα από τον προγραμματισμό λογισμικού και την κατασκευή υλισμικού. ',
            'Οι μαθητές ενθαρρύνονται να ολοκληρώσουν την πρόκληση κατά τη διάρκεια της Εβδομάδας Προγραμματισμού και να απευθυνθούν έτσι σε διεθνές επίπεδο, ώστε να επικοινωνήσουν με άλλους μαθητές και να κερδίσουν βραβεία. ',
            'Για περισσότερες πληροφορίες, επισκεφτείτε τη διεύθυνση:',
            'ή επικοινωνήστε μαζί μας στη διεύθυνση'
        ]
    ],
    'virtual-flower-field' => [
        'title' => 'Καλλιέργησε το εικονικό χωράφι λουλουδιών σου',
        'author' =>
            'Jadga Huegle-Εκπαιδεύτρια Meet and Code και μέλος της ομάδας SAP Snap!',
        'duration' => '30-60 λεπτά',
        'purposes' => [
            'Για να μάθεις προγραμματισμό με έναν απλό, αλλά όμως εκφραστικό έργο. ',
            'Για να μάθεις ότι ο προγραμματισμός μπορεί να είναι καλλιτεχνία και να οδηγεί σε όμορφα πράγματα. ',
            'Για να κάνεις λαμπρότερο το φθινόπωρο χάρη στα πολύχρωμα λουλούδια και στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού. ',
            'Για να αναδείξεις την ποικιλομορφία των λουλουδιών στη γη. ',
            'Για να συμβάλεις στους Στόχους Βιώσιμης Ανάπτυξης(ΣΒΑ), ιδίως στον ΣΒΑ 13 –Κλιματική αλλαγή, οργανώνοντας εκδηλώσεις προγραμματισμού, οι οποίες βελτιώνουν την εκπαίδευση γύρω από την κλιματική αλλαγή, μέσα από την ευαισθητοποίηση για αυτό το θέμα. '
        ],
        'description' =>
            'Φτιάξε ένα πρόγραμμα στο Snap!, με το οποίο να καλλιεργείται ένα εικονικό χωράφι λουλουδιών, με πολλά είδη λουλουδιών και με διαφορετικό αριθμό πετάλων. ',
        'instructions' => [
            'Αν χρειάζεσαι έμπνευση για το από πού να κάνεις την αρχή με αυτήν την πρόκληση, ρίξε μια ματιά σε',
            'αυτό το βίντεο',
            'ή χρησιμοποίησε',
            'αυτό το έγγραφο',
            'για να το ακολουθείς',
            'Η πρόκληση μπορεί να ολοκληρωθεί, προγραμματίζοντας ένα εικονικό χωράφι λουλουδιών στο Snap!(ή στο Scratch) και αναρτώντας ένα στιγμιότυπο οθόνης ή μια φωτογραφία τού αποτελέσματος στο διαδίκτυο. ',
            'Το χωράφι λουλουδιών θα πρέπει να περιλαμβάνει διάφορα είδη λουλουδιών, με διαφορετικό αριθμό πετάλων. Ιδανικά, τα λουλούδια προγραμματίζονται, πράγμα που σημαίνει ότι κατασκευάζονται με χρησιμοποιώντας στάμπες και περιστροφή(ή ζωγραφική και περιστροφή) πετάλων, επαναλαμβανόμενα. ',
            'Ανάρτησε μια εικόνα του εικονικού χωραφιού λουλουδιών σου με το #MeetandCode.'
        ],
        'materials' => [
            'Συνιστούμε τη χρήση του',
            'ωστόσο, το έργο λειτουργεί επίσης σε'
        ]
    ],
    'haunted-house' => [
        'title' => 'Στοιχειωμένο σπίτι σε Hedy',
        'author' =>
            'Felienne Hermans, Πανεπιστήμιο Leiden-Ramon Moorlag, I&I-Εβδομάδα Προγραμματισμού NL',
        'audience' => 'Δάσκαλοι και εκπαιδευτικοί',
        'duration' => '1 ώρα ή 2 ώρες, ανάλογα με το επίπεδο γνώσεων',
        'purposes' => [
            'Να φτιάξετε μια διαδραστική ιστορία για ένα στοιχειωμένο σπίτι.',
            'Να μάθετε προγραμματισμό με τον κώδικα Hedy.'
        ],
        'description' =>
            'Μέσω του κώδικα Hedy, θα φτιάξετε μια ιστορία για ένα στοιχειωμένο σπίτι, με διαδραστικά στοιχεία. Κάθε φορά που εκτελείται κώδικας, θα δημιουργείται και μια νέα ιστορία. Η ιστορία μπορεί επίσης να διαβάζεται φωναχτά από τον υπολογιστή σας και να κοινοποιείται στο διαδίκτυο..',
        'instructions' => [
            'Ξεκινήστε ανοίγοντας έναν φυλλομετρητή και πηγαίνετε στη διεύθυνση hedycode.com.',
            'Ακολουθήστε τις οδηγίες για τα επίπεδα 1-4. Χρησιμοποιήστε τις καρτέλες «Level» (επίπεδο) και «Haunted house» (Στοιχειωμένο σπίτι)',
            'Με τη βοήθεια αυτών των επιπέδων, θα γράψουμε μια διαδραστική ιστορία για ένα στοιχειωμένο σπίτι.',
            'Εκπαιδευτικοί, μπορείτε να βρείτε ένα σχεδιάγραμμα μαθήματος',
            'εδώ',
            'Μπορείτε να βρείτε ένα βίντεο της Felienne Hermans που παρουσιάζει τον κώδικα Hedy σε',
            'αυτόν τον σύνδεσμο'
        ],
        'example' => 'Παράδειγμα στοιχειωμένου σπιτιού στο επίπεδο',
        'materials' => ['Hedy στο', 'επίπεδο 1 έως 4']
    ],
    'inclusive-app-design' => [
        'title' => 'Σχεδιασμός εφαρμογών χωρίς αποκλεισμούς',
        'author' => 'Apple Education',
        'duration' => '60 λεπτά + προαιρετικές δραστηριότητες επέκτασης',
        'purposes' => [
            'Για να ανταλλάσσετε απόψεις, να οργανώνετε, να κατασκευάζετε πρωτότυπα και να κοινοποιείτε μια ιδέα εφαρμογής, στην οποία θα μπορούν όλοι να αποκτήσουν πρόσβαση και την οποία θα μπορούν όλοι να κατανοήσουν.'
        ],
        'description' =>
            'Οι σπουδαίες εφαρμογές ξεκινούν από σπουδαίες ιδέες. Σε αυτήν τη δραστηριότητα, οι μαθητές θα βρουν μια ιδέα για μια εφαρμογή επάνω σε ένα θέμα που τους ενδιαφέρει, μετά θα μάθουν πώς να σχεδιάζουν εφαρμογές, έχοντας κατά νου να αποφεύγουν τους αποκλεισμούς και να προσφέρουν προσβασιμότητα.',
        'instructions' => [
            'Θα βρείτε όλες τις οδηγίες σε αυτόν τον σύνδεσμο',
            'Με αυτό το σχεδιάγραμμα μαθήματος της μίας ώρας, οι εκπαιδευτικοί θα καταφέρουν να καθοδηγήσουν τους μαθητές',
            'Να μάθουν πώς σχεδιάζουμε εφαρμογές χωρίς αποκλεισμούς',
            'Να ανταλλάσσουν ιδέες για θέματα που τους ενδιαφέρουν, ώστε να βρουν μια ιδέα για εφαρμογή',
            'Να περιγράψουν τις ιδέες τους για εφαρμογή και να οργανώσουν δραστηριότητες για τον χρήστη',
            'Να κατασκευάσουν πρωτότυπο για ένα μέρος της εφαρμογής τους σε Keynote',
            'Να κοινοποιήσουν παρουσιάσεις των πρωτότυπών τους και να περιγράψουν πώς αυτά θα υποστηρίζουν χρήστες με διαφορετικά υπόβαθρα και δεξιότητες. '
        ],
        'materials' => [
            'Ανακαλύψτε τη δραστηριότητα του σχεδιασμού εφαρμογών χωρίς αποκλεισμούς στο Κέντρο μάθησης για εκπαιδευτικούς Apple',
            'Το Keynote συνιστάται, αλλά δεν είναι απαραίτητο. '
        ]
    ],
    'silly-eyes' => [
        'title' => 'Γουρλωτά μάτια',
        'author' => 'Ίδρυμα Raspberry Pi',
        'duration' => '25 λεπτά',
        'purposes' => [
            'Να φτιάξετε ένα έργο που να προβλέπει αλληλεπίδραση με τον χρήστη. ',
            'Να εξατομικεύσετε ένα έργο με χρώμα και γραφικές αναπαραστάσεις. ',
            'Να μάθετε για τον σχεδιασμό στις ψηφιακές κατασκευές. '
        ],
        'description' =>
            'Σε αυτό το έργο, θα σχεδιάσετε και θα δημιουργήσετε έναν χαρακτήρα με γουρλωτά μάτια. Τα μεγάλα, γουρλωτά μάτια του χαρακτήρα θα ακολουθούν τον κέρσορα του ποντικιού, κι έτσι θα ζωντανεύει ο χαρακτήρας σας. ',
        'instructions' =>
            'Μπορείτε να αποκτήσετε πρόσβαση στην πλήρη περιγραφή του έργου εδώ',
        'example' =>
            'Ρίξτε μια ματιά στον Gobo, Κάτω από τη θάλασσα και Μην τρως ντόνατς'
    ],
    'train-ai-bot' => [
        'title' => 'Εκπαίδευσε ένα ρομπότ ΤΝ!',
        'purposes' =>
            'Για να μάθεις για την τεχνητή νοημοσύνη(ΤΝ), τη μηχανική μάθηση, τα δεδομένα εκπαίδευσης και τις προκαταλήψεις, ενώ παράλληλα διερευνάς ζητήματα δεοντολογίας και πώς η ΤΝ μπορεί να χρησιμοποιηθεί για την αντιμετώπιση παγκόσμιων προβλημάτων. ',
        'description' =>
            'Εκπαίδευσε ένα ρομπότ ΤΝ με την ΤΝ για τους Ωκεανούς. Σε αυτήν τη δραστηριότητα, θα προγραμματίσεις ή θα εκπαιδεύσεις ΤΝ(τεχνητή νοημοσύνη) να αναγνωρίζει ψάρια ή σκουπίδια. Ας καθαρίσουμε, λοιπόν, τον ωκεανό!',
        'instructions' => [
            'Οι οδηγίες παρουσιάζονται με βίντεο μέσα στο εκπαιδευτικό υλικό',
            'και επίσης αναγράφονται πάνω πάνω σε κάθε επίπεδο'
        ],
        'materials' => [
            'Μπορείς να βρεις το εκπαιδευτικό υλικό εδώ',
            'Αυτό το εκπαιδευτικό υλικό διατίθεται σε πάνω από 25 γλώσσες'
        ]
    ],
    'build-calliope' => [
        'title' => 'Δημιούργησε το δικό σου πρόγραμμα γυμναστικής με το Calliope mini',
        'author' => 'Πρόγραμμα Amazon Future Engineer (Μελλοντικός Μηχανικός στην Amazon) | Πρωτοβουλία Meet and Code με τη συμμετοχή της Calliope gGmbH',
        'purposes' => [
            'Για να εξοικειωθείς με τις ακολουθίες, τα κινούμενα γραφικά, τις επαναλήψεις και τις μεταβλητές παίζοντας.',
            'Για να σχεδιάσεις ένα διάγραμμα δομής.',
            'Για να κάνεις έλεγχο και να εντοπίσεις σφάλματα στον κώδικα.',
            'Για να βελτιστοποιήσεις ένα πρόγραμμα μέσω πειραματισμών, ελέγχων και προσαρμογής της χρηστικότητας.'
        ],
        'duration' => '20-30 λεπτά',
        'description' =>
            'Οι συμμετέχοντες θα αναπτύξουν ένα ψηφιακά ελεγχόμενο πρότυπο το οποίο θα χρησιμοποιεί μια πολύχρωμη φωτεινή λυχνία (LED) με σκοπό την αναπαραγωγή μιας προσχεδιασμένης άσκησης γυμναστικής 10 μονάδων κώδικα.',
        'materials' => [
            'Calliope mini StarterBox (εάν διατίθεται)',
            'Φορητός υπολογιστής ή tablet με τα οποία θα μπορείς να επισκεφθείς το <a href="https://makecode.calliope.cc">https://makecode.calliope.cc</a> ή το <a href="https://calliope.cc">https://calliope.cc</a> και το YouTube με σκοπό την πρόσβαση σε πόρους για τη δραστηριότητα.'
        ],
        'instructions' => [
            'Για να ξεκινήσεις, δημιούργησε ένα πλάνο και καθόρισε τη σειρά των μονάδων κώδικα της άσκησης. Χρησιμοποιώντας το πλάνο, προγραμμάτισε το RGB LED του Calliope mini ώστε να εμφανίζεται το ένα από τα 5 χρώματα στον προκαθορισμένο ρυθμό. Στη συνέχεια, όρισε μια μεταβλητή για τον ρυθμό και τις επαναλήψεις του προγράμματος χρησιμοποιώντας βρόγχους.',
            "Θυμήσου, αν εφάρμοσες το πρόγραμμα και το αποτέλεσμα σου άρεσε, μπορείς να το μοιραστείς μαζί μας στη διεύθυνση info@calliope.cc - ανυπομονούμε να δούμε τι έφτιαξες! Επί τη ευκαιρία, χαρίζουμε 30 Calliope mini και οι νικητές θα επιλεγούν μεταξύ των συμμετεχόντων!",
            "Κοινοποίησε τον κωδικό QR του έργου σου στο Instagram, πρόσθεσε το hashtag #CodeWeekChallenge και κάνε ονομαστική αναφορά του @CodeWeekEU.",
        ],
        'example' => [
            'Ενώ κάθεσαι στον υπολογιστή σου: μπορείς να γίνεις κι εσύ αθλητικός τύπος.',
            'Δημιούργησε ένα πρότυπο προγράμματος γυμναστικής με το Calliope mini το οποίο μπορεί επίσης να δοκιμαστεί στον προσομοιωτή. Η πρόκληση εκτελείται στο πρόγραμμα επεξεργασίας MakeCode προγραμματίζοντας μια απλή ακολουθία κώδικα (βλέπε στιγμιότυπο οθόνης).',
            'Επίλεξε 5 διαφορετικά χρώματα και αντιστοίχησε μια άσκηση γυμναστικής σε κάθε ένα από τα χρώματα π.χ. βαθύ κάθισμα ή εκτάσεις-ανατάσεις με άλμα. Στη συνέχεια, μπορείς να παρατάξεις τα χρώματα με οποιαδήποτε σειρά και να τα γυμνάσεις.'
        ],

    ]
];
