<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Ερωτήσεις',
    'material' => [
        "required" => "Απαραίτητα υλικά",
        "chequered" => "ταμπλό τετραγώνων",
        "footprint" => "ψηφίδες με πατημασιές"
    ],
    'intro' => [
        'title' => 'Εισαγωγή στο Coding@Home',
    ],
    'explorer' => [
        'title' => 'Ο Εξερευνητής',
        'text' => 'Ο Εξερευνητής είναι η πρώτη δραστηριότητα του Coding@Home. Μετακινήστε τον Εξερευνητή στο ταμπλό για να φτάσετε στον στόχο, έχοντας επισκεφτεί όσο το δυνατόν περισσότερα κουτάκια. ',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Βάσει των θέσεων εκκίνησης και τερματισμού όπως φαίνονται στο βίντεο, μπορεί ο Εξερευνητής  να επισκεφτεί όλα τα κουτάκια στο ταμπλό;',
                    2 => 'Ε2. Ποιες θέσεις εκκίνησης και τερματισμού εμποδίζουν τον Εξερευνητή να επισκεφθεί τον μεγαλύτερο αριθμό από κουτάκια στο ταμπλό;'
                ]

        ]

    ],

    'right-and-left' => [
        'title' => 'Δεξιά και Αριστερά',
        'text' => 'Το ‘Δεξιά και Αριστερά’ είναι ένα ανταγωνιστικό και συνεργατικό παιχνίδι. Οι δύο ομάδες συνεργάζονται για να δημιουργήσουν μια διαδρομή προς τον στόχο, ενώ παράλληλα ανταγωνίζονται η μία την άλλη προσπαθώντας να χρησιμοποιήσουν όσο το δυνατόν περισσότερες ψηφίδες από εκείνες που τους δόθηκαν: η κίτρινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα αριστερά και η κόκκινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα δεξιά.',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στην πρώτη παρτίδα αυτού του βίντεο, μπορεί να κερδίσει κάποια από τις δύο ομάδες;',
                    2 => 'Ε2. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στο παιχνίδι που κέρδισε η Άννα, υπάρχει πιθανότητα ισοπαλίας;',
                    3 => 'Ε3. Υπάρχουν στησίματα εκκίνησης και τερματισμού που θα μπορούσαν να ευνοήσουν μία από τις δύο ομάδες;',
                    4 => 'Ε4. Δεδομένης της φύσης των θέσεων εκκίνησης και τερματισμού, μπορεί να προβλέψει κανείς ποια θα είναι η διαφορά μεταξύ της νικητήριας και της χαμένης ομάδας;'
                ]

        ]

    ],


    'keep-off-my-path' => [
        'title' => '',
        'text' => '',
        'questions' => [
            'content' =>
                [
                    1 => '',
                    2 => '',
                    3 => '',
                    4 => ''
                ]

        ]

    ],

    'tug-of-war' => [
        'title' => '',
        'text' => '',
        'questions' => [
            'content' =>
                [
                    1 => '',
                    2 => '',
                    3 => '',
                ]

        ]

    ],

    'explorer-without-footprints' => [
        'title' => '',
        'text' => '',
        'material' => '',
        'questions' => [
            'content' =>
                [
                    1 => '',
                    2 => '',
                    3 => '',
                    4 => ''
                ]

        ]

    ],

    'texts' => [
        1 => 'Το Coding@Home είναι μια συλλογή σύντομων βίντεο με υλικά για ιδιοκατασκευές, παζλ, παιχνίδια και προκλήσεις προγραμματισμού για καθημερινή χρήση τόσο μέσα στην οικογένεια όσο και στο σχολείο. Για τις δραστηριότητες αυτές δεν απαιτούνται προηγούμενες γνώσεις ή ηλεκτρονικές συσκευές. Οι δραστηριότητες θα αφυπνίσουν την υπολογιστική σκέψη και θα καλλιεργήσουν τις δεξιότητες των μαθητών, των γονέων και των δασκάλων στο σπίτι ή στο σχολείο.',
        2 => 'Η σειρά Coding@Home της Ευρωπαϊκής Εβδομάδας Προγραμματισμού βασίζεται στην πρωτοβουλία <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">“Coding in famiglia”</a> του Πανεπιστημίου του Ουρμπίνο και της CodeMOOCnet σε συνεργασία με την Rai Cultura. Ο Alessandro Bogliolo είναι Καθηγητής Συστημάτων Επεξεργασίας Πληροφοριών στο Πανεπιστήμιο του Ουρμπίνο, <a href="/ambassadors?country_iso=IT" target="_blank">Ιταλός Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> και συντονιστής όλων των Πρέσβεων καθώς και μέλος του Διοικητικού Συμβουλίου του Συνασπισμού για τις ψηφιακές δεξιότητες και τις θέσεις εργασίας. ',
        3 => 'Εάν σας ενδιαφέρουν περισσότερες δραστηριότητες χωρίς σύνδεση στο διαδίκτυο ή δραστηριότητες σε διάφορες γλώσσες προγραμματισμού, ρομποτική, micro:bit κ.λπ., ρίξτε μια ματιά στα <a href="/training">Εκπαιδευτικά Προγράμματα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> με βίντεο μαθημάτων και πλάνα μαθήματος για δημοτικό, γυμνάσιο και λύκειο. Δείτε επίσης τη σελίδα Πόρων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού για <a href="/resources/learn">μαθητές</a> και <a href="/resources/teach">δασκάλους.</a> '
    ]
];