<?php

return [
    'title' => 'Coding@Home',
    'questions' => 'Ερωτήσεις',
    'material' => [
        'required' => 'Απαραίτητα υλικά',
        'chequered' => 'ταμπλό τετραγώνων',
        'footprint' => 'ψηφίδες με πατημασιές',
    ],
    'intro' => [
        'title' => 'Εισαγωγή στο Coding@Home',
    ],
    'explorer' => [
        'title' => 'Ο Εξερευνητής',
        'text' => 'Ο Εξερευνητής είναι η πρώτη δραστηριότητα του Coding@Home. Μετακινήστε τον Εξερευνητή στο ταμπλό για να φτάσετε στον στόχο, έχοντας επισκεφτεί όσο το δυνατόν περισσότερα κουτάκια. ',
        'questions' => [
            'content' => [
                1 => 'Ε1. Βάσει των θέσεων εκκίνησης και τερματισμού όπως φαίνονται στο βίντεο, μπορεί ο Εξερευνητής  να επισκεφτεί όλα τα κουτάκια στο ταμπλό;',
                2 => 'Ε2. Ποιες θέσεις εκκίνησης και τερματισμού εμποδίζουν τον Εξερευνητή να επισκεφθεί τον μεγαλύτερο αριθμό από κουτάκια στο ταμπλό;',
            ],
        ],
    ],

    'right-and-left' => [
        'title' => 'Δεξιά και Αριστερά',
        'text' => 'Το ‘Δεξιά και Αριστερά’ είναι ένα ανταγωνιστικό και συνεργατικό παιχνίδι. Οι δύο ομάδες συνεργάζονται για να δημιουργήσουν μια διαδρομή προς τον στόχο, ενώ παράλληλα ανταγωνίζονται η μία την άλλη προσπαθώντας να χρησιμοποιήσουν όσο το δυνατόν περισσότερες ψηφίδες από εκείνες που τους δόθηκαν: η κίτρινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα αριστερά και η κόκκινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα δεξιά.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στην πρώτη παρτίδα αυτού του βίντεο, μπορεί να κερδίσει κάποια από τις δύο ομάδες;',
                2 => 'Ε2. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στο παιχνίδι που κέρδισε η Άννα, υπάρχει πιθανότητα ισοπαλίας;',
                3 => 'Ε3. Υπάρχουν στησίματα εκκίνησης και τερματισμού που θα μπορούσαν να ευνοήσουν μία από τις δύο ομάδες;',
                4 => 'Ε4. Δεδομένης της φύσης των θέσεων εκκίνησης και τερματισμού, μπορεί να προβλέψει κανείς ποια θα είναι η διαφορά μεταξύ της νικητήριας και της χαμένης ομάδας;',
            ],
        ],
    ],

    'keep-off-my-path' => [
        'title' => 'Μείνε μακριά μου',
        'text' => 'Το «Μείνε μακριά μου» είναι ένα ανταγωνιστικό παιχνίδι δύο ομάδων. Ξεκινώντας από τα δύο άκρα του ταμπλό, οι δύο ομάδες δημιουργούν διαδρομές εμποδίζοντας η μία την άλλη. Η ομάδα που θα καταφέρει να εμποδίσει την άλλη να επεκταθεί, κερδίζει.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Υπάρχουν σημεία εκκίνησης που να ευνοούν μία από τις δύο ομάδες;',
                2 => 'Ε2. Μπορεί να υπάρξει ισοπαλία;',
                3 => 'Ε3. Ο παίκτης που ξεκινάει πρώτος, έχει πλεονέκτημα;',
                4 => 'Ε4. Υπάρχει κάποια αλάθητη στρατηγική παιχνιδιού που μπορεί να υιοθετήσει ο παίκτης που κάνει πρώτος κίνηση, ώστε να βεβαιωθεί ότι δεν θα χάσει;',
            ],
        ],
    ],

    'tug-of-war' => [
        'title' => 'Διελκυστίνδα',
        'text' => 'Η  Διελκυστίνδα είναι ένα συνεργατικό και ανταγωνιστικό παιχνίδι. Ξεκινώντας από το κέντρο, στο κάτω μέρος του ταμπλό,  δύο ομάδες (κίτρινη και κόκκινη) συνεργάζονται για να φτάσουν στην κορυφή. Η κίτρινη ομάδα προσπαθεί να φτάσει στα κουτάκια αριστερά, ενώ η κόκκινη προσπαθεί να φτάσει στα κουτάκια δεξιά.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Υπάρχει κάποια στρατηγική που οδηγεί πάντα σε νίκη;',
                2 => 'Ε2. Ο παίκτης που ξεκινά πρώτος έχει πλεονέκτημα;',
                3 => 'Ε3. Εάν δύο παίκτες είναι εξίσου προσεκτικοί, το παιχνίδι θα καταλήγει πάντα σε ισοπαλία, π.χ. στο κέντρο;',
            ],
        ],
    ],

    'explorer-without-footprints' => [
        'title' => 'Εξερευνητής χωρίς πατημασιές',
        'text' => 'Ο Εξερευνητής περιφέρεται στο ταμπλό από το σημείο εκκίνησης προς τον στόχο, προσπαθώντας να περάσει από όλα τα κουτάκια. Όπως ο Εξερευνητής περπατά, αφήνει πίσω του χρωματιστές πατημασιές, που επιτρέπουν στο ρομπότ να ακολουθήσει τα βήματα ερμηνεύοντας τα χρώματα. Το παιχνίδι γίνεται ακόμη πιο συναρπαστικό, όταν ο Εξερευνητής καθαρίσει όλες της πατημασιές αφήνοντας μόνο τα χρώματα.',
        'material' => 'καθώς και κόκκινοι, κίτρινοι και γκρι μαρκαδόροι (ή ξυλομπογιές)',
        'questions' => [
            'content' => [
                1 => 'Ε1. Ποια είναι η διαφορά ενός ταμπλό γεμάτου χρωματιστές πατημασιές και ενός με χρώματα χωρίς πατημασιές;',
                2 => 'Ε2. Ποιο ταμπλό προσφέρει περισσότερη ελευθερία κινήσεων, διατηρώντας τους ίδιους κανόνες για στρίψιμο, σύμφωνα με τα όσα ορίζουν τα χρώματα;',
                3 => 'Ε3. Υπάρχουν πιθανές διαδρομές στο ταμπλό με χρώματα, που δεν είναι δυνατές στο ταμπλό με τις χρωματιστές πατημασιές;',
                4 => 'Ε4. Υπάρχουν πιθανές διαδρομές στο ταμπλό με τις χρωματιστές πατημασιές, που δεν είναι δυνατές στο ταμπλό μόνο με τα χρώματα;',
            ],
        ],
    ],

    'walk-as-long-as-you-can' => [
        'title' => 'Προχώρησε όσο περισσότερο μπορείς',
        'text' => 'Σ’ αυτή τη δραστηριότητα το ζητούμενο είναι να παραμείνεις όσο περισσότερο μπορείς στο ταμπλό χρησιμοποιώντας χρώματα αντί για ίχνη. Η δραστηριότητα γίνεται πιο δύσκολη όσο αυξάνεται η ελευθερία κινήσεων',
        'coloured-cards' => 'χρωματιστές κάρτες ή μαρκαδόροι κόκκινου, κίτρινου και γκρι χρώματος',
        'questions' => [
            'content' => [
                1 => 'Ε1. Πότε συναντιούνται τα δύο μονοπάτια και μπλοκάρει το ένα το άλλο;',
                2 => 'Ε2. Το παιχνίδι αυτό παρουσιάζεται ως παιχνίδι για δύο παίκτες; Μπορούν να το παίξουν 3 ή 4 παίκτες; Χρειάζεται να αλλάξουν οι κανόνες;',
            ],
        ],
    ],

    'ada-charles-roby' => [
        'title' => 'Άντα, Τσαρλς και Ρόμπι',
        'text' => 'Η ιστορία της Ada Lovelace και του Charles Babbage είναι πολύ ενδιαφέρουσα. Επινόησαν και προγραμμάτισαν υπολογιστές εκατό χρόνια πριν καν εφευρεθούν',
        'material' => 'πηλός και ένα μικρό μολύβι',
        'questions' => [
            'content' => [
                1 => 'Ε1. Φαντάσου ότι το ρομπότ που έφτιαξες με πηλό και ένα μολύβι μπορεί να κινείται πάνω στο ταμπλό για να φτάσει σε οποιαδήποτε θέση και, αν χρειαστεί, να σχεδιάσει το μονοπάτι του. Ποιες εντολές θα χρησιμοποιούσες για να το προγραμματίσεις;',
            ],
        ],
    ],

    'cody-and-roby' => [
        'title' => 'Κόντι και Ρόμπι',
        'text' => 'Πρόκειται για ένα παιχνίδι ρόλων με τον προγραμματιστή, Κόντι, και το ρομπότ, Ρόμπι. Στο βίντεο παρουσιάζονται οι κάρτες Κόντι-Ρόμπι που θα χρησιμοποιούμε στο εξής για να καθορίσουμε τις κινήσεις μας στο ταμπλό. Ο Κόντι θα χρησιμοποιεί τις κάρτες αυτές για να δίνει εντολές στον Ρόμπι για το πώς να κινείται στο ταμπλό',
        'material' => 'ταμπλό χωρισμένο σε τετράγωνα με ετικέτες, κάρτες εντολών (αριστερά, δεξιά, μπροστά), και τυχόν πιόνια που θα τοποθετηθούν στο ταμπλό',
        'starter-kit' => 'Βασικός εξοπλισμός για το παιχνίδι Κόντι-Ρόμπι',
        'questions' => [
            'content' => [
                1 => 'Ε1. Πού θα φτάσει ο Ρόμπι αν, ξεκινώντας από τη θέση C2 με κατεύθυνση προς τον Νότο, εκτελέσει την τελευταία σειρά εντολών που παρουσιάζεται στο βίντεο;',
                2 => 'Ε2. Θα μπορούσαν οι κινήσεις που κάνει ο Ρόμπι εκτελώντας την τελευταία σειρά εντολών που παρουσιάζεται στο βίντεο να περιγραφούν με τις εντολές «Κόντι-Ίχνη» ή «Κόντι-Χρώματα»;',
                3 => 'Ε3. Τα τρία είδη εντολών που παρουσιάζονται στο βίντεο, που αντιστοιχούν στις κάρτες πράσινου, κόκκινου και κίτρινου χρώματος, αποτελούν ένα σύνολο εντολών με τις οποίες μπορούμε να κατευθύνουμε τον Ρόμπι οπουδήποτε στο ταμπλό. Μπορείς να σκεφτείς ένα σύνολο εντολών με λιγότερες από 3 εντολές για να πετύχεις το ίδιο αποτέλεσμα;',
            ],
        ],
    ],

    'the-tourist' => [
        'title' => 'Ο τουρίστας',
        'text' => 'Με τις κάρτες Κόντι-Ρόμπι, δύο ομάδες ανταγωνίζονται για να βρουν σε όσο το δυνατόν λιγότερο χρόνο τη σειρά εντολών που θα κατευθύνει τον τουρίστα στα μνημεία που θέλει να επισκεφτεί στο ταμπλό',
        'material' => 'Οι μεγαλύτερες κάρτες μπορούν να σας φανούν χρήσιμες για να παίξετε το παιχνίδι στο πάτωμα',
        'questions' => [
            'content' => [
                1 => 'Ε1. Με ποια σειρά εντολών μπορούμε να καθοδηγήσουμε τον τουρίστα ώστε να φτάσει στο Άγαλμα του Ραφαήλ στο πρώτο παράδειγμα που παρουσιάζεται στο βίντεο;',
                2 => 'Ε2. Με ποια σειρά εντολών θα καθοδηγήσουμε τον τουρίστα ώστε να φτάσει στην πρόσοψη Τοριτσίνι του Παλάτσο Ντουκάλε στο δεύτερο παράδειγμα που παρουσιάζεται στο βίντεο;',
                3 => 'Ε3. Μπορείς να σκεφτείς έναν διασκεδαστικό τρόπο για να εξασκείσαι κάθε φορά που μία από τις δύο ομάδες επιλέγει να προσθέσει μια κάρτα στο πρόγραμμα; Ξανασκέψου τον αγώνα σκυταλοδρομίας που παρουσιάζεται στο βίντεο και επινόησε τον δικό σου τρόπο',
            ],
        ],
    ],

    'material2' => [
        'chequered-with-labels' => 'ένα ταμπλό χωρισμένο σε τετράγωνα με ετικέτες',
        'cards' => '24 κάρτες «Προχώρησε ευθεία», 8 κάρτες «Στρίψε αριστερά» και 8 κάρτες «Στρίψε δεξιά»',
        'larger-cards' => 'Για την επιδαπέδια έκδοση προτείνεται η χρήση μεγαλύτερων καρτών',
        'video' => 'Το βίντεο εξηγεί πώς μπορείτε να παίξετε χωρίς τη στοίβα με τις κάρτες',
        'pieces-of-paper' => 'Επιπλέον, χρειάζονται 24 χάρτινα κομμάτια για να τοποθετούνται στα τετράγωνα από τα οποία έχετε περάσει ήδη',
        'card-alternative' => 'Αντί για τη στοίβα με τις κάρτες CodyRoby, μπορείτε να χρησιμοποιήσετε τα εικονίδια των καρτών που θα βρείτε εδώ',
        'small-drawings' => 'Μπορείτε επίσης να προσθέσετε μικρά σχέδια που θα βοηθήσουν στην αφήγηση της ιστορίας σας. Μπορείτε να βρείτε αυτά που χρησιμοποιούνται στο βίντεο εδώ',
        'rest-of-cards' => 'Για τα υπόλοιπα, χρησιμοποιούμε τις κάρτες του CodyRoby, το CodyFeet ή το CodyColour.',
    ],

    'catch-the-robot' => [
        'title' => 'Πιάσε το ρομπότ',
        'text' => 'Το «Πιάσε το ρομπότ» είναι ένα επιτραπέζιο ή επιδαπέδιο παιχνίδι ανταγωνισμού. O παίχτης που θα πιάσει το ρομπότ της αντίπαλης ομάδας φτάνοντας στο τετράγωνό του πάνω στο ταμπλό κερδίζει. H τυχαία σειρά των καρτών του παιχνιδιού απαιτεί συνεχή προσαρμογή της στρατηγικής και των δύο ομάδων.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Εάν το ροζ πιόνι (Roby) βρίσκεται στο κεντρικό τετράγωνο C3 με κατεύθυνση προς τον Βορρά και η ροζ ομάδα έχει 2 κάρτες «Προχώρησε ευθεία», 2 κάρτες «Στρίψε αριστερά» και 1 κάρτα «Στρίψε δεξιά», σε ποια τετράγωνα μπορεί να πάει ο Roby;',
            ],
        ],
    ],

    'the-snake' => [
        'title' => 'Φιδάκι',
        'text' => 'Το «Φιδάκι» είναι ένα είδος πασιέντζας που παίζεται με τις κάρτες CodyRoby. Σκοπός του παιχνιδιού είναι να περάσει το φίδι από όλα τα τετράγωνα του ταμπλό χωρίς να δαγκώσει την ουρά του.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Υπάρχουν αφετηρίες που δεν επιτρέπουν στο φίδι να περάσει από όλα τα τετράγωνα χωρίς να δαγκώσει την ουρά του;',
            ],
        ],
    ],

    'storytelling' => [
        'title' => 'Αφηγούμαι μια ιστορία',
        'text' => 'Το σημερινό θέμα είναι η αφήγηση ιστοριών! Χρησιμοποιήστε τις οδηγίες του CodyRoby, τα ίχνη του CodyFeet ή τα χρώματα του CodyColour για να μετακινήσετε τα πιόνια πάνω στο ταμπλό και να αφηγηθείτε μια ιστορία. Σκορπίστε διαφορετικά μέρη της ιστορίας πάνω στο ταμπλό.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Ποιο είναι το πιο ευέλικτο εργαλείο για να κατευθύνει τον Roby ώστε να αφηγηθεί μια ιστορία;',
                2 => 'Ε2. Μπορείτε να τοποθετήσετε πάνω στο ταμπλό τα μέρη της ιστορίας την οποία θέλετε να αφηγηθείτε , σε θέσεις που δεν σας επιτρέπουν να τα ανακτήσετε όλα με το CodyFeet;',
            ],
        ],
    ],

    'two-snakes' => [
        'title' => 'Τα δύο φίδια',
        'text' => 'Με τις κάρτες Κόντι-Ρόμπι, δύο φίδια κινούνται στο ταμπλό προσπαθώντας να εμποδίσει το ένα τις κινήσεις του άλλου. Ο βασικός κανόνας είναι πολύ απλός: δεν μπορείς να επιστρέψεις στο τετράγωνο από το οποίο έχει ήδη περάσει ένα φίδι. Νικητής είναι το φίδι που θα καταφέρει να κινηθεί ελεύθερα για μεγαλύτερο χρονικό διάστημα.',
        'material' => 'Κάρτες Κόντι-Ρόμπι, ταμπλό χωρισμένο σε τετράγωνα 5 × 5, δύο πιόνια, και κομμάτια χαρτιού που τοποθετούνται στα τετράγωνα από τα οποία έχεις ήδη περάσει.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Στην αρχική διάταξη που παρουσιάζεται στο βίντεο, εάν οι δύο παίκτες δεν τραβήξουν κίτρινες κάρτες για να στρίψουν αριστερά, ποιες κάρτες πρέπει να ελπίζουν να τραβήξουν;,',
            ],
        ],
    ],

    'round-trip' => [
        'title' => 'Διαδρομή με επιστροφή',
        'text' => 'Οι ομάδες εναλλάσσονται. Η πρώτη σχεδιάζει τη διαδρομή μετάβασης, ενώ η δεύτερη πρέπει να επιστρέψει τον Ρόμπι στο σημείο εκκίνησης. Φαίνεται εύκολο αλλά δεν είναι, ειδικά αν σχεδιάζετε τις κινήσεις μόνο στο μυαλό σας χωρίς να μετακινείτε στην πραγματικότητα τον Ρόμπι...',
        'material' => 'Κάρτες Κόντι - Ρόμπι, ταμπλό χωρισμένο σε τετράγωνα 5 × 5, δύο πιόνια, και χάρτινα κομμάτια για να σημειώσεις τα τετράγωνα από τα οποία έχεις ήδη περάσει. ',
        'questions' => [
            'content' => [
                1 => 'Ε1. Είναι δυνατόν το πρόγραμμα που επιστρέφει τον Ρόμπι στο σημείο εκκίνησης να είναι συντομότερο(δηλαδή να αποτελείται από λιγότερες εντολές) από τη διαδρομή μετάβασης;',
            ],
        ],
    ],

    'meeting-point' => [
        'title' => 'Σημείο συνάντησης',
        'text' => "Αυτήν τη φορά, σχεδιάζουμε τις κινήσεις μας προτού ξεκινήσουμε. Οι δύο ομάδες τοποθετούν τις κάρτες στο τραπέζι για να δημιουργήσουν τη σειρά εντολών με την οποία θα μετακινήσουν τα αντίστοιχα ρομπότ τους. Όμως, τίποτα δεν κινείται μέχρι ένας από τους παίκτες να φωνάξει «Έναρξη!». Σ' αυτό το σημείο, ο προγραμματισμός τελειώνει και η δράση ξεκινά. Ο παίκτης που θα φωνάξει «Έναρξη!» κερδίζει μόνο εάν τα δύο ρομπότ, εκτελώντας το καθένα τις εντολές της ομάδας του, καταλήξουν στο ίδιο τετράγωνο.",
        'material' => 'Κάρτες Κόντι-Ρόμπι, ταμπλό χωρισμένο σε τετράγωνα 5 × 5, δύο πιόνια.',
        'questions' => [
            'content' => [
                1 => 'Ε1. Αν νομίζετε ότι είναι εφικτό να μην συναντηθούν ποτέ τα δύο ρομπότ, επινοήστε κανόνες παιχνιδιού που καλύπτουν όλες τις πιθανές καταστάσεις.',
            ],
        ],
    ],

    'follow-the-music' => [
        'title' => 'Ακολούθησε τη μουσική',
        'text' => 'Όταν οι σειρές των εντολών προγραμματισμού επαναλαμβάνονται περιοδικά, είναι σαν να βγάζουν κάποιον ρυθμό. Εάν συνδέσουμε έναν ήχο με κάθε εντολή, μπορούμε να καθοδηγήσουμε τον Ρόμπι με μουσική. Αυτό ακριβώς θα κάνουμε τώρα. Θα δημιουργήσω ένα πρόγραμμα για εσάς χρησιμοποιώντας διαφορετικούς ήχους που αντιπροσωπεύουν διαφορετικές εντολές και εσείς θα μετακινείτε τον Ρόμπι στο ταμπλό ακολουθώντας αυτές τις εντολές που βασίζονται σε ήχους.',
        'material' => 'Εκτός από τις κάρτες Κόντι-Ρόμπι, το ταμπλό που είναι χωρισμένο σε τετράγωνα και το πιόνι, πρέπει να φτιάξουμε τρεις διαφορετικούς ήχους. Εγώ χρησιμοποίησα τρία ποτήρια που περιέχουν διαφορετικές ποσότητες νερού, εσείς τι θα χρησιμοποιήσετε;',
        'questions' => [
            'content' => [
                1 => 'Ε1. Προσπαθήστε να παρακολουθείτε το βίντεο και να καθοδηγηθείτε από τους ήχους που παράγουν τα ποτήρια, χωρίς να κοιτάξετε τις κάρτες. Μπορείτε να αναγνωρίσετε και να εκτελέσετε τις εντολές μόνο από τους ήχους;',
                2 => 'Ε2. Επιλέξτε τρεις ήχους για να τους συνδυάσετε με τις τρεις βασικές εντολές. Βρείτε μια σειρά ήχων που θα μπορούσατε να επαναλαμβάνετε αδιάκοπα χωρίς να βγαίνει ποτέ ο Ρόμπι από το ταμπλό...',
            ],
        ],
    ],

    'colour-everything' => [
        'title' => 'Χρωμάτισε τα πάντα',
        'text' => 'Μπορούμε να καθοδηγήσουμε τα ρομπότ στο ταμπλό με τρόπο ώστε να δημιουργήσουν μια ζωγραφιά με τα ίχνη τους; Σε αυτή τη δραστηριότητα, παίζουμε με τον προγραμματισμό και την τέχνη με πίξελ, και δημιουργούμε εικόνες χρωματίζοντας τα τετράγωνα σε ένα ταμπλό, σαν πίξελ σε μια οθόνη.',
        'material' => 'κάρτες CodyRoby, ένα ταμπλό με τετράγωνα και ένα πιόνι. Για να χρωματίσετε τα τετράγωνα, τοποθετήστε πάνω τους κομμάτια χαρτί ή ζωγραφίστε τα με μαρκαδόρους.',
        'questions' => [
            'content' => [
                1 => 'Μπορείτε να ζωγραφίσετε τις δύο καρδιές όπως στο τελευταίο μέρος του βίντεο, οδηγώντας το ρομπότ σε όλα τα τετράγωνα που χρειάζεται, χωρίς να περάσετε δύο φορές από το ίδιο τετράγωνο;',
            ],
        ],
    ],

    'codyplotter-and-codyprinter' => [
        'title' => 'CodyPlotter και CodyPrinter',
        'text' => 'Ποια είναι η διαφορά μεταξύ ενός πλότερ και ενός εκτυπωτή; μπορείτε να το μάθετε με αυτή τη δραστηριότητα χωρίς να είστε συνδεδεμένοι.',
        'material' => 'Εκτός από τα εξαρτήματα του CodyRoby, χρησιμοποίησα έναν πράσινο μαρκαδόρο και ένα καινούργιο ρομπότ από πηλό μοντελισμού, αλλά αυτό είναι προαιρετικό.',
        'questions' => [
            'content' => [
                1 => 'Μπορείτε να εξηγήσετε τη διαφορά ανάμεσα σε έναν πλότερ και έναν εκτυπωτή;',
                2 => 'Ποιο σχέδιο θα παρήγαγε ο RobyPrinter κινούμενος πάνω στις γραμμές του ταμπλό, αν εκτελούσε την ακολουθία εντολών που παρουσιάζονται στο τέλος του βίντεο;',
            ],
        ],
    ],

    'boring-pixels' => [
        'title' => 'Βαρετά πίξελ!/Ας χρησιμοποιήσουμε αριθμούς',
        'text' => 'Αν δίνουμε στον Roby εντολές ώστε να σχηματίσει μια εικόνα σχεδιάζοντας το ένα τετράγωνο μετά το άλλο, δηλαδή το ένα πίξελ μετά το άλλο, διαπιστώνουμε ότι όταν πολλά τετράγωνα μιας σειράς έχουν το ίδιο χρώμα, μπορούμε να χρησιμοποιήσουμε αριθμούς για να καταστήσουμε τη διαδικασία πιο ενδιαφέρουσα. Οι υπολογιστές κάνουν ακριβώς το ίδιο...',
        'material' => 'σημειωματάριο με τετράγωνα, ή ταμπλό με τετράγωνα 5 × 5 που έχει σχεδιαστεί σε ένα κομμάτι χαρτί, στυλό. Για να αναπαραστήσετε τον κώδικα της ζωγραφιάς μπορείτε να χρησιμοποιήσετε στυλό και χαρτί.',
        'questions' => [
            'content' => [
                1 => 'Προσπαθήστε να σχεδιάσετε ένα τετραγωνισμένο σχέδιο και να το αναπαραστήσετε με κωδικοποίηση RLE. Το μέγεθος του σχεδίου είναι ίσο με τον αριθμό των τετραγώνων, ποιο όμως είναι το μέγεθος της αναπαράστασης RLE;',
            ],
        ],
    ],

    'turning-code-into-pictures' => [
        'title' => 'Μετατρέποντας τον κώδικα σε εικόνες',
        'text' => [
            1 => 'Έχουμε δει πλέον ότι μπορούμε να δημιουργήσουμε έναν κώδικα που μας επιτρέπει να σχεδιάσουμε μια εικόνα. Φαντάστηκα ένα σχέδιο και χρησιμοποίησα προγραμματισμό για να το μετατρέψω σε γράμματα και αριθμούς, το οποίο σας έδωσα. Αξιοποιήστε τα γράμματα και τους αριθμούς και χρησιμοποιήστε τον κώδικα για να ανασυνθέστε το σχέδιο.',
            2 => 'Αυτή είναι η εικόνα που είχα φανταστεί, κάντε την να εμφανιστεί στο σημειωματάριό σας και στα σημειωματάρια όσων γνωρίζουν τον κώδικα!',
        ],
        'material' => 'χαρτί (κατά προτίμηση με τετράγωνα) και στυλό.',
        'questions' => [
            'content' => [
                1 => 'Προσπαθήστε να αποκωδικοποιήσετε και να σχεδιάσετε τις εικόνες που αναφέρω στο τέλος του βίντεο.',
            ],
        ],
    ],

    'texts' => [
        1 => 'Το Coding@Home είναι μια συλλογή σύντομων βίντεο με υλικά για ιδιοκατασκευές, παζλ, παιχνίδια και προκλήσεις προγραμματισμού για καθημερινή χρήση τόσο μέσα στην οικογένεια όσο και στο σχολείο. Για τις δραστηριότητες αυτές δεν απαιτούνται προηγούμενες γνώσεις ή ηλεκτρονικές συσκευές. Οι δραστηριότητες θα αφυπνίσουν την υπολογιστική σκέψη και θα καλλιεργήσουν τις δεξιότητες των μαθητών, των γονέων και των δασκάλων στο σπίτι ή στο σχολείο. ',
        2 => 'Η σειρά Coding@Home της Ευρωπαϊκής Εβδομάδας Προγραμματισμού βασίζεται στην πρωτοβουλία <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target = "_blank" > “Coding in famiglia” </a > του Πανεπιστημίου του Ουρμπίνο και της CodeMOOCnet σε συνεργασία με την Rai Cultura. Ο Alessandro Bogliolo είναι Καθηγητής Συστημάτων Επεξεργασίας Πληροφοριών στο Πανεπιστήμιο του Ουρμπίνο, <a href="/ambassadors?country_iso=IT" target = "_blank" > Ιταλός Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού </a > και συντονιστής όλων των Πρέσβεων καθώς και μέλος του Διοικητικού Συμβουλίου του Συνασπισμού για τις ψηφιακές δεξιότητες και τις θέσεις εργασίας. ',
        3 => 'Αν σε ενδιαφέρουν περισσότερες δραστηριότητες χωρίς υπολογιστή ή δραστηριότητες με διαφορετικές γλώσσες προγραμματισμού, ρομποτική ή micro:bit, ρίξε μια ματιά στα <a href="/training">«Learning Bits» της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> που περιλαμβάνει εκπαιδευτικά βίντεο και σχέδια μαθημάτων για σχολεία πρωτοβάθμιας και δευτεροβάθμιας εκπαίδευσης . Ρίξε επίσης μια ματιά στους πόρους της Ευρωπαϊκής Εβδομάδας Προγραμματισμού «Μαθαίνω & Διδάσκω », όπου μπορείς να βρεις δωρεάν πόρους υψηλής ποιότητας από όλο τον κόσμο για εκπαιδευτικούς και μαθητές.',
    ],

     'coding-at-home-text' => 'Μια συλλογή από σύντομα βίντεο, υλικά για να δημιουργείς μόνος σου, παζλ, παιχνίδια και προκλήσεις προγραμματισμού για καθημερινή χρήση στην οικογένεια  καθώς και στο σχολείο.',
    'coding-at-home-sub-text1' => 'Η σειρά Coding@Home της Ευρωπαϊκής Εβδομάδας Προγραμματισμού βασίζεται <a class="text-dark-blue underline" href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">στην πρωτοβουλία «Coding in famiglia»</a> του Πανεπιστημίου του Urbino και της Ένωσης CodeMOOCnet σε συνεργασία με τη Rai Cultura. Ο δημιουργός του Coding@Home βίντεο είναι ο Alessandro Bogliolo, Καθηγητής Συστημάτων Επεξεργασίας Πληροφοριών στο Πανεπιστήμιο του Urbino, <a class="text-dark-blue underline" href="https://codeweek.eu/ambassadors?country_iso=IT" target="_blank">πρεσβευτής της Ιταλικής Ευρωπαϊκής Εβδομάδας Προγραμματισμού της ΕΕ</a> και συντονιστής όλων των πρεσβευτών, καθώς και μέλος του Διοικητικού Συμβουλίου του Συνασπισμού για τις ψηφιακές δεξιότητες και  την εργασιακή απασχόληση.',
    'coding-at-home-sub-text2' => 'Δεν χρειάζεσαι προηγούμενες γνώσεις ή ηλεκτρονικές συσκευές για να κάνεις τις δραστηριότητες. Οι δραστηριότητες θα τονώσουν την υπολογιστική σκέψη και θα καλλιεργήσουν τις δεξιότητες των μαθητών, των γονέων και των εκπαιδευτικών στο σπίτι ή στο σχολείο.',
];
