<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Ερωτήσεις',
    'material' => [
        "required" => "Απαραίτητα υλικά",
        "chequered" => "ταμπλό τετραγώνων",
        "footprint" => "ψηφίδες με πατημασιές"
    ],
    'intro' => [
        'title' => 'Εισαγωγή στο Coding@Home',
    ],
    'explorer' => [
        'title' => 'Ο Εξερευνητής',
        'text' => 'Ο Εξερευνητής είναι η πρώτη δραστηριότητα του Coding@Home. Μετακινήστε τον Εξερευνητή στο ταμπλό για να φτάσετε στον στόχο, έχοντας επισκεφτεί όσο το δυνατόν περισσότερα κουτάκια. ',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Βάσει των θέσεων εκκίνησης και τερματισμού όπως φαίνονται στο βίντεο, μπορεί ο Εξερευνητής  να επισκεφτεί όλα τα κουτάκια στο ταμπλό;',
                    2 => 'Ε2. Ποιες θέσεις εκκίνησης και τερματισμού εμποδίζουν τον Εξερευνητή να επισκεφθεί τον μεγαλύτερο αριθμό από κουτάκια στο ταμπλό;'
                ]

        ]

    ],

    'right-and-left' => [
        'title' => 'Δεξιά και Αριστερά',
        'text' => 'Το ‘Δεξιά και Αριστερά’ είναι ένα ανταγωνιστικό και συνεργατικό παιχνίδι. Οι δύο ομάδες συνεργάζονται για να δημιουργήσουν μια διαδρομή προς τον στόχο, ενώ παράλληλα ανταγωνίζονται η μία την άλλη προσπαθώντας να χρησιμοποιήσουν όσο το δυνατόν περισσότερες ψηφίδες από εκείνες που τους δόθηκαν: η κίτρινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα αριστερά και η κόκκινη ομάδα προσπαθεί να εισαγάγει όσο το δυνατόν περισσότερες στροφές προς τα δεξιά.',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στην πρώτη παρτίδα αυτού του βίντεο, μπορεί να κερδίσει κάποια από τις δύο ομάδες;',
                    2 => 'Ε2. Με τα σημεία εκκίνησης και τερματισμού τοποθετημένα όπως στο παιχνίδι που κέρδισε η Άννα, υπάρχει πιθανότητα ισοπαλίας;',
                    3 => 'Ε3. Υπάρχουν στησίματα εκκίνησης και τερματισμού που θα μπορούσαν να ευνοήσουν μία από τις δύο ομάδες;',
                    4 => 'Ε4. Δεδομένης της φύσης των θέσεων εκκίνησης και τερματισμού, μπορεί να προβλέψει κανείς ποια θα είναι η διαφορά μεταξύ της νικητήριας και της χαμένης ομάδας;'
                ]

        ]

    ],


    'keep-off-my-path' => [
        'title' => 'Μείνε μακριά μου',
        'text' => 'Το «Μείνε μακριά μου» είναι ένα ανταγωνιστικό παιχνίδι δύο ομάδων. Ξεκινώντας από τα δύο άκρα του ταμπλό, οι δύο ομάδες δημιουργούν διαδρομές εμποδίζοντας η μία την άλλη. Η ομάδα που θα καταφέρει να εμποδίσει την άλλη να επεκταθεί, κερδίζει.',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Υπάρχουν σημεία εκκίνησης που να ευνοούν μία από τις δύο ομάδες;',
                    2 => 'Ε2. Μπορεί να υπάρξει ισοπαλία;',
                    3 => 'Ε3. Ο παίκτης που ξεκινάει πρώτος, έχει πλεονέκτημα;',
                    4 => 'Ε4. Υπάρχει κάποια αλάθητη στρατηγική παιχνιδιού που μπορεί να υιοθετήσει ο παίκτης που κάνει πρώτος κίνηση, ώστε να βεβαιωθεί ότι δεν θα χάσει;'
                ]

        ]

    ],

    'tug-of-war' => [
        'title' => 'Διελκυστίνδα',
        'text' => 'Η  Διελκυστίνδα είναι ένα συνεργατικό και ανταγωνιστικό παιχνίδι. Ξεκινώντας από το κέντρο, στο κάτω μέρος του ταμπλό,  δύο ομάδες (κίτρινη και κόκκινη) συνεργάζονται για να φτάσουν στην κορυφή. Η κίτρινη ομάδα προσπαθεί να φτάσει στα κουτάκια αριστερά, ενώ η κόκκινη προσπαθεί να φτάσει στα κουτάκια δεξιά.',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Υπάρχει κάποια στρατηγική που οδηγεί πάντα σε νίκη;',
                    2 => 'Ε2. Ο παίκτης που ξεκινά πρώτος έχει πλεονέκτημα;',
                    3 => 'Ε3. Εάν δύο παίκτες είναι εξίσου προσεκτικοί, το παιχνίδι θα καταλήγει πάντα σε ισοπαλία, π.χ. στο κέντρο;',
                ]

        ]

    ],

    'explorer-without-footprints' => [
        'title' => 'Εξερευνητής χωρίς πατημασιές',
        'text' => 'Ο Εξερευνητής περιφέρεται στο ταμπλό από το σημείο εκκίνησης προς τον στόχο, προσπαθώντας να περάσει από όλα τα κουτάκια. Όπως ο Εξερευνητής περπατά, αφήνει πίσω του χρωματιστές πατημασιές, που επιτρέπουν στο ρομπότ να ακολουθήσει τα βήματα ερμηνεύοντας τα χρώματα. Το παιχνίδι γίνεται ακόμη πιο συναρπαστικό, όταν ο Εξερευνητής καθαρίσει όλες της πατημασιές αφήνοντας μόνο τα χρώματα.',
        'material' => 'καθώς και κόκκινοι, κίτρινοι και γκρι μαρκαδόροι (ή ξυλομπογιές)',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Ποια είναι η διαφορά ενός ταμπλό γεμάτου χρωματιστές πατημασιές και ενός με χρώματα χωρίς πατημασιές;',
                    2 => 'Ε2. Ποιο ταμπλό προσφέρει περισσότερη ελευθερία κινήσεων, διατηρώντας τους ίδιους κανόνες για στρίψιμο, σύμφωνα με τα όσα ορίζουν τα χρώματα;',
                    3 => 'Ε3. Υπάρχουν πιθανές διαδρομές στο ταμπλό με χρώματα, που δεν είναι δυνατές στο ταμπλό με τις χρωματιστές πατημασιές;',
                    4 => 'Ε4. Υπάρχουν πιθανές διαδρομές στο ταμπλό με τις χρωματιστές πατημασιές, που δεν είναι δυνατές στο ταμπλό μόνο με τα χρώματα;'
                ]

        ]

    ],

    'walk-as-long-as-you-can' => [
        'title' => 'Προχώρησε όσο περισσότερο μπορείς',
        'text' => 'Σ’ αυτή τη δραστηριότητα το ζητούμενο είναι να παραμείνεις όσο περισσότερο μπορείς στο ταμπλό χρησιμοποιώντας χρώματα αντί για ίχνη. Η δραστηριότητα γίνεται πιο δύσκολη όσο αυξάνεται η ελευθερία κινήσεων',
        'coloured-cards' => "χρωματιστές κάρτες ή μαρκαδόροι κόκκινου, κίτρινου και γκρι χρώματος",
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Πότε συναντιούνται τα δύο μονοπάτια και μπλοκάρει το ένα το άλλο;',
                    2 => 'Ε2. Το παιχνίδι αυτό παρουσιάζεται ως παιχνίδι για δύο παίκτες; Μπορούν να το παίξουν 3 ή 4 παίκτες; Χρειάζεται να αλλάξουν οι κανόνες;',
                ]

        ]

    ],

    'ada-charles-roby' => [
        'title' => 'Άντα, Τσαρλς και Ρόμπι',
        'text' => 'Η ιστορία της Ada Lovelace και του Charles Babbage είναι πολύ ενδιαφέρουσα. Επινόησαν και προγραμμάτισαν υπολογιστές εκατό χρόνια πριν καν εφευρεθούν',
        'material' => 'πηλός και ένα μικρό μολύβι',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Φαντάσου ότι το ρομπότ που έφτιαξες με πηλό και ένα μολύβι μπορεί να κινείται πάνω στο ταμπλό για να φτάσει σε οποιαδήποτε θέση και, αν χρειαστεί, να σχεδιάσει το μονοπάτι του. Ποιες εντολές θα χρησιμοποιούσες για να το προγραμματίσεις;'
                ]

        ]

    ],

    'cody-and-roby' => [
        'title' => 'Κόντι και Ρόμπι',
        'text' => 'Πρόκειται για ένα παιχνίδι ρόλων με τον προγραμματιστή, Κόντι, και το ρομπότ, Ρόμπι. Στο βίντεο παρουσιάζονται οι κάρτες Κόντι-Ρόμπι που θα χρησιμοποιούμε στο εξής για να καθορίσουμε τις κινήσεις μας στο ταμπλό. Ο Κόντι θα χρησιμοποιεί τις κάρτες αυτές για να δίνει εντολές στον Ρόμπι για το πώς να κινείται στο ταμπλό',
        'material' => 'ταμπλό χωρισμένο σε τετράγωνα με ετικέτες, κάρτες εντολών (αριστερά, δεξιά, μπροστά), και τυχόν πιόνια που θα τοποθετηθούν στο ταμπλό',
        'starter-kit' => 'Βασικός εξοπλισμός για το παιχνίδι Κόντι-Ρόμπι',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Πού θα φτάσει ο Ρόμπι αν, ξεκινώντας από τη θέση C2 με κατεύθυνση προς τον Νότο, εκτελέσει την τελευταία σειρά εντολών που παρουσιάζεται στο βίντεο;',
                    2 => 'Ε2. Θα μπορούσαν οι κινήσεις που κάνει ο Ρόμπι εκτελώντας την τελευταία σειρά εντολών που παρουσιάζεται στο βίντεο να περιγραφούν με τις εντολές «Κόντι-Ίχνη» ή «Κόντι-Χρώματα»;',
                    3 => 'Ε3. Τα τρία είδη εντολών που παρουσιάζονται στο βίντεο, που αντιστοιχούν στις κάρτες πράσινου, κόκκινου και κίτρινου χρώματος, αποτελούν ένα σύνολο εντολών με τις οποίες μπορούμε να κατευθύνουμε τον Ρόμπι οπουδήποτε στο ταμπλό. Μπορείς να σκεφτείς ένα σύνολο εντολών με λιγότερες από 3 εντολές για να πετύχεις το ίδιο αποτέλεσμα;',
                ]

        ]

    ],

    'the-tourist' => [
        'title' => 'Ο τουρίστας',
        'text' => 'Με τις κάρτες Κόντι-Ρόμπι, δύο ομάδες ανταγωνίζονται για να βρουν σε όσο το δυνατόν λιγότερο χρόνο τη σειρά εντολών που θα κατευθύνει τον τουρίστα στα μνημεία που θέλει να επισκεφτεί στο ταμπλό',
        'material' => 'Οι μεγαλύτερες κάρτες μπορούν να σας φανούν χρήσιμες για να παίξετε το παιχνίδι στο πάτωμα',
        'questions' => [
            'content' =>
                [
                    1 => 'Ε1. Με ποια σειρά εντολών μπορούμε να καθοδηγήσουμε τον τουρίστα ώστε να φτάσει στο Άγαλμα του Ραφαήλ στο πρώτο παράδειγμα που παρουσιάζεται στο βίντεο;',
                    2 => 'Ε2. Με ποια σειρά εντολών θα καθοδηγήσουμε τον τουρίστα ώστε να φτάσει στην πρόσοψη Τοριτσίνι του Παλάτσο Ντουκάλε στο δεύτερο παράδειγμα που παρουσιάζεται στο βίντεο;',
                    3 => 'Ε3. Μπορείς να σκεφτείς έναν διασκεδαστικό τρόπο για να εξασκείσαι κάθε φορά που μία από τις δύο ομάδες επιλέγει να προσθέσει μια κάρτα στο πρόγραμμα; Ξανασκέψου τον αγώνα σκυταλοδρομίας που παρουσιάζεται στο βίντεο και επινόησε τον δικό σου τρόπο',
                ]

        ]

    ],


    'texts' => [
        1 => 'Το Coding@Home είναι μια συλλογή σύντομων βίντεο με υλικά για ιδιοκατασκευές, παζλ, παιχνίδια και προκλήσεις προγραμματισμού για καθημερινή χρήση τόσο μέσα στην οικογένεια όσο και στο σχολείο. Για τις δραστηριότητες αυτές δεν απαιτούνται προηγούμενες γνώσεις ή ηλεκτρονικές συσκευές. Οι δραστηριότητες θα αφυπνίσουν την υπολογιστική σκέψη και θα καλλιεργήσουν τις δεξιότητες των μαθητών, των γονέων και των δασκάλων στο σπίτι ή στο σχολείο.',
        2 => 'Η σειρά Coding@Home της Ευρωπαϊκής Εβδομάδας Προγραμματισμού βασίζεται στην πρωτοβουλία <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">“Coding in famiglia”</a> του Πανεπιστημίου του Ουρμπίνο και της CodeMOOCnet σε συνεργασία με την Rai Cultura. Ο Alessandro Bogliolo είναι Καθηγητής Συστημάτων Επεξεργασίας Πληροφοριών στο Πανεπιστήμιο του Ουρμπίνο, <a href="/ambassadors?country_iso=IT" target="_blank">Ιταλός Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> και συντονιστής όλων των Πρέσβεων καθώς και μέλος του Διοικητικού Συμβουλίου του Συνασπισμού για τις ψηφιακές δεξιότητες και τις θέσεις εργασίας. ',
        3 => 'Εάν σας ενδιαφέρουν περισσότερες δραστηριότητες χωρίς σύνδεση στο διαδίκτυο ή δραστηριότητες σε διάφορες γλώσσες προγραμματισμού, ρομποτική, micro:bit κ.λπ., ρίξτε μια ματιά στα <a href="/training">Εκπαιδευτικά Προγράμματα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> με βίντεο μαθημάτων και πλάνα μαθήματος για δημοτικό, γυμνάσιο και λύκειο. Δείτε επίσης τη σελίδα Πόρων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού για <a href="/resources/learn">μαθητές</a> και <a href="/resources/teach">δασκάλους.</a> '
    ]
];