<?php

return [

    'title' => 'Πολιτική για τα cookies',
    'what' => [
        'title' => 'Τι είναι τα cookies;',
        'text' => '<p>Το cookie (ηλεκτρονικό μπισκότο) είναι ένα μικρό αρχείο κειμένου που ένας ιστότοπος αποθηκεύει στον υπολογιστή σας ή στην κινητής σας συσκευή, όταν επισκέπτεστε τον ιστότοπο αυτό.</p>',
        'first_party' => '<strong>Cookies πρώτου μέρους</strong> είναι τα cookies που ρυθμίζονται από τον ιστότοπο που επισκέπτεστε. Μόνο αυτός ο ιστότοπος μπορεί να τα διαβάσει. Επιπλέον, ένας ιστότοπος ενδέχεται να χρησιμοποιεί εξωτερικές υπηρεσίες, οι οποίες επίσης ρυθμίζουν τα δικά τους cookies, τα γνωστά <strong>cookies τρίτου μέρους</strong>.',
        'persistent_cookies' => 'Τα έμμονα cookies είναι αυτά που αποθηκεύονται στον υπολογιστή σας και δεν διαγράφονται αυτόματα, όταν κλείνετε το πρόγραμμα περιήγησης σας, σε αντίθεση με το προσωρινό cookie, που διαγράφεται, όταν κλείνετε το πρόγραμμα περιήγησης.',
        'items' => '<p>Την πρώτη φορά που θα επισκεφτείτε τον ιστότοπο της Εβδομάδας Προγραμματισμού, θα σας ζητηθεί να <strong>δεχθείτε ή να απορρίψετε τα cookies</strong>.</p>

            <p>Αυτό γίνεται, για να μπορεί ο ιστότοπος να θυμάται τις προτιμήσεις σας (όπως όνομα χρήστη, γλώσσα κ.λπ.) για συγκεκριμένο χρονικό διάστημα.</p>

            <p>Έτσι, δεν χρειάζεται να τα εισάγετε ξανά, όταν περιηγείστε στον ιστότοπο κατά τη διάρκεια της ίδιας επίσκεψης.</p>

            <p>Τα cookies μπορούν να χρησιμοποιηθούν και για να διαμορφωθούν ανώνυμα στατιστικά στοιχεία σχετικά με την εμπειρία περιήγησης στους ιστοτόπους μας.</p>
            </p>'
    ],
    'how' => [
        'title' => 'Πώς χρησιμοποιούμε τα cookies;',
        'text1' => '<p>Η Εβδομάδα Προγραμματισμού χρησιμοποιεί κυρίως «cookies πρώτου μέρους». Πρόκειται για cookies που ρυθμίζονται και ελέγχονται από εμάς, κι όχι από εξωτερικό οργανισμό.</p>',
        'text2' => '<p>Ωστόσο, για να δείτε κάποιες από τις σελίδες μας, θα πρέπει να αποδεχθείτε cookies από εξωτερικούς οργανισμούς.</p>',
        '3types' => [
            'title' => 'Τα <strong>3 είδη cookie πρώτου μέρους</strong> που χρησιμοποιούμε στόχο έχουν:',
            '1' => 'να αποθηκεύουν προτιμήσεις των επισκεπτών',
            '2' => 'να καθιστούν τους ιστοτόπους μας λειτουργικούς',
            '3' => 'να συλλέγουν δεδομένα αναλύσεων (σχετικά με τη συμπεριφορά των χρηστών)'
        ],
        'table' => [
            'name'=>'Όνομα',
            'service'=>'Υπηρεσία',
            'purpose'=>'Σκοπός',
            'type_duration'=>'Είδος και διάρκεια cookie',
        ],
        'visitor_preferences' => [
            'title'=> 'Προτιμήσεις επισκέπτη',
            'text'=> '<p>Αυτές ρυθμίζονται από εμάς, και μόνο εμείς μπορούμε να τις διαβάσουμε. Απομνημονεύουν:</p>',
            'item'=> 'αν έχετε συμφωνήσει (ή απορρίψει) την πολιτική για τα cookies του ιστοτόπου',
            'table' => [
                '1' => [
                    'service' => 'Κιτ συγκατάθεσης για cookie',
                    'purpose' => 'Αποθηκεύει τις προτιμήσεις σας σχετικά με τα cookies (ώστε να μην ερωτηθείτε ξανά)',
                    'type_duration' => 'Το προσωρινό cookie πρώτου μέρους διαγράφεται, αφού κλείσετε το πρόγραμμα περιήγησης σας',
                ]
            ]
        ],
        'operational_cookies' => [
            'title' => 'Λειτουργικά cookies',
            'text' => '<p>Υπάρχουν ορισμένα cookies που πρέπει να συμπεριλάβουμε για να λειτουργήσουν ορισμένες ιστοσελίδες. Για τον λόγο αυτό, δεν απαιτούν τη συγκατάθεσή σας. Πιο συγκεκριμένα:</p>',
            'item' => 'τεχνικά cookies που απαιτούνται από συγκεκριμένα συστήματα ΤΠ'
        ],
        'technical_cookies' => [
            'title' => 'Τεχνικά cookies',
            'table' => [
                '1' => [
                    'purpose' => 'Διατηρεί μια ασφαλή περίοδο λειτουργίας για εσάς, κατά τη διάρκεια της επίσκεψής σας.',
                    'type_duration' => 'Το προσωρινό cookie πρώτου μέρους διαγράφεται, αφού κλείσετε το πρόγραμμα περιήγησης σας',
                ],
                '2' => [
                    'purpose' => 'Διατηρεί μια ασφαλή περίοδο λειτουργίας για εσάς για μεγαλύτερο χρονικό διάστημα, αποτρέποντας την απώλεια της περιόδου λειτουργίας κατά το κλείσιμο του προγράμματος περιήγησης.',
                    'type_duration' => 'Έμμονο cookie πρώτου μέρους, 60 μήνες',
                ],
                '3' => [
                    'purpose' => 'Αποθηκεύει την προτεινόμενη γλώσσα χρήστη',
                    'type_duration' => 'Το προσωρινό cookie πρώτου μέρους διαγράφεται, αφού κλείσετε το πρόγραμμα περιήγησης σας',
                ]
            ]
        ],
        'analytics_cookies' => [
            'title' => 'Cookies αναλύσεων',
            'items' => '<p>Τα χρησιμοποιούμε μόνο για εσωτερική έρευνα σχετικά με το πώς μπορούμε να βελτιώσουμε την υπηρεσία που παρέχουμε σε όλους τους χρήστες μας.</p>

            <p>Τα cookies απλώς αξιολογούν τον τρόπο με τον οποίο αλληλεπιδράτε με τον ιστότοπό μας – ως ανώνυμος χρήστης (τα δεδομένα που συλλέγονται δεν σας ταυτοποιούν προσωπικά).</p>

            <p>Επίσης, αυτά τα δεδομένα δεν κοινοποιούνται σε τρίτους ούτε χρησιμοποιούνται για οποιονδήποτε άλλο σκοπό. Τα ανώνυμα στατιστικά στοιχεία θα μπορούσαν να μοιραστούν με αναδόχους που εργάζονται σε έργα επικοινωνίας βάσει συμβατικής συμφωνίας με την Επιτροπή.</p>

            <p>Ωστόσο, είστε ελεύθεροι να απορρίψετε αυτά τα είδη cookies - είτε μέσω του ειδικού πλαισίου για τα cookies που εμφανίζεται στην πρώτη σελίδα που επισκέπτεστε είτε επισκεπτόμενοι αυτήν την <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">ειδική σελίδα</a>.</p>',
            'table' => [
                '1' => [
                    'service' => 'Υπηρεσία ανάλυσης ιστού, με βάση το λογισμικό ανοικτού κώδικα Matomo',
                    'purpose' => 'Αναγνωρίζει τους επισκέπτες του ιστοτόπου (ανώνυμα - δεν συλλέγονται προσωπικές πληροφορίες για τον χρήστη).',
                    'type_duration' => 'Έμμονο cookie πρώτου μέρους, 20 ημέρες',
                ],
                '2' => [
                    'service' => 'Υπηρεσία ανάλυσης ιστού, με βάση το λογισμικό ανοικτού κώδικα Matomo',
                    'purpose' => 'Ταυτοποιεί τις σελίδες που επισκέφτηκε ο ίδιος χρήστης κατά την ίδια επίσκεψη. (ανώνυμα - δεν συλλέγονται προσωπικές πληροφορίες για τον χρήστη).',
                    'type_duration' => 'Έμμονο cookie πρώτου μέρους, 30 λεπτά',
                ]
            ]
        ]

    ],
    'third-party' => [
        'title' => 'Cookies τρίτου μέρους',
        'items' => [
            '1' => '<p>Ορισμένες από τις σελίδες μας εμφανίζουν περιεχόμενο από εξωτερικούς παρόχους, π.χ. YouTube, Facebook και Twitter.</p>

                <p>Για να δείτε αυτό το περιεχόμενο τρίτου μέρους, πρέπει πρώτα να αποδεχτείτε τους συγκεκριμένους όρους και προϋποθέσεις. Αυτό περιλαμβάνει τις πολιτικές για τα cookie τους, τις οποίες δεν ελέγχουμε.</p>

                <p>Αν όμως δεν βλέπετε αυτό το περιεχόμενο, στη συσκευή σας δεν έχουν εγκατασταθεί cookies τρίτου μέρους.</p>Πάροχοι τρίτου μέρους για την Εβδομάδα Προγραμματισμού',
            '2' => 'Αυτές οι υπηρεσίες τρίτου μέρους δεν υπόκεινται στον έλεγχο του ιστοτόπου της Εβδομάδας Προγραμματισμού. Οι πάροχοι ενδέχεται, ανά πάσα στιγμή, να αλλάξουν τους όρους υπηρεσίας τους, τον σκοπό και τη χρήση των cookies, κ.λπ.'
        ]
    ],
    'how-manage' => [
        'title' => 'Πώς μπορείτε να διαχειρίζεστε τα cookies;',
        'items' => '<p>Μπορείτε να <strong>διαχειρίζεστε/διαγράφετε</strong> τα cookies όπως θέλετε - για λεπτομέρειες, δείτε <a
                        href="https://aboutcookies.org">aboutcookies.org</a>.<p><strong>Αφαίρεση cookies από τη συσκευή σας</strong></p>

            <p>Μπορείτε να διαγράψετε όλα τα cookies που βρίσκονται ήδη στη συσκευή σας, εκκαθαρίζοντας το ιστορικό περιήγησης του προγράμματος περιήγησης σας. Αυτό θα αφαιρέσει όλα τα cookies από όλους τους ιστοτόπους που έχετε επισκεφτεί.</p>

            <p>Λάβετε υπόψη ότι ενδέχεται επίσης να χάσετε ορισμένες αποθηκευμένες πληροφορίες (π.χ. αποθηκευμένα στοιχεία σύνδεσης, προτιμήσεις ιστοτόπων).</p><strong>Διαχείριση cookies σχετικά με τον ιστότοπο</strong><p>Για λεπτομερέστερο έλεγχο των cookies συγκεκριμένων ιστοτόπων, ελέγξτε τις ρυθμίσεις απορρήτου και cookie στο προτιμώμενο πρόγραμμα περιήγησης σας</p><strong>Αποκλεισμός cookies</strong><p>Μπορείτε να ρυθμίσετε τα περισσότερα σύγχρονα προγράμματα περιήγησης να αποτρέπουν την αποθήκευση των cookies στη συσκευή σας, αλλά ενδέχεται να χρειαστεί να ρυθμίσετε χειροκίνητα κάποιες προτιμήσεις κάθε φορά που επισκέπτεστε έναν ιστότοπο ή μια ιστοσελίδα. Ορισμένες υπηρεσίες και λειτουργίες ενδέχεται να μην λειτουργούν σωστά ή καθόλου (π.χ. σύνδεση προφίλ).</p><strong>Διαχείριση των cookies αναλύσεων μας</strong><p>Μπορείτε να διαχειρίζεστε τις προτιμήσεις σας σχετικά με cookies από το μενού Ανάλυση στην <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">ειδική σελίδα.</a></p>'
    ]
];
