<?php

return [
    'title' => 'Σημείωση πνευματικών δικαιωμάτων',
    'training' => [
        0 => 'Η ιστοσελίδα για τα σχολεία της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        1 => 'είναι μια υπηρεσία που υποστηρίζεται από την Ευρωπαϊκή Επιτροπή',
    ],
    'licence' => [
        0 => 'Εκτός αν αναφέρεται διαφορετικά, το περιεχόμενο διαθέσιμο σε αυτή την ιστοσελίδα είναι αδειοδοτημένο υπό μια άδεια',
        1 => 'https://creativecommons.org/licenses/by-nc-sa/4.0/deed.el',
        2 => 'Δημιουργικής Κοινής Χρήσης Αναφοράς Δημιουργού - Μη Εμπορική Χρήση - Παρόμοια Διανομή 4.0 Διεθνές (CC BY-NC-SA 4.0)',
    ],
    'creative-commons' => 'Η αδειοδότηση υπό άδειες Δημιουργικής Κοινής Χρήσης δεν επηρεάζει από μόνη της την κυριότητα των πνευματικών δικαιωμάτων',
    'third-party' => 'Περιεχόμενο από τρίτες ιστοσελίδες υπόκειται στους δικούς τους περιορισμούς πνευματικών δικαιωμάτων; Παρακαλούμε να ανατρέξετε στον ιστότοπο προέλευσης για περισσότερες πληροφορίες',

];
