<?php
return [
    "common" => [
        "resources" => "Πηγές που θα χρειαστείτε",
        "soundtrack" => "Το soundtrack της Εβδομάδας Προγραμματισμού",
        "moves"=> "Οι κινήσεις",
        "dance-example" => "Ένα παράδειγμα χορού της Εβδομάδας Προγραμματισμού",
        "organizer-guide" => "Οδηγός διοργανωτή"
    ],
    "title" => [
        "EU Code Week",
        "Έκδοση 2020"
    ],

    "intro" => "Φέτος η γιορτή του προγραμματισμού θα πραγματοποιηθεί από τις 10 έως τις 25 Οκτωβρίου 2020! Λόγω της κατάστασης στον τομέα της υγείας, φέτος περισσότερες δραστηριότητες της Εβδομάδας Προγραμματισμού θα πραγματοποιηθούν επιγραμμικά. Θα παρουσιάσουμε νέες διασκεδαστικές και ενδιαφέρουσες δραστηριότητες στις οποίες μπορείτε να συμμετάσχετε εξ αποστάσεως, από το σπίτι ή το σχολείο ",
    "online-activities" => [
        "title" => "Προτεινόμενες Ανοικτές επιγραμμικές δραστηριότητες",
        "subtitle" => [
            "Για να διευκολύνουμε την εξ αποστάσεως συμμετοχή στις δραστηριότητες της Εβδομάδας Προγραμματισμού, δημιουργούμε ένα",
            "ημερολόγιο",
            "προτεινόμενων επιγραμμικών δραστηριοτήτων"
        ],
        "section1" => [
            "title" => "Τι είναι οι επιγραμμικές δραστηριότητες;",
            "content" => "Επιγραμμική δραστηριότητα είναι κάθε δραστηριότητα που μπορείτε να προσθέσετε ή στην οποία μπορείτε να εγγραφείτε στον ιστότοπο της Εβδομάδας Προγραμματισμού – η μόνη διαφορά είναι ότι πραγματοποιείται επιγραμμικά. Ο στόχος είναι να διευκολύνουμε όσους θέλουν να συμμετάσχουν σε συνεδρίες και εργαστήρια προγραμματισμού από το διαδίκτυο, χωρίς να θέτουμε σε κίνδυνο την υγεία τους"
        ],
        "section2" => [
            "title" => "Προτεινόμενες ανοικτές δραστηριότητες",
            "content" => "Αν θέλετε μπορείτε να κάνετε τις επιγραμμικές δραστηριότητες ανοικτές στον καθένα. Στις ανοικτές επιγραμμικές δραστηριότητες θα μπορούν να συμμετάσχουν άνθρωποι από όλον τον κόσμο, είτε στα αγγλικά είτε στη γλώσσα που χρησιμοποιεί ο καθένας. Θα επιλέξουμε τις πιο συναρπαστικές ανοικτές επιγραμμικές δραστηριότητες  και θα τις προβάλουμε σε ένα ημερολόγιο δραστηριοτήτων στον ιστότοπό μας"
        ],
        "section3" => [
            "title" => "Τι σημαίνει αυτό για τους συμμετέχοντες;",
            "content" => [
                "Κάθε μέρα της Εβδομάδας Προγραμματισμού, θα μπορείτε να συμβουλεύεστε το",
                "ημερολόγιο",
                "και να συμμετέχετε στις δραστηριότητες που σας ενδιαφέρουν περισσότερο. Τα θέματα αυτών των προτεινόμενων δραστηριοτήτων μπορεί να ποικίλλουν: από εργαστήρια ρομποτικής, κύκλους εξ αποστάσεως διδασκαλίας, σεμινάρια στο διαδίκτυο έως μαθήματα προγραμματισμού και πολλά άλλα. Οπότε η επιλογή είναι δική σας"
            ]
        ],
    ],


    "dance" => [
        "title" => "Χορός της Εβδομάδας Προγραμματισμού",
        "subtitle" => "Ποιος είπε ότι οι προγραμματιστές δεν χορεύουν; Για να γιορτάσουμε την Εβδομάδα Προγραμματισμού 2020, φτιάξαμε μια καινούρια δραστηριότητα - τη δοκιμασία #CodeWeekDance",
        "section1" => [
            "title" => "Ποιος μπορεί να συμμετάσχει;",
            "content" => [
                "Μπορούν να συμμετάσχουν οι πάντες: σχολεία, δάσκαλοι, βιβλιοθήκες μέχρι λέσχες προγραμματισμού, επιχειρήσεις και δημόσιες αρχές είναι ευπρόσδεκτοι στη γιορτή της Εβδομάδας Προγραμματισμού 2020. Πρέπει απλά να οργανώσουν μια δραστηριότητα #CodeWeekDance και να την προσθέσουν στον",
                "χάρτη της Εβδομάδας Προγραμματισμού",
            ]
        ],
        "section2" => [
            "title" => "Πώς μπορώ να συμμετάσχω;",
            "content" => "Επίλεξε ένα από τα πέντε είδη δραστηριοτήτων ή σκέψου ένα δικό σου. Ανεξάρτητα από τη δραστηριότητα που θα επιλέξεις, μην αμελήσεις να την προσθέσεις στον χάρτη μας"
        ],
        "activity1" => [
            "title" => "Προγραμμάτισε έναν φίλο ή τους γονείς σου - χωρίς υπολογιστή",
            "subtitle" => "Ο προγραμματισμός σου επιτρέπει να δίνεις εντολές σε μια ηλεκτρονική συσκευή. Από τεχνική όμως άποψη, δεν χρειάζεσαι υπολογιστή για να προγραμματίσεις. Βρες έναν συνεργάτη – μπορεί να είναι ένας συμμαθητής σου, μία φίλη, ο πατέρας σου ή μία δασκάλα, και δώσε τους εντολές για το πώς να εκτελέσουν τον #CodeWeekDance, τις οποίες θα πρέπει να ακολουθήσουν επακριβώς",
            "resources" => [
                "Οδηγίες του Code.org για να διοργανώσεις το χορευτικό πάρτι χωρίς υπολογιστή",
                "Ένα εκπαιδευτικό πρόγραμμα για το πώς να προγραμματίσεις το ανθρώπινο ρομπότ σου",

            ]
        ],

        "activity2" => [
            "title" => "Οπτικός προγραμματισμός",
            "subtitle" => "Προγραμματίστε τον χορό της Εβδομάδας Προγραμματισμού στο Scratch. Χρησιμοποίησε τους χαρακτήρες της Εβδομάδας Προγραμματισμού ή δημιούργησε δικούς σου στο Scratch και προγραμμάτισέ τους να εκτελέσουν τον #CodeWeekDance.",
            "resources" => [
                "Παράδειγμα ενός πρότζεκτ Scratch για τον #CodeWeekDance",
                "Οι χαρακτήρες της Εβδομάδας Προγραμματισμού",
                "Οδηγίες του Code.org για το πώς να δώσεις κίνηση σε έναν χαρακτήρα",
                "Οδηγίες του Code.org για να διοργανώσετε το χορευτικό σας πάρτι",
                " Μοιράσου μαζί μας το πρότζεκτ σου σε αυτό το Scratch Studio."
            ]
        ], "activity3" => [
            "title" => "Προγραμματισμός βάσει κειμένου",
            "subtitle" => "Δημιουργήστε το θέμα του #CodeWeekDance σε Python ή JavaScript, χρησιμοποιώντας πλατφόρμες μουσικής δημιουργίας βάσει προγραμματισμού, όπως η EarSketch ή η Sonic Pi",
            "resources" => [
                "Οδηγίες για το πώς να δημιουργήσετε μουσική στην πλατφόρμα EarSketch",
                "Οδηγίες για το πώς να δημιουργήσετε μουσική στην πλατφόρμα Sonic Pi",

            ]
        ],
        "activity4" => [
            "title" => ">Ρομποτική",
            "subtitle" => "Προγραμματίστε το ρομπότ σας να ακολουθήσει τις οδηγίες σας και να εκτελέσει τον χορό της Εβδομάδας Προγραμματισμού",
            "resources" => [
                "Οδηγίες για τον προγραμματισμό ρομπότ",
            ]
        ], "activity5" => [
            "title" => "Χορευτική δοκιμασία",
            "subtitle" => "Βιντεοσκοπήστε τον εαυτό σας, την ομάδα σας ή το ρομπότ σας να εκτελεί τον #CodeWeekDance, κοινοποιήστε το στο Instagram και δοκιμάστε την τύχη σας: μπορεί να γίνετε viral και να κερδίσετε ορισμένα δώρα της Εβδομάδας Προγραμματισμού! Ενδιαφέρεστε; Ακολουθήστε τα παρακάτω βήματα:",
            "resources" => [
                "Βιντεοσκοπήστε τον χορό χρησιμοποιώντας τις Stories του Instagram ",
                "Κάντε follow",
                "στο @CodeWeekEU στο Instagram",
                "Κάνετε μνεία του @CodeWeekEU στην ιστορία σας με τον χορό και χρησιμοποιήστε την ετικέτα #CodeWeekDance",
            ]
        ],
        "outro" => [
            "Οι νικητές θα αναδεικνύονται καθημερινά και θα ανακοινώνονται στο κανάλι μας στο Instagram μέσω των Stories, οπότε μην ξεχνάτε να ελέγχετε συχνά τις ειδοποιήσεις σας, μπορεί σήμερα να είστε τυχεροί",
            "Ο #CodeWeekDance βασίζεται στην",
            "ωδή στον προγραμματισμό",
            "που συνέθεσε ο Brendan Paolini, και στη χορογραφία της Bianca Maria Berardi (2015), που βασίζεται σε μια ιδέα του Alessandro Bogliolo, καθηγητή υπολογιστικών συστημάτων στο Πανεπιστήμιο του Ουρμπίνο"
        ],

    ],
    "treasure-hunt"=>[
        "title"=>"Κυνήγι θησαυρού της Εβδομάδας Προγραμματισμού",
        "subtitle"=>[
            "Στην Εβδομάδα Προγραμματισμού 2020 φέρνουμε κάτι καινούργιο: ένα παιχνίδι στο Telegram που είναι αρκετά απλό για αρχάριους, αλλά αρκετά δύσκολο για να συντηρήσει το ενδιαφέρον των πιο έμπειρων παικτών",
            "Το κυνήγι θησαυρού της Εβδομάδας Προγραμματισμού",
            "είναι ένα παιχνίδι. Ο καλύτερος τρόπος να το παίξετε είναι στον προσωπικό υπολογιστή σας έχοντας πρόχειρο ένα κινητό τηλέφωνο. Το παιχνίδι θα σας ζητήσει να περάσετε κάποιες προγραμματιστικές δοκιμασίες και θα σας ξεναγήσει στην ιστορία του προγραμματισμού, της επιστήμης και της τεχνολογίας υπολογιστών στην Ευρώπη"
        ],
        "section" => [
            "title" => "Για να ξεκινήσετε το παιχνίδι χρειάζεται",
            "content" => [
                "να κατεβάσετε την εφαρμογή Telegram. Είναι διαθέσιμη σε έκδοση για",
                "υπολογιστή",
                "Μπορείτε να παίξετε το παίχνιδι στον προσωπικό σας υπολογιστή ή λάπτοπ, ή στο τηλέφωνό σας. Σας προτείνουμε να το παίξετε στον υπολογιστή σας ώστε να λάβετε τις οδηγίες και να λύσετε τις δοκιμασίες προγραμματισμού στην εφαρμογή Telegram στο τηλέφωνό σας",
                "Για να παίξετε το παιχνίδι",
                "ανοίξτε την εφαρμογή",
                "και σαρώστε τον κωδικό QR που θα σας μεταφέρει στην εφαρμογή Telegram και θα σας δώσει το πρώτο σύνολο εντολών",
                "Για να κερδίσετε, πρέπει να λύσετε 10 δοκιμασίες προγραμματισμού και να βρείτε 10 περιοχές στον χάρτη της Ευρώπης που συνδέονται με την εμφάνιση του προγραμματισμού και της τεχνολογίας",
                "Αφού ολοκληρώσετε το παιχνίδι, κοινοποιήστε τη βαθμολογία σας στους φίλους σας χρησιμοποιώντας την ετικέτα #CodeWeek και προκαλέστε τους να παίξουν και να μάθουν κι αυτοί λίγα πράγματα για την ιστορία του προγραμματισμού. Ας δούμε ποιος θα έχει το καλύτερο σκορ",
                "Το κυνήγι θησαυρού της Εβδομάδας Προγραμματισμού είναι η εικονική έκδοση 2020 του αρχικού κυνηγιού θησαυρού της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, που αναπτύχθηκε αρχικά από τον Alessandro Bogliolo, καθηγητή υπολογιστικών συστημάτων στο Πανεπιστήμιο του Ουρμπίνο. Για να μάθετε περισσότερα για το πρωτότυπο παιχνίδι, επισκεφτείτε το",
                "ιστολόγιό μας"

            ]
        ],
    ],
    "kick-off"=>[
        "title"=>"Εναρκτήρια εκδήλωση: 8 Οκτωβρίου 2020",
        "content"=>[
            "Η εικονική εναρκτήρια εκδήλωση της Εβδομάδας Προγραμματισμού 2020 θα πραγματοποιηθεί στις 8 Οκτωβρίου στις 5 μ.μ. (ώρα Βερολίνου/Βρυξελλών/Παρισιού). Η εκδήλωση θα μεταδοθεί στο Facebook Live, στο Instagram TV και στο YouTube Live",
            "Στην εκδήλωση α συμμετάσχουν οι ακόλουθοι προσκεκλημμένοι",
            "ο Ευρωπαίος επίτροπος Εσωτερικής Αγοράς" ,
            "η Ευρωπαία Επίτροπος Καινοτομίας, Έρευνας, Πολιτισμού, Εκπαίδευσης και Νεολαίας",
            "ο δημιουργός του Scratch και καθηγητής έρευνας μάθησης στο MIT Media Lab",
            "συγγραφέας και εικονογράφος του Hello Ruby",
            "και",
            "η πρόεδρος της E-MMA, μιας γαλλικής μη κερδοσκοπικής οργάνωσης που προωθεί την ισόρροπη εκπροσώπηση των φύλων στον τομέα της τεχνολογίας",
            "Και αν αυτό δεν είναι αρκετό, η ομάδα της Εβδομάδας Προγραμματισμού θα παρουσιάζει στον ιστότοπο νέες λειτουργίες, νέο υλικό και νέες δοκιμασίες",
            "Ο καθηγητής υπολογιστικών συστημάτων στο Πανεπιστήμιο του Ουρμπίνο και συντονιστής των",
            "πρεσβευτών της Εβδομάδας Προγραμματισμού",
            "θα σας μιλήσει για το εικονικό κυνήγι θησαυρού της Εβδομάδας Προγραμματισμού",
            "Και ο/η xxx θα παρουσιάσει τη νέα δοκιμασία #CodeWeekDance",
            "Θα συνδεθούμε επίσης με σχολεία και μαθητές από όλη την Ευρώπη, που θα μοιραστούν μαζί μας τις προγραμματιστικές τους ιστορίες, και θα ανταλλάξουμε ιδέες με τις προσκλεκλημένες ομιλήτριες και τους προσκεκλημένους ομιλητές",
            "Θα έχετε επίσης την ευκαιρία να μοιραστείτε τις σκέψεις, τις ιδέες σας και να θέσετε ερωτήσεις. Το μόνο που χρειάζεται να κάνετε είναι να συντονιστείτε στη ζωντανή ροή",
            "ή",
            "στις 8 Οκτωβρίου 2020 από τις 17:00 έως τις 18.30 (ώρα Κεντρικής Ευρώπης) και να σχολιάστε ή να τουιτάρετε με την ετικέτα #CodeWeek",
        ]
    ],
    "get-involved"=>[
        "title"=>"Πώς να συμμετάσχετε",
        "subtitle"=>"Ανυπομονείτε να ξεκινήσετε να προγραμματίζετε; Αν θέλετε να γίνετε μέλος της κοινότητας της Ευρωπαϊκής Εβδομάδας Προγραμματισμού αλλά δεν ξέρετε από πού να ξεκινήσετε, ρίξτε μια ματιά σε αυτούς τους συνδέσμους που θα σας βοηθήσουν στο ξεκίνημα, για να προλάβετε την ετήσια γιορτή που πραγματοποιείται τον Οκτώβρη",
        "content"=>[
            "Ξεκινώντας με την Εβδομάδα Προγραμματισμού",
            "Πώς να προσθέσετε μια δραστηριότητα στην Εβδομάδα Προγραμματισμού",
            "Εκπαιδευτικά προγράμματα",
            "Ο μεγάλος ανοικτός κύκλος μαθημάτων στο διαδίκτυο Deep Dive",
            "Σειρά Coding@Home"
        ]] ];