<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'title' => 'Επεξεργασία της εκδήλωσής σου #codeEU',
    'required_fields' => 'Τα υποχρεωτικά πεδία σημειώνονται με αστερίσκο *. Μπορείς να προσθέσεις την καταχώριση της εκδήλωσης στη γλώσσα σου.',
    'description' => 'Περιγραφή',
    'audience' => 'Κοινό',
    'theme' => 'Θέμα',
    'location' => 'Τοποθεσία',
    'website' => 'Δικτυακός τόπος',
    'contact' => 'Επικοινωνία',
    'tags' => 'Ετικέτες',
    'image' => 'Εικόνα',
    'help' => 'Το μέγεθος μεγαλύτερων εικόνων θα αναπροσαρμοστεί σε 256 x 512 pixels. Το μέγιστο μέγεθος αρχείου για αποστολή είναι 256 x 1024.',
    'aspect' => 'Ποιον τομέα του προγραμματισμού θα καλύψει η εκδήλωσή σου;',
    'address' => 'Πληκτρολόγησε μια διεύθυνση ή κάνε κλικ στον παρακάτω χάρτη για να ορίσεις μια τοποθεσία.',
    'privacy_disclaimer' => [
        'header' => 'Τα στοιχεία επικοινωνίας σου',
        'text_1' => 'Αυτές οι πληροφορίες θα είναι ορατές μόνο στους ',
        'link_1' => 'Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'text_2'=> ' και στους διοργανωτές της Εβδομάδας Προγραμματισμού
        , που
       θα εξετάσουν την εκδήλωσή σου πριν εμφανιστεί στον χάρτη και μπορεί να επικοινωνήσουν μαζί σου, αν χρειαστεί να γίνουν αλλαγές
        ή
        για τη διαχείριση ερευνών για στατιστικούς λόγους μετά την εκδήλωση.',
        'contact_email' => 'Το email επικοινωνίας σου'
    ], 
    'edit' => 'Επεξεργασία εκδήλωσης'
];
