<?php

return [
    'educational_resources_text' => "Καλωσόρισες! Εδώ θα βρεις μια συλλογή από δωρεάν πόρους, σχεδιασμένους  για να υποστηρίξουν το μαθησιακό σου ταξίδι!",
    'share_your_resources_button' => "Μοιράσου τους δικούς σου πόρους",
    'share_your_resources_title' => "Έχεις δωρεάν και ανοιχτούς εκπαιδευτικούς πόρους;",
    'share_your_resources_text' => "Μοιράσου τους  με την κοινότητα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού! Υπέβαλε τους πόρους σου χρησιμοποιώντας την παρακάτω φόρμα και θα τους προβάλουμε σε αυτήν τη σελίδα για να βοηθήσουμε άλλους να μάθουν, να δημιουργήσουν και να αναπτυχθούν.",
    'share_your_feedback_button' => "Δώσε μας την ανατροφοδότηση σου",
    'share_your_feedback_text' => "Πες μας τη γνώμη σου! Μοιράσου τα σχόλιά σου σχετικά με τους υπάρχοντες πόρους - είτε έχεις προτάσεις για βελτίωση, είτε θέλεις να δώσεις ένα μπράβο ή να μοιραστείς μια καινούργια ιδέα, θα χαρούμε πολύ να σε ακούσουμε!",
    'educational_resources_cta_btn' => 'Κατευθυντήριες γραμμές για τη διαφορετικότητα και την ένταξη',
];
