<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'main_title'=>'Προσθήκη της εκδήλωσής σου #codeEU',
    'button'=>'Προσθήκη εκδήλωσης',
    'howto'=>'Πώς να διοργανώσεις τη δική σου εκδήλωση',
    'required'=>'Τα υποχρεωτικά πεδία σημειώνονται με αστερίσκο *. Μπορείς να προσθέσεις την καταχώριση της εκδήλωσης στη γλώσσα σου.',
    'audience_title'=>'Κοινό',
    'theme_title'=>'Θέμα',
    'scoreboard_by_country'=>'Πίνακας αποτελεσμάτων εκδηλώσεων ανά χώρα',
    'get_involved'=>'Δήλωσε συμμετοχή',
    'organize_or_support_events'=>'Διοργάνωσε ή στήριξε εκδηλώσεις στην πόλη σου',
    'or_contact_your'=>'ή επικοινώνησε με τους',
    'eu_code_week_ambassadors'=>'Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
    'show_events_for'=>'Εμφάνιση εκδηλώσεων για ',
    'who' => 'Σε ποιον απευθύνεται η εκδήλωση;',
    'tags' => 'Ετικέτες',
    'image' => 'Εικόνα',
    'start' => [
        'label' => 'Ημερομηνία έναρξης',
        'placeholder' => 'Πότε ξεκινά η δραστηριότητα;',
    ],
    'end' => [
        'label' => 'Ημερομηνία λήξης',
        'placeholder' => 'Πότε ολοκληρώνεται η δραστηριότητα;',
    ],
    'organizer' => [
        'label' => 'Όνομα οργανισμού',
        'placeholder' => 'Οργανισμός στον οποίο εργάζεσαι ή είσαι εθελοντής',
    ],
    'website' => [
        'label' => 'Δικτυακός τόπος διοργανωτή',
        'placeholder' => 'Έχεις δικτυακό τόπο με περισσότερες πληροφορίες;',
    ],
    'description' => [
        'label' => 'Περιγραφή',
        'placeholder' => 'Περίγραψε εν συντομία τη δραστηριότητα που προγραμματίζεις.',
    ],
    'contact' => [
        'label' => 'Email επικοινωνίας',
        'placeholder' => 'Αυτό το email θα χρησιμοποιηθεί για σημαντική αλληλογραφία στο πλαίσιο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'explanation' => 'Το email επικοινωνίας σου θα είναι ορατό μόνο στους Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και στους διοργανωτές της Εβδομάδας Προγραμματισμού που θα εξετάσουν την εκδήλωσή σου πριν εμφανιστεί στον χάρτη και μπορεί να επικοινωνήσουν μαζί σου, αν χρειαστεί να γίνουν αλλαγές, ή για τη διαχείριση ερευνών για στατιστικούς λόγους μετά την εκδήλωση.',
    ],
    'public' => [
        'label' => 'Δημόσιο email',
        'placeholder' => 'Θέλεις να εμφανίζεται ένα email επικοινωνίας;'

    ],
    'title' => [
        'label' => 'Τίτλος δραστηριότητας',
        'placeholder' => 'Ποιο είναι το όνομα της δραστηριότητας;',
    ],
    'address' => [
        'label' => 'Διεύθυνση',
        'placeholder' => 'Πού θα πραγματοποιηθεί η δραστηριότητα;',
    ],


    'organizertype' => [
        'label' => 'Είδος οργανισμού',
        'placeholder' => 'Επίλεξε το είδος του διοργανωτή',
        'school' => 'Σχολείο',
        'library' => 'Βιβλιοθήκη',
        'non profit' => 'Μη κερδοσκοπικός οργανισμός',
        'private business' => 'Ιδιωτική επιχείρηση',
        'other' => 'Άλλο',
    ],
    'audience' => [
        'Pre-school children' => 'Παιδιά προσχολικής ηλικίας',
        'Elementary school students' => 'Μαθητές δημοτικού σχολείου',
        'High school students' => 'Μαθητές λυκείου',
        'Graduate students' => 'Προπτυχιακοί φοιτητές',
        'Post graduate students' => 'Μεταπτυχιακοί φοιτητές',
        'Employed adults' => 'Εργαζόμενοι ενήλικες',
        'Unemployed adults' => 'Άνεργοι ενήλικες',
        'Other (see description)' => 'Άλλο (βλέπε περιγραφή)',
    ],
    'theme' => [
        'Basic programming concepts' => 'Βασικές γνώσεις προγραμματισμού',
        'Web development' => 'Ανάπτυξη ιστοσελίδας',
        'Mobile app development' => 'Ανάπτυξη εφαρμογής για κινητές συσκευές',
        'Software development' => 'Ανάπτυξη λογισμικού',
        'Data manipulation and visualisation' => 'Χειρισμός και απεικόνιση δεδομένων',
        'Robotics' => 'Ρομποτική',
        'Hardware' => 'Υλισμικό (hardware)',
        'Other' => 'Άλλο',
        'Unplugged activities' => 'Δραστηριότητες χωρίς σύνδεση στο διαδίκτυο',
        'Playful coding activities' => 'Δραστηριότητες προγραμματισμού υπό τη μορφή παιχνιδιού',
        'Art and creativity' => 'Τέχνη και δημιουργικότητα',
        'Visual/Block programming' => 'Προγραμματισμός οπτικού περιβάλλοντος/μπλοκ',
        'Game design' => 'Σχεδιασμός παιχνιδιών',
        'Internet of things and wearable computing' => 'Διαδίκτυο των πραγμάτων και φορέσιμη υπολογιστική δυνατότητα',
        '3D printing' => 'Εκτύπωση 3D',
        'Augmented reality' => 'Ενισχυμένη πραγματικότητα',
        'Artificial intelligence' => 'Τεχνητή νοημοσύνη',
        'Motivation and awareness raising' => 'Παροχή κινήτρων και ευαισθητοποίηση',
        'Promoting diversity' => 'Προώθηση της διαφορετικότητας'
    ],
    'codeweek_for_all_participation_code' => [
        'title' => 'ΚΩΔΙΚΟΣ CODE WEEK 4 ALL',
        'explanation' => 'Αν έχεις λάβει κωδικό Code Week 4 all από συνάδελφο από το σχολείο ή από φίλο κάνε επικόλληση εδώ, αλλιώς άφησέ το κενό. Διατίθενται περισσότερες πληροφορίες για τον κωδικό Code Week 4 All',
        'link' => 'εδώ',
    ],
    'thanks_page'=>[
        'title'=>'Ευχαριστούμε για την προσθήκη της εκδήλωσής σου!',
        'phrase1'=>'Ένας από τους τοπικούς πρέσβεις θα εξετάσει τώρα την εκδήλωσή σου',
        'phrase2'=>'και θα επιβεβαιώσει ότι όλα είναι εντάξει.',
        'phrase3'=>'Αν έχεις ερωτήσεις, επικοινώνησε με έναν από τους',
        'phrase4'=>'εθνικούς πρέσβεις',
        'phrase5'=>'ή απόστειλε',
        'phrase6'=>'email',
        'phrase7'=>'Μπορείς να κοινοποιείς τον κωδικό Codeweek for all σε άλλα άτομα:'
    ],
    'activity_type'=>[
        'Event'=>'Εκδήλωση',
        'Lesson'=>'Μάθημα',
        'Workshop'=>'Εργαστήριο',
        'Webinar'=>'Διαδικτυακό σεμινάριο',
        'Live Streaming Session'=>'Απευθείας μετάδοση εκδήλωσης',
        'Other'=>'Άλλο'
    ]

];
