<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'reports_by' => 'Εκδηλώσεις για τις οποίες εκκρεμεί η υποβολή αναφοράς από ',
    'no_reports' => 'Δεν υπάρχουν ακόμα εκδηλώσεις για τις οποίες πρέπει να υποβληθεί αναφορά.',
    'report' => 'Οι εκδηλώσεις που παρατίθενται παρακάτω έχουν ξεκινήσει ή έχουν ήδη ολοκληρωθεί. Συμπλήρωσε μερικά αριθμητικά στοιχεία για
    στατιστικούς σκοπούς για την εκδήλωση και ζήτησε το πιστοποιητικό συμμετοχής στην Εβδομάδα Προγραμματισμού. Εσύ
    θα λαμβάνεις ένα πιστοποιητικό ανά εκδήλωση.'
];
