<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'main_title' => 'Προσθήκη της εκδήλωσής σου #EUCodeWeek',
    'button' => 'Προσθήκη εκδήλωσης',
    'howto' => 'Πώς να διοργανώσεις τη δική σου εκδήλωση',
    'required' => 'Τα υποχρεωτικά πεδία σημειώνονται με αστερίσκο *. Μπορείς να προσθέσεις την καταχώριση της εκδήλωσης στη γλώσσα σου.',
    'audience_title' => 'ΚΟΙΝΟ',
    'theme_title' => 'ΘΕΜΑ',
    'scoreboard_by_country' => 'Πίνακας αποτελεσμάτων',
    'get_involved' => 'Δήλωσε συμμετοχή',
    'organize_or_support_events' => 'ΔΙΟΡΓΑΝΩΣΕ Ή ΣΤΗΡΙΞΕ ΕΚΔΗΛΩΣΕΙΣ ΣΤΗΝ ΠΟΛΗ ΣΟΥ',
    'or_contact_your' => 'ή επικοινώνησε με τους',
    'eu_code_week_ambassadors' => 'Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
    'show_events_for' => 'Εμφάνιση εκδηλώσεων για ',
    'who' => 'Σε ποιον απευθύνεται η εκδήλωση;',
    'tags' => 'Ετικέτες',
    'image' => 'Εικόνα',
    'start' => [
        'label' => 'Ημερομηνία έναρξης',
        'placeholder' => 'Πότε ξεκινά η δραστηριότητα;',
    ],
    'end' => [
        'label' => 'Ημερομηνία λήξης',
        'placeholder' => 'Πότε ολοκληρώνεται η δραστηριότητα;',
    ],
    'organizer' => [
        'label' => 'Όνομα οργανισμού',
        'placeholder' => 'Οργανισμός στον οποίο εργάζεσαι ή είσαι εθελοντής',
    ],
    'website' => [
        'label' => 'Δικτυακός τόπος διοργανωτή',
        'placeholder' => 'Έχεις δικτυακό τόπο με περισσότερες πληροφορίες;',
    ],
    'description' => [
        'label' => 'Περιγραφή',
        'placeholder' => 'Περίγραψε εν συντομία τη δραστηριότητα που προγραμματίζεις.',
    ],
    'contact' => [
        'label' => 'Email επικοινωνίας',
        'placeholder' => 'Αυτό το email θα χρησιμοποιηθεί για σημαντική αλληλογραφία στο πλαίσιο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
        'explanation' => 'Το email επικοινωνίας σου θα είναι ορατό μόνο στους Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και στους διοργανωτές της Εβδομάδας Προγραμματισμού που θα εξετάσουν την εκδήλωσή σου πριν εμφανιστεί στον χάρτη και μπορεί να επικοινωνήσουν μαζί σου, αν χρειαστεί να γίνουν αλλαγές, ή για τη διαχείριση ερευνών για στατιστικούς λόγους μετά την εκδήλωση.',
    ],
    'public' => [
        'label' => 'Δημόσιο email',
        'placeholder' => 'Θέλεις να εμφανίζεται ένα email επικοινωνίας;',

    ],
    'title' => [
        'label' => 'Τίτλος δραστηριότητας',
        'placeholder' => 'Ποιο είναι το όνομα της δραστηριότητας;',
    ],
    'address' => [
        'label' => 'Διεύθυνση',
        'placeholder' => 'Πού θα πραγματοποιηθεί η δραστηριότητα;',
    ],

    'organizertype' => [
        'label' => 'Είδος οργανισμού',
        'placeholder' => 'Επίλεξε το είδος του διοργανωτή',
        'school' => 'Σχολείο',
        'library' => 'Βιβλιοθήκη',
        'non profit' => 'Μη κερδοσκοπικός οργανισμός',
        'private business' => 'Ιδιωτική επιχείρηση',
        'other' => 'Άλλο',
    ],
    'audience' => [
        'Pre-school children' => 'ΠΑΙΔΙΑ ΠΡΟΣΧΟΛΙΚΗΣ ΗΛΙΚΙΑΣ',
        'Elementary school students' => 'ΜΑΘΗΤΕΣ ΔΗΜΟΤΙΚΟΥ ΣΧΟΛΕΙΟΥ',
        'High school students' => 'ΜΑΗΤΕΣ ΛΥΚΕΙΟΥ',
        'Graduate students' => 'ΠΡΟΠΤΥΧΙΑΚΟΙ ΦΟΙΤΗΤΕΣ',
        'Post graduate students' => 'ΜΕΤΑΠΤΥΧΙΑΚΟΙ ΦΟΙΤΗΤΕΣ',
        'Employed adults' => 'ΕΡΓΑΖΟΜΕΝΟΙ ΕΝΗΛΙΚΕΣ',
        'Unemployed adults' => 'ΑΝΕΡΓΟΙ ΕΝΗΛΙΚΕΣ',
        'Other (see description)' => 'ΑΛΛΟ (ΒΛΕΠΕ ΠΕΡΙΓΡΑΦΗ)',
        'Teachers' => 'Δάσκαλοι',
    ],
    'theme' => [
        'AI & Generative AI' => 'Τεχνητή Νοημοσύνη & Γενετική ΤΝ',
        'Robotics, Drones & Smart Devices' => 'Ρομποτική, Drones και Έξυπνες Συσκευές',
        'Web, App & Software Development' => 'Ανάπτυξη Ιστοσελίδων, Εφαρμογών και Λογισμικού',
        'Game Design' => 'Σχεδιασμός Παιχνιδιών',
        'Cybersecurity & Data' => 'Κυβερνοασφάλεια και Δεδομένα',
        'Visual/Block Programming' => 'Οπτικός/Μπλοκ Προγραμματισμός',
        'Art & Creative Coding' => 'Τέχνη και Δημιουργικός Προγραμματισμός',
        'Internet of Things & Wearables' => 'Διαδίκτυο των Πραγμάτων & Φορετές Συσκευές',
        'AR, VR & 3D Technologies' => 'Επαυξημένη Πραγματικότητα, Εικονική Πραγματικότητα και 3D Τεχνολογίες',
        'Digital Careers & Learning Pathways' => 'Ψηφιακές Σταδιοδρομίες και Εκπαιδευτικές Διαδρομές',
        'Digital Literacy & Soft Skills' => 'Ψηφιακός Αλφαβητισμός & Ήπιες Δεξιότητες',
        'Unplugged & Playful Activities' => 'Δραστηριότητες χωρίς Υπολογιστή & Μέσα από Παιχνίδι',
        'Promoting Diversity & Inclusion' => 'Προώθηση Διαφορετικότητας και Συμπερίληψης',
        'Awareness & Inspiration' => 'Ευαισθητοποίηση και Έμπνευση',
        'Other' => 'Άλλο',
    ],
    'codeweek_for_all_participation_code' => [
        'title' => 'ΚΩΔΙΚΟΣ CODE WEEK 4 ALL',
        'explanation' => 'Αν έχεις λάβει κωδικό Code Week 4 all από συνάδελφο από το σχολείο ή από φίλο κάνε επικόλληση εδώ, αλλιώς άφησέ το κενό. Διατίθενται περισσότερες πληροφορίες για τον κωδικό Code Week 4 All',
        'link' => 'εδώ',
    ],
    'thanks_page' => [
        'title' => 'Ευχαριστούμε για την προσθήκη της εκδήλωσής σου!',
        'phrase1' => 'Ένας από τους τοπικούς πρέσβεις θα εξετάσει τώρα την εκδήλωσή σου',
        'phrase2' => 'και θα επιβεβαιώσει ότι όλα είναι εντάξει.',
        'phrase3' => 'Αν έχεις ερωτήσεις, επικοινώνησε με έναν από τους',
        'phrase4' => 'εθνικούς πρέσβεις',
        'phrase5' => 'ή απόστειλε',
        'phrase6' => 'email',
        'phrase7' => 'Μπορείς να κοινοποιείς τον κωδικό Codeweek for all σε άλλα άτομα:',
    ],
    'activitytype' => [
        'label' => 'Είδος Δραστηριότητας',
        'placeholder' => '',
        'open-online' => 'Ανοιχτή διαδικτυακή δραστηριότητα',
        'invite-online' => 'Διαδικτυακή δραστηριότητα κατόπιν πρόσκλησης',
        'open-in-person' => 'Ανοιχτή δραστηριότητα με φυσική παρουσία',
        'invite-in-person' => 'Δραστηριότητα με φυσική παρουσία κατόπιν πρόσκλησης',

    ],
    'privacy' => 'Έχω διαβάσει και συμφωνώ με τους όρους της πολιτικλής απορρήτου που αναφέρονται σε αυτό το έγγραφο',
    'country' => 'Χώρα',
    'loading' => 'Φόρτωση...',
    'add_activity' => 'Προσθήκη δραστηριότητας',
    'edit_activity' => 'Επεξεργασία δραστηριότητας',
    'update_activity' => 'Ενημέρωση δραστηριότητας',
    'delete_activity' => 'Διαγραφή δραστηριότητας',
    'total_pending_events' => 'Σύνολο εκδηλώσεων σε αναμονή',
    'no_pending_events' => 'Δεν βρέθηκαν εκδηλώσεις σε αναμονή για',
    'all_countries' => 'Όλες οι χώρες',
    'current_status' => 'Τρέχουσα κατάσταση',
    'certificate_ready' => 'Το πιστοποιητικό σου για την Εβδομάδα Προγραμματισμού είναι έτοιμο. Μπορείς να το κατεβάσεις ή να το μοιραστείς απευθείας.',
    'view_your_certificate' => 'Δες το πιστοποιητικό σου εδώ',
    'submit_event_and_report' => 'Υπόβαλε μια αναφορά γι’ αυτή την εκδήλωση και ζήτησε το πιστοποιητικό σου για την Εβδομάδα Προγραμματισμού.',
    'report_and_claim' => 'Υπόβαλε αναφορά για εκδήλωση και ζήτησε πιστοποιητικό',

];
