<?php


return [

    'title' => 'Οδηγός',
    'organise_activity' => 'Διοργάνωσε τη δική σου δραστηριότητα με την #CodeWeek',
    'register_activity' => 'Κάνε εγγραφή της δραστηριότητάς σου εδώ',
    'what' => [
        'title' => 'Τι είναι η Ευρωπαϊκή Εβδομάδα Προγραμματισμού;',
        'content' => '<p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα βάσης που το διαχειρίζονται εθελοντές και το υποστηρίζει η Ευρωπαϊκή Επιτροπή. Οποιοσδήποτε (σχολεία, εκπαιδευτικοί, βιβλιοθήκες, όμιλοι-κοινότητες προγραμματισμού, επιχειρήσεις, δημόσιες αρχές) μπορεί να οργανώσει μια εκδήλωση στο πλαίσιο της #CodeWeek και να την προσθέσει στον χάρτη στον ιστότοπο <a href="/events">codeweek.eu</a>.</p>'
    ],
    'what_you_need_organise' => [
        'title' => 'Τι χρειάζεσαι για να διοργανώσεις μια δραστηριότητα;',
        'items' => [
            '1' => '<strong>Μια ομάδα ατόμων που θέλει να μάθει.</strong> Για παράδειγμα, τους φίλους σου, παιδιά, έφηβους, ενήλικες συναδέλφους, γονείς ή παππούδες. Και μην ξεχνάς: δύο άτομα αποτελούν μια ομάδα!',
            '2' => '<strong>Δασκάλους ή εκπαιδευτές</strong> που ήδη γνωρίζουν τη δραστηριότητα προγραμματισμού και πώς να διδάσκουν και να εμπνέουν άλλους. Ο αριθμός εξαρτάται από το είδος και το μέγεθος της εκδήλωσης.',
            '3' => '<strong>Έναν χώρο μάθησης.</strong> Τάξεις, βιβλιοθήκες, αίθουσες συνεδριάσεων και διάφοροι δημόσιοι χώροι αποτελούν ιδανικούς χώρους φιλοξενίας μιας εκδήλωσης.',
            '4' => '<strong>Υπολογιστές και σύνδεση στο διαδίκτυο.</strong> Ανάλογα με την ομάδα-στόχο μπορείς να ζητήσεις από τους συμμετέχοντες να φέρουν τους δικούς τους φορητούς υπολογιστές.',
            '5' => '<strong>Προγραμματισμός χωρίς σύνδεση στο διαδίκτυο.</strong> Στην πραγματικότητα δεν χρειάζεσαι υπολογιστές και σύνδεση στο διαδίκτυο για να μάθεις την υπολογιστική σκέψη. Για αρχή, ρίξε μια ματιά στα <a href="/training/coding-without-computers">εκπαιδευτικά προγράμματα χωρίς σύνδεση στο διαδίκτυο</a>.',
            '6' => '<strong>Εκπαιδευτικό υλικό.</strong> Δείξε στους συμμετέχοντες πόσο διασκεδαστικό μπορεί να είναι το να δημιουργούν κάτι μόνοι τους. Συμβουλέψου τη <a
                        href="/resources">σελίδα με τους εκπαιδευτικούς πόρους</a> μας και τα <a href="/training">εκπαιδευτικά προγράμματα</a> με εκπαιδευτικά βίντεο και πλάνα μαθημάτων, και προσάρμοσέ τα στις ανάγκες τις ομάδας σου.',
            '7' => '<strong>Εγγραφή συμμετεχόντων.</strong> Αν έχεις περιορισμένο διαθέσιμο χώρο, μπορείς να χρησιμοποιήσεις διαδικτυακά εργαλεία, όπως <a href="https://docs.google.com/forms/">φόρμες Google</a> και <a
                        href="https://www.eventbrite.com/">Eventbrite</a> για την εγγραφή των συμμετεχόντων.',
            '8' => 'Θυμήσου να <a href="/add">καρφιτσώσεις την εκδήλωσή σου</a> στον <a href="/events">χάρτη της Εβδομάδας Προγραμματισμού</a>!',
        ]
    ],
    'how_to' => [
        'title' => 'Πώς να διοργανώσεις τη δραστηριότητά σου;',
        'items' => [
            '1' => 'Εσύ αποφασίζεις ποια θα είναι η μορφή της εκδήλωσής σου για τον προγραμματισμό, αλλά εμείς σου προτείνουμε να προβλέψεις <strong>χρόνο για πρακτικές ασκήσεις</strong>, όπου οι συμμετέχοντες θα μπορούν να δημιουργήσουν μόνοι τους ή/και να πειραματιστούν με κάποιο υλισμικό.',
            '2' => 'Χρησιμοποίησε <strong>εργαλεία και τεχνολογίες</strong> κατάλληλες για την ομάδα-στόχο. Σου προτείνουμε να χρησιμοποιήσεις <a href="http://codeweek.eu/resources/">λογισμικά ανοιχτού κώδικα που διατίθενται δωρεάν</a>.',
            '3' => 'Ενθάρρυνε τους συμμετέχοντες να <strong>δείξουν και να παρουσιάσουν</strong> ο ένας στον άλλον ό,τι έχουν δημιουργήσει στο τέλος της εκδήλωσής σου.',
            '4' => '<strong>Διάδωσε τα νέα!</strong> Προώθησε και μοιράσου στα μέσα κοινωνικής δικτύωσης όσα έκανες κατά τη δραστηριότητά σου χρησιμοποιώντας το hashtag #CodeWeek. Μπορείς να το μοιραστείς και στην <a
                        href="https://www.facebook.com/groups/774720866253044/">Ομάδα Δασκάλων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> και στο Twitter (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Μίλησε στους φίλους σου, σε συναδέρφους εκπαιδευτικούς, στον τοπικό τύπο, και σύνταξε ένα δελτίο τύπου.',
            '5' => 'Μην ξεχάσεις να <a href="/add">προσθέσεις τη δραστηριότητά σου</a> στον <a href="/events">χάρτη της Εβδομάδας Προγραμματισμού</a>!',
        ]
    ],
    'material' => [
        'title' => 'Υλικό προώθησης',
        'text' => '<p>Συμβουλέψου το <a href="http://blog.codeweek.eu/">ιστολόγιό</a> μας για πρόσφατες πληροφορίες και προσάρμοσε τα πιο πρόσφατα δελτία τύπου στις ανάγκες σου ή δημιούργησε τα δικά σου:</p>',
        'items' => [
            '1' => '<a href="https://ec.europa.eu/digital-single-market/en/news/getting-ready-eu-code-week-2019-new-online-course-teachers-extended-repository-handy-materials">Getting ready for EU Code Week 2019: new online course for teachers, an extended repository of handy materials and a revamped website</a>',
            '2' => '<a href="https://ec.europa.eu/digital-single-market/en/news/gearing-celebrate-eu-code-week-2019">Ετοιμαστείτε να γιορτάσουμε την Ευρωπαϊκή Εβδομάδα Προγραμματισμού του 2019</a> (διατίθεται σε 29 γλώσσες)'
        ]
    ],
    'toolkits' => [
        'title' => 'Κάνε λήψη των παρακάτω εργαλειοθηκών που θα σε βοηθήσουν να ξεκινήσεις:',
        'communication_toolkit' => 'Εργαλειοθήκη επικοινωνίας',
        'teachers_toolkit' => 'Εργαλειοθήκη δασκάλων'
    ],
    'questions' => [
        'title' => 'Απορίες;',
        'content' => '<p>Αν έχεις απορίες για τη διοργάνωση και την προώθηση της εκδήλωσής σου στο πλαίσιο της #CodeWeek, επικοινώνησε με έναν από τους <a href="/ambassadors">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> της χώρας σου.</p>'
    ]

];
