<?php

return [

    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Δώσε πνοή στις ιδέες σου!',
    'sections' => [
        1 => [
            'title' => '6 μαραθώνιοι ανάπτυξης εφαρμογών, 6 προκλήσεις',
            'content' => [
                1 => 'Ζεις στη Λετονία, την Ιρλανδία, την Ιταλία, τη Ρουμανία, τη Σλοβενία ή την Ισπανία; Είναι η ευκαιρία σου να χρησιμοποιήσεις τη δημιουργικότητά, την περιέργεια, τον δυναμισμό και τις τεχνολογικές δεξιότητές σου. Πάρε μέρος σε έναν από τους μαραθώνιους ανάπτυξης εφαρμογών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και ανάπτυξε μια καινοτόμο λύση που θα βοηθήσει την κοινωνία.',
                2 => 'Το 2020, η Ευρωπαϊκή Εβδομάδα Προγραμματισμού διοργανώνει έξι ξεχωριστούς μαραθώνιους ανάπτυξης εφαρμογών σε έξι ευρωπαϊκές χώρες και καλεί τους μαθητές της ανώτερης δευτεροβάθμιας εκπαίδευσης (ηλικίας 16-19 ετών) να χρησιμοποιήσουν τις ικανότητές τους στον προγραμματισμό για να βρουν λύσεις σε ένα πρόβλημα που αντιμετωπίζουν στην περιοχή τους, μέσα σε 2 μέρες.'
            ]
        ],
        2 => [
            'title' => 'Πώς μπορώ να συμμετάσχω;',
            'content' => [
                1 => 'Επίλεξε τον μαραθώνιο ανάπτυξης εφαρμογών στη χώρα σου και ακολούθησε μερικά απλά βήματα για εγγραφή. Εάν θέλεις να συμμετέχεις με φίλους ή συμμαθητές, μην ξεχάσεις να αναφέρεις το όνομα της ομάδας σου. Οι εγγραφές θα ξεκινήσουν ξεχωριστά για κάθε μαραθώνιο ανάπτυξης εφαρμογών.'
            ]
        ],
        3 => [
            'title' => 'Ποιοι είναι οι οργανωτές;',
            'content' => [
                1 => 'Οι Μαραθώνιοι Ανάπτυξης Εφαρμογών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού διοργανώνονται από κοινού από την Ευρωπαϊκή Επιτροπή και τοπικούς ',
                2 => 'Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
                3 => ' και χρηματοδοτούνται από το Ευρωπαϊκό Κοινοβούλιο. Στόχος είναι να παρουσιάσουν πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των καινοτόμων ιδεών και των δεξιοτήτων προγραμματισμού των νέων.'
            ]
        ],
        4 => [
            'title' => 'Πώς είναι ένας μαραθώνιος ανάπτυξης εφαρμογών;',
            'content' => [
                1 => 'Σε κάθε μαραθώνιο ανάπτυξης εφαρμογών θα μετέχουν 60 μαθητές δευτεροβάθμιας εκπαίδευσης που θα διαγωνίζονται σε ομάδες για 2 μέρες. Στο τέλος, κάθε ομάδα θα παρουσιάσει τη λύση της σε μια κριτική επιτροπή εμπειρογνωμόνων. Έμπειροι μέντορες θα προετοιμάζουν τις ομάδες και θα υπάρχουν εργαστήρια που θα παρέχουν ευκαιρίες στους συμμετέχοντες να μάθουν νέες δεξιότητες και να διασκεδάσουν. Οι μαραθώνιοι ανάπτυξης εφαρμογών είναι επίσης μια εξαιρετική ευκαιρία για τους συμμετέχοντες να δικτυωθούν και να κοινωνικοποιηθούν με άτομα στον τεχνολογικό τομέα της περιοχής τους.',
                2 => 'Η νικήτρια ομάδα σε κάθε τοπικό μαραθώνιο ανάπτυξης εφαρμογών θα λάβει διάφορα βραβεία, μεταξύ άλλων θα έχει την ευκαιρία να μεταβεί στις Βρυξέλλες και να παρουσιάσει τη λύση της σε διεθνές ακροατήριο στις 12 Οκτωβρίου 2020.',
            ]
        ],
        5 => [
            'title' => 'Δεν ξέρω προγραμματισμό - τι μπορώ να κάνω;',
            'content' => [
                1 => 'Παράλληλα με τον μαραθώνιο ανάπτυξης εφαρμογών, θα πραγματοποιηθούν εργαστήρια για αρχάριους στον προγραμματισμό, τη χρήση υλισμικού, τη ρομποτική κ.λπ. ώστε οι συμμετέχοντες να αποκτήσουν κάποιες βασικές γνώσεις για την υπολογιστική σκέψη και τον προγραμματισμό. Μάθετε περισσότερες πληροφορίες σχετικά με τον τρόπο εγγραφής στην τοπική σας σελίδα.'
            ]
        ],

        6 => [
            'title' => 'Εταίροι',
        ],

    ],

    'cities' => [

        1 => [
            'city' => "",
            'country' => "Ιρλανδία",
            'date' => "Απρίλιος 2020"
        ],
        2 => [
            'city' => "",
            'country' => "Σλοβενία",
            'date' => "Μάιος 2020"
        ],
        3 => [
            'city' => "",
            'country' => "Ρουμανία",
            'date' => "Μάιος 2020"
        ],
        4 => [
            'city' => "",
            'country' => "Ισπανία",
            'date' => "Ιούνιος 2020"
        ],
        5 => [
            'city' => "",
            'country' => "Λετονία",
            'date' => "Σεπτέμβριος 2020"
        ],
        6 => [
            'city' => "",
            'country' => "Ιταλία",
            'date' => "Σεπτέμβριος 2020"
        ],
    ],


];
