<?php

return [

    "title" => "EU Code Week HACKATΗON",
    "subtitle" => "Κάνε τις ιδέες σου πραγματικότητα!",
    "misc" => [
        "Διάβασε τους κανόνες και τον κώδικα συμπεριφοράς",
        "Η υπηρεσία EU Survey θα χειριστεί τις εγγραφές για το EU Code Week Hackathon και τις παράλληλες εκδηλώσεις.",
        "Οι συνεργάτες μας"
    ],
    "sections" => [
        1 => [
            "content" => [
                "Ονειρεύεσαι να δημιουργήσεις την επόμενη σπουδαία εφαρμογή; Γνωρίζεις πώς οι καινοτόμες τεχνολογικές λύσεις μπορούν να βοηθήσουν το σχολείο, την πόλη και την περιοχή σου; Αν θέλεις να γίνεις επιχειρηματίας ή έχεις μια καταπληκτική ιδέα να παρουσιάσεις στον κόσμο αλλά δεν ξέρεις από πού να ξεκινήσεις, τότε δεν χρειάζεται να περιμένεις άλλο! ",
                "Το EU Code Week Hackathon",
                "ξεκινά με μια πρόκληση για την ανάπτυξη ενός κώδικα που θα επιλύει μια πραγματική πρόκληση σε μόλις 24 ώρες. Στη συνέχεια, οι 10 πιο επιτυχημένες ομάδες θα λάβουν εκπαίδευση και καθοδήγηση από ειδικούς στον τομέα αυτόν, έτσι ώστε να προετοιμαστούν για τον δεύτερο και τελικό γύρο, στον οποίο θα επιλεγεί ο τελικός νικητής.  Η τυχερή ομάδα θα κερδίσει περαιτέρω εκπαίδευση και καθοδήγηση για τις ιδέες της και εκπληκτικό εξοπλισμό πληροφορικής. Η νικητήρια ομάδα θα εξασφαλίσει επίσης μια θέση στον ευρωπαϊκό διαγωνισμό, όπου όλοι οι νικητές των μαραθωνίων χάκινγκ θα παρουσιάσουν τις ιδέες τους σε μια ευρωπαϊκή κριτική επιτροπή κατά τη διάρκεια του EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού), από τις 9 έως τις 24 Οκτωβρίου 2021.",
                "Ο μαραθώνιος χάκινγκ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι βέβαιο ότι θα εξάψει την περιέργειά σου, θα εμπνεύσει τη δημιουργικότητά σου, θα ενθαρρύνει το επιχειρηματικό πνεύμα σου και θα κάνει τις ιδέες σου πραγματικότητα. "
            ]
        ],
        2 => [
            "title" => "Τι μπορώ να περιμένω;",
            "content" => [
                "Εξειδικευμένη εκπαίδευση",
                "Εργαστήρια ανάπτυξης δεξιοτήτων",
                "Διασκεδαστικές δραστηριότητες",
                "Την ευκαιρία να συναντήσεις ανθρώπους που έχουν τις ίδιες αντιλήψεις μ' εσένα",
                "Την ευκαιρία να κερδίσεις καθοδήγηση και εκπαίδευση, καθώς και εξοπλισμό πληροφορικής",
                "Την ευκαιρία να συμμετάσχεις στον τελικό μαραθώνιο χάκινγκ και να γνωρίσεις αυτοπροσώπως τους καλύτερους όλων!"
            ]
        ],
        3 => [
            "content" => [
                "Εγγράψου τώρα στο",
                "EU Code Week Hackathon Greece",
                "και κάνε τις ιδέες σου πραγματικότητα!"
            ]
        ],
        4 => [
            "title" => "Πρότεινε προκλήσεις που θα αντιμετωπιστούν στον μαραθώνιο χάκινγκ",
            "content" => [
                "Θέλεις να κάνεις την κοινότητά σου το επίκεντρο της πράσινης και βιώσιμης καινοτομίας στην Ελλάδα; Αν ναι, πρότεινε μια πρόκληση που θα αντιμετωπιστεί στον μαραθώνιο χάκινγκ. Κάτι συγκεκριμένο που θα βοηθήσει εσένα, το σχολείο, την πόλη ή την κοινότητά σου.",
                "Πρότεινε μια πρόκληση",
                "Η ψηφοφορία για την ελληνική πρόκληση θα ξεκινήσει στις 9 Απριλίου."
            ]
        ],
        5 => [
            "title" => 'Ψήφισε τις προκλήσεις για "χάκινγκ"',
            "content" => [
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, της καινοτομίας και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Η λέξη «συγκεκριμένες» σημαίνει ότι επιλύονται πραγματικά προβλήματα – πράγματα που επηρεάζουν εσένα, το σχολείο, την κοινότητα, την πόλη σου ή συγκεκριμένες προκλήσεις στην περιοχή σου.",
                "Ψήφισε τι είναι σημαντικότερο για σένα!",
                "Η τελική πρόκληση που θα επιλεγεί θα ανακοινωθεί στην αρχή του μαραθωνίου χάκινγκ."
            ]
        ],
        6 => [
            "title" => "Η πρόκληση",
            "content" => [
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των πρωτότυπων ιδεών και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Η λέξη «συγκεκριμένες» σημαίνει ότι επιλύονται πραγματικά προβλήματα – πράγματα που επηρεάζουν εσένα, το σχολείο, την κοινότητα, την πόλη σου ή συγκεκριμένες προκλήσεις στην περιοχή σου.",
                "Με βάση τη δημόσια ψηφοφορία, η πρόκληση για τον ελληνικό μαραθώνιο χάκινγκ είναι:",
                "Με βάση τη δημόσια ψηφοφορία, η πρόκληση για τον ελληνικό μαραθώνιο χάκινγκ ήταν:"
            ]
        ],
        7 => [
            "title" => "Κέντρο πόρων",
        ],
        8 => [
            "title" => "Πρόγραμμα",
            "content" => [
                "Ο μαραθώνιος χάκινγκ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού περιλαμβάνει τρεις ξεχωριστούς γύρους.",
                "24ωρος διαδικτυακός μαραθώνιος χάκινγκ. Από το σύνολο των συμμετεχόντων θα επιλεγούν έως 10 ομάδες για να συνεχίσουν στον διαγωνισμό.",
                "Δωρεάν διαδικτυακή εκπαίδευση και καθοδήγηση και για τις 10 ομάδες το καλοκαίρι του 2021.",
                "Τελικός γύρος: ο φυσικός μαραθώνιος χάκινγκ. 10 ομάδες θα λάβουν ισότιμη εκπαίδευση στον δεύτερο γύρο, αλλά μόνο μία θα νικήσει.  Μαθητές της δευτεροβάθμιας εκπαίδευσης, ηλικίας 15-19 ετών, θα διαγωνιστούν σε ομάδες για να επιλύσουν μια «τοπική πρόκληση», η οποία θα επιλεγεί από προτάσεις που θα υποβληθούν πριν από τον πρώτο γύρο.",
                "Το 2021, το EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού) φέρνει έξι εξαιρετικούς μαραθώνιους χάκινγκ και προσκαλεί μαθητές λυκείου, 15-19 ετών, να σχηματίσουν ομάδες και να χρησιμοποιήσουν τις δεξιότητές τους στην κωδικοποίηση για να λύσουν μια τοπική πρόκληση. Μετά από 24 ώρες χάκινγκ, κάθε ομάδα θα παρουσιάσει τις ιδέες της σε μια επιτροπή εμπειρογνωμόνων που θα επιλέξει τις 10 ομάδες του τελικού.  Όλες οι ομάδες θα έχουν στη διάθεσή τους ίδιο χρόνο, ίδιους πόρους και ίδια πρόσβαση σε μέντορες και τεχνογνωσία για να ολοκληρώσουν την πρόκληση, αλλά μόνο 10 θα έχουν την ευκαιρία να συνεχίσουν στον επόμενο γύρο, να αναπτύξουν το πρωτότυπό τους, να λάβουν εξειδικευμένη εκπαίδευση και να συμμετάσχουν στον τελικό μαραθώνιο χάκινγκ το φθινόπωρο. Στον τελικό, οι ομάδες θα διαγωνιστούν για να αποφασιστεί ποια θα κερδίσει αξεσουάρ πληροφορικής και την ευκαιρία να λάβει καθοδήγηση και εκπαίδευση για να αναπτύξει περαιτέρω το πρωτότυπό της.",
                "Η ομάδα σου δεν εξασφαλίζει μια θέση στον δεύτερο γύρο ακόμα και αν επιλύσει με επιτυχία την πρόκληση. Να θυμάσαι ότι διαγωνίζεστε με τις άλλες ομάδες και η κριτική επιτροπή θα λάβει υπόψη τη μέθοδό σας, τη χρήση του χρόνου και την ποιότητα του πρωτοτύπου για να επιλέξει τους επιτυχόντες υποψηφίους! ",
                "Αν η ομάδα σου είναι μεταξύ των 10 φιναλίστ, μπορείτε να επεξεργαστείτε την ιδέα σας κατά τη διάρκεια του καλοκαιριού. Για να σας βοηθήσουμε, θα σας προσφέρουμε δωρεάν εκπαίδευση σε θέματα ανάπτυξης και σχεδιασμού UX. Η ομάδα σου μπορεί επίσης να λάβει τη βοήθεια ενός μέντορα, ο οποίος θα διασφαλίσει ότι βρίσκεστε στον σωστό δρόμο.",
                "Οι 10 φιναλίστ θα συναντηθούν πρόσωπο με πρόσωπο σε έναν 12ωρο μαραθώνιο χάκινγκ στις Χ (ο οποίος θα πραγματοποιηθεί διαδικτυακά, εάν η κατάσταση της δημόσιας υγείας δεν επιτρέπει τη φυσική συνάντηση). Κατά τη διάρκειά του, οι ομάδες θα διαγωνιστούν για να αναδειχθούν ως οι καλύτεροι νέοι χάκερ της χώρας και θα έχουν την ευκαιρία να κερδίσουν έπαθλα, όπως εκπληκτικό εξοπλισμό πληροφορικής, καθώς και περαιτέρω εκπαίδευση και καθοδήγηση για τις ιδέες τους.",
                "Κάθε εθνικός νικητής θα πάρει μέρος σε μια ευρωπαϊκή τιτανομαχία, στην οποία κάθε νικητήρια ομάδα θα παρουσιάσει τη λύση της σε μια ευρωπαϊκή κριτική επιτροπή κατά τη διάρκεια του επίσημου EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού) που θα πραγματοποιηθεί από τις 9 έως τις 24 Οκτωβρίου 2021. Ο πρωταθλητής Ευρώπης θα κερδίσει, πέρα από τη δόξα, πρόσθετο εξοπλισμό πληροφορικής.",
                "Ημέρα 1",
                "Ημέρα 2",
            ]
        ],
        9 => [
            "title" => "Πρακτικές πληροφορίες",
            "content" => [
                "Ο μαραθώνιος χάκινγκ θα πραγματοποιηθεί στις διαδικτυακά από τις 7 Μαΐου έως τις 8 Μαΐου 2021",
                "Η συμμετοχή στον μαραθώνιο χάκινγκ είναι δωρεάν."

            ]
        ],
        10 => [
            "title" => "Κριτική επιτροπή και μέντορες",
            "content" => [
                "Φαντάσου ότι είσαι σε μια εικονική αίθουσα γεμάτη σχεδιαστές, δημιουργούς, προγραμματιστές και μέντορες σε θέματα επιχειρήσεων, όλοι με την ίδια περιέργεια και την ίδια ώθηση μ' εσένα. Το EU Code Week Hackathon Greece φέρνει κοντά κορυφαίες προσωπικότητες από τον κόσμο των επιχειρήσεων, του τομέα πληροφορικής, του επιχειρηματικού κεφαλαίου, της εκπαίδευσης, καθώς και πρόσωπα που κατέχουν ηγετική θέση σε τοπικό, εθνικό και ενωσιακό επίπεδο, influencer και εκπαιδευτές για να καθοδηγήσουν και να υποστηρίξουν εσένα και την ομάδα σου κατά τη διάρκεια αυτού του εντατικού μαραθωνίου.",
                "Εγγράψου τώρα στο",
                "EU Code Week Hackathon",
                "και κάνε το όνειρό σου πραγματικότητα!",
            ]
        ],

        11 => [
            "title" => "Παράλληλες εκδηλώσεις",
            "content" => [
                "Σε ενδιαφέρουν αυτά τα θέματα αλλά δεν γνωρίζεις προγραμματισμό; Εγγράψου στις παράλληλες εκδηλώσεις μας και ανακάλυψε τον ενθουσιασμό που προσφέρει ο προγραμματισμός, η καινοτομία, η επιχειρηματικότητα και άλλες δεξιότητες που είναι ζωτικής σημασίας για τη συμμετοχή στον ψηφιακό κόσμο. Οι παράλληλες εκδηλώσεις του Code Week Hackathon έχουν προγραμματιστεί να πραγματοποιηθούν από τον Μάιο έως τον Οκτώβριο και θα περιλαμβάνουν διάφορα είδη εργαστηρίων. Η συμμετοχή είναι δωρεάν, πρέπει απλώς να εγγραφείς εδώ. Έλα και μάθε περισσότερα.",
            ]
        ],
        12 => [
            "title" => "Πληροφορίες για το CODEWEEK.EU",
            "content" => [
                "Το EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού, #CodeWeek) είναι ένα κίνημα βάσης που διαχειρίζονται εθελοντές για την προώθηση του ψηφιακού γραμματισμού μέσω δραστηριοτήτων που σχετίζονται με τον προγραμματισμό και την πληροφορική. Δίνει έμπνευση και παρακινεί τους ανθρώπους να αναζητήσουν νέες ιδέες και καινοτομία για το μέλλον. Οι δραστηριότητες για την",
                "EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού)",
                "πραγματοποιούνται σε όλον τον κόσμο από τις 9 έως τις 24 Οκτωβρίου. ",
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των πρωτότυπων ιδεών και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Οι μαραθώνιοι χάκινγκ δημιουργούνται και συνδιοργανώνονται από",
                "την Ευρωπαϊκή Επιτροπή",
                "και τους τοπικούς",
                "πρεσβευτές της Ευρωπαϊκής Εβδομάδας Προγραμματισμού",
                "Η πρωτοβουλία χρηματοδοτείται από",
                "το Ευρωπαϊκό Κοινοβούλιο",
                "Ανακάλυψε περισσότερα",
            ]
        ],

        "after" => [
            "Επόμενα βήματα",
            "Οι ομάδες που επιλέχθηκαν επεξεργάζονται τώρα το πρωτότυπό τους και θα συναντηθούν στον τελικό μαραθώνιο χάκινγκ στις Χ για να διαγωνιστούν και να αποφασιστεί ο νικητής του ελληνικού μαραθωνίου χάκινγκ. Παρακολούθησε εδώ και στα μέσα κοινωνικής δικτύωσης τις ενημερώσεις από τις ομάδες των διαγωνιζόμενων! ",
            "Το EU Code Week Hackathon Greece προσφέρει σε έξυπνους, παθιασμένους νέους την ευκαιρία να χρησιμοποιήσουν τις δεξιότητές τους στην κωδικοποίηση και τις δημιουργικές ιδέες τους για να επιλύσουν μια συγκεκριμένη τοπική πρόκληση. Μετά από έναν αρχικό 24ωρο εικονικό μαραθώνιο χάκινγκ, έως 10 ομάδες συνεχίζουν στο επόμενο στάδιο. Οι φιναλίστ επεξεργάστηκαν τα πρωτότυπά τους με κάποια καθοδήγηση από τους μέντορες κατά τη διάρκεια του καλοκαιριού και είναι πλέον έτοιμοι να διαγωνιστούν! Το ταξίδι του μαραθώνιου χάκινγκ της Εβδομάδας Προγραμματισμού ολοκληρώθηκε με μια μάχη δεξιοτήτων, γνώσεων και δημιουργικότητας στον τελικό μαραθώνιο χάκινγκ στις Χ Σεπτεμβρίου στην πόλη [πόλη].",
            "Οι νικητές",
            "Δες όλους τους νικητές",
            "Συλλογή",
            "Δες τους «νέους χάκερ» από την Ελλάδα σε δράση κατά τη διάρκεια του EU Code Week Hackathon",
            "Τοίχος υποστήριξης",
            "Ευχαριστούμε τα tweet, τις ειδικές αναφορές και όλη την υποστήριξη κατά τη διάρκεια του μαραθωνίου χάκινγκ! Δες ορισμένες από τις σημαντικότερες στιγμές!",
            "Κριτική επιτροπή και μέντορες",
            "Το EU Code Week Hackathon στην Ελλάδα έφερε κοντά κορυφαία πρόσωπα από τον κόσμο των επιχειρήσεων, του τομέα πληροφορικής, του επιχειρηματικού κεφαλαίου, της εκπαίδευσης, καθώς και πρόσωπα που κατέχουν ηγετική θέση σε τοπικό, εθνικό και ενωσιακό επίπεδο, influencer και εκπαιδευτές για να καθοδηγήσουν και να υποστηρίξουν τους συμμετέχοντες κατά τη διάρκεια του εντατικού μαραθωνίου χάκινγκ. Επιλεγμένα μέλη της κριτικής επιτροπής ορίστηκαν για να καθορίσουν την τελική νικητήρια ομάδα, σύμφωνα με τις σχετικές κατευθυντήριες γραμμές και τους κανόνες του διαγωνισμού.",
            "Διάβασε τις κατευθυντήριες γραμμές"
        ]


    ],


];
