<?php

return [

    "title" => "EU Code Week HACKATΗON",
    "subtitle" => "Κάνε τις ιδέες σου πραγματικότητα!",
    "misc" => [
        "Διάβασε τους κανόνες και τον κώδικα συμπεριφοράς",
        "Η υπηρεσία EU Survey θα χειριστεί τις εγγραφές για το EU Code Week Hackathon και τις παράλληλες εκδηλώσεις.",
        "Οι συνεργάτες μας"
    ],
    "sections" => [
        1 => [
            "content" => [
                "Ονειρεύεσαι να δημιουργήσεις την επόμενη σπουδαία εφαρμογή; Γνωρίζεις πώς οι καινοτόμες τεχνολογικές λύσεις μπορούν να βοηθήσουν το σχολείο, την πόλη και την περιοχή σου; Αν θέλεις να γίνεις επιχειρηματίας ή έχεις μια καταπληκτική ιδέα να παρουσιάσεις στον κόσμο αλλά δεν ξέρεις από πού να ξεκινήσεις, τότε δεν χρειάζεται να περιμένεις άλλο! ",
                "Το EU Code Week Hackathon",
                "ξεκινά με μια πρόκληση για την ανάπτυξη ενός κώδικα που θα επιλύει μια πραγματική πρόκληση σε μόλις 24 ώρες. Στη συνέχεια, οι 10 πιο επιτυχημένες ομάδες θα λάβουν εκπαίδευση και καθοδήγηση από ειδικούς στον τομέα αυτόν, έτσι ώστε να προετοιμαστούν για τον δεύτερο και τελικό γύρο, στον οποίο θα επιλεγεί ο τελικός νικητής.  Η τυχερή ομάδα θα κερδίσει περαιτέρω εκπαίδευση και καθοδήγηση για τις ιδέες της και εκπληκτικό εξοπλισμό πληροφορικής. Η νικητήρια ομάδα θα εξασφαλίσει επίσης μια θέση στον ευρωπαϊκό διαγωνισμό, όπου όλοι οι νικητές των μαραθωνίων χάκινγκ θα παρουσιάσουν τις ιδέες τους σε μια ευρωπαϊκή κριτική επιτροπή κατά τη διάρκεια του EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού), από τις 9 έως τις 24 Οκτωβρίου 2021.",
                "Ο μαραθώνιος χάκινγκ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι βέβαιο ότι θα εξάψει την περιέργειά σου, θα εμπνεύσει τη δημιουργικότητά σου, θα ενθαρρύνει το επιχειρηματικό πνεύμα σου και θα κάνει τις ιδέες σου πραγματικότητα. "
            ]
        ],
        2 => [
            "title" => "Τι μπορώ να περιμένω;",
            "content" => [
                "Εξειδικευμένη εκπαίδευση",
                "Εργαστήρια ανάπτυξης δεξιοτήτων",
                "Διασκεδαστικές δραστηριότητες",
                "Την ευκαιρία να συναντήσεις ανθρώπους που έχουν τις ίδιες αντιλήψεις μ' εσένα",
                "Την ευκαιρία να κερδίσεις καθοδήγηση και εκπαίδευση, καθώς και εξοπλισμό πληροφορικής",
                "Την ευκαιρία να συμμετάσχεις στον τελικό μαραθώνιο χάκινγκ και να γνωρίσεις αυτοπροσώπως τους καλύτερους όλων!"
            ]
        ],
        3 => [
            "content" => [
                "Εγγράψου τώρα στο",
                "EU Code Week Hackathon Greece",
                "και κάνε τις ιδέες σου πραγματικότητα!"
            ]
        ],
        4 => [
            "title" => "Πρότεινε προκλήσεις που θα αντιμετωπιστούν στον μαραθώνιο χάκινγκ",
            "content" => [
                "Θέλεις να κάνεις την κοινότητά σου το επίκεντρο της πράσινης και βιώσιμης καινοτομίας στην Ελλάδα; Αν ναι, πρότεινε μια πρόκληση που θα αντιμετωπιστεί στον μαραθώνιο χάκινγκ. Κάτι συγκεκριμένο που θα βοηθήσει εσένα, το σχολείο, την πόλη ή την κοινότητά σου.",
                "Πρότεινε μια πρόκληση",
                "Η ψηφοφορία για την ελληνική πρόκληση θα ξεκινήσει στις 9 Απριλίου."
            ]
        ],
        5 => [
            "title" => 'Ψήφισε τις προκλήσεις για "χάκινγκ"',
            "content" => [
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, της καινοτομίας και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Η λέξη «συγκεκριμένες» σημαίνει ότι επιλύονται πραγματικά προβλήματα – πράγματα που επηρεάζουν εσένα, το σχολείο, την κοινότητα, την πόλη σου ή συγκεκριμένες προκλήσεις στην περιοχή σου.",
                "Ψήφισε τι είναι σημαντικότερο για σένα!",
                "Η τελική πρόκληση που θα επιλεγεί θα ανακοινωθεί στην αρχή του μαραθωνίου χάκινγκ."
            ]
        ],
        6 => [
            "title" => "Η πρόκληση",
            "content" => [
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των πρωτότυπων ιδεών και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Η λέξη «συγκεκριμένες» σημαίνει ότι επιλύονται πραγματικά προβλήματα – πράγματα που επηρεάζουν εσένα, το σχολείο, την κοινότητα, την πόλη σου ή συγκεκριμένες προκλήσεις στην περιοχή σου.",
                "Με βάση τη δημόσια ψηφοφορία, η πρόκληση για τον ελληνικό μαραθώνιο χάκινγκ είναι:",
                "Με βάση τη δημόσια ψηφοφορία, η πρόκληση για τον ελληνικό μαραθώνιο χάκινγκ ήταν:"
            ]
        ],
        7 => [
            "title" => "Κέντρο πόρων",
        ],
        8 => [
            "title" => "Πρόγραμμα",
            "content" => [
                "Ο μαραθώνιος χάκινγκ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού περιλαμβάνει τρεις ξεχωριστούς γύρους.",
                "24ωρος διαδικτυακός μαραθώνιος χάκινγκ. Από το σύνολο των συμμετεχόντων θα επιλεγούν έως 10 ομάδες για να συνεχίσουν στον διαγωνισμό.",
                "Δωρεάν διαδικτυακή εκπαίδευση και καθοδήγηση και για τις 10 ομάδες το καλοκαίρι του 2021.",
                "Τελικός γύρος: ο φυσικός μαραθώνιος χάκινγκ. 10 ομάδες θα λάβουν ισότιμη εκπαίδευση στον δεύτερο γύρο, αλλά μόνο μία θα νικήσει.  Μαθητές της δευτεροβάθμιας εκπαίδευσης, ηλικίας 15-19 ετών, θα διαγωνιστούν σε ομάδες για να επιλύσουν μια «τοπική πρόκληση», η οποία θα επιλεγεί από προτάσεις που θα υποβληθούν πριν από τον πρώτο γύρο.",
                "Το 2021, το EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού) φέρνει έξι εξαιρετικούς μαραθώνιους χάκινγκ και προσκαλεί μαθητές λυκείου, 15-19 ετών, να σχηματίσουν ομάδες και να χρησιμοποιήσουν τις δεξιότητές τους στην κωδικοποίηση για να λύσουν μια τοπική πρόκληση. Μετά από 24 ώρες χάκινγκ, κάθε ομάδα θα παρουσιάσει τις ιδέες της σε μια επιτροπή εμπειρογνωμόνων που θα επιλέξει τις 10 ομάδες του τελικού.  Όλες οι ομάδες θα έχουν στη διάθεσή τους ίδιο χρόνο, ίδιους πόρους και ίδια πρόσβαση σε μέντορες και τεχνογνωσία για να ολοκληρώσουν την πρόκληση, αλλά μόνο 10 θα έχουν την ευκαιρία να συνεχίσουν στον επόμενο γύρο, να αναπτύξουν το πρωτότυπό τους, να λάβουν εξειδικευμένη εκπαίδευση και να συμμετάσχουν στον τελικό μαραθώνιο χάκινγκ το φθινόπωρο. Στον τελικό, οι ομάδες θα διαγωνιστούν για να αποφασιστεί ποια θα κερδίσει αξεσουάρ πληροφορικής και την ευκαιρία να λάβει καθοδήγηση και εκπαίδευση για να αναπτύξει περαιτέρω το πρωτότυπό της.",
                "Η ομάδα σου δεν εξασφαλίζει μια θέση στον δεύτερο γύρο ακόμα και αν επιλύσει με επιτυχία την πρόκληση. Να θυμάσαι ότι διαγωνίζεστε με τις άλλες ομάδες και η κριτική επιτροπή θα λάβει υπόψη τη μέθοδό σας, τη χρήση του χρόνου και την ποιότητα του πρωτοτύπου για να επιλέξει τους επιτυχόντες υποψηφίους! ",
                "Αν η ομάδα σου είναι μεταξύ των 10 φιναλίστ, μπορείτε να επεξεργαστείτε την ιδέα σας κατά τη διάρκεια του καλοκαιριού. Για να σας βοηθήσουμε, θα σας προσφέρουμε δωρεάν εκπαίδευση σε θέματα ανάπτυξης και σχεδιασμού UX. Η ομάδα σου μπορεί επίσης να λάβει τη βοήθεια ενός μέντορα, ο οποίος θα διασφαλίσει ότι βρίσκεστε στον σωστό δρόμο.",
                "Οι 10 φιναλίστ θα συναντηθούν πρόσωπο με πρόσωπο σε έναν 12ωρο μαραθώνιο χάκινγκ στις Χ (ο οποίος θα πραγματοποιηθεί διαδικτυακά, εάν η κατάσταση της δημόσιας υγείας δεν επιτρέπει τη φυσική συνάντηση). Κατά τη διάρκειά του, οι ομάδες θα διαγωνιστούν για να αναδειχθούν ως οι καλύτεροι νέοι χάκερ της χώρας και θα έχουν την ευκαιρία να κερδίσουν έπαθλα, όπως εκπληκτικό εξοπλισμό πληροφορικής, καθώς και περαιτέρω εκπαίδευση και καθοδήγηση για τις ιδέες τους.",
                "Κάθε εθνικός νικητής θα πάρει μέρος σε μια ευρωπαϊκή τιτανομαχία, στην οποία κάθε νικητήρια ομάδα θα παρουσιάσει τη λύση της σε μια ευρωπαϊκή κριτική επιτροπή κατά τη διάρκεια του επίσημου EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού) που θα πραγματοποιηθεί από τις 9 έως τις 24 Οκτωβρίου 2021. Ο πρωταθλητής Ευρώπης θα κερδίσει, πέρα από τη δόξα, πρόσθετο εξοπλισμό πληροφορικής.",
                "Ημέρα 1",
                "Ημέρα 2",
            ]
        ],
        9 => [
            "title" => "Πρακτικές πληροφορίες",
            "content" => [
                "Ο μαραθώνιος χάκινγκ θα πραγματοποιηθεί στις διαδικτυακά από τις 7 Μαΐου έως τις 8 Μαΐου 2021",
                "Η συμμετοχή στον μαραθώνιο χάκινγκ είναι δωρεάν."

            ]
        ],
        10 => [
            "title" => "Κριτική επιτροπή και μέντορες",
            "content" => [
                "Φαντάσου ότι είσαι σε μια εικονική αίθουσα γεμάτη σχεδιαστές, δημιουργούς, προγραμματιστές και μέντορες σε θέματα επιχειρήσεων, όλοι με την ίδια περιέργεια και την ίδια ώθηση μ' εσένα. Το EU Code Week Hackathon Greece φέρνει κοντά κορυφαίες προσωπικότητες από τον κόσμο των επιχειρήσεων, του τομέα πληροφορικής, του επιχειρηματικού κεφαλαίου, της εκπαίδευσης, καθώς και πρόσωπα που κατέχουν ηγετική θέση σε τοπικό, εθνικό και ενωσιακό επίπεδο, influencer και εκπαιδευτές για να καθοδηγήσουν και να υποστηρίξουν εσένα και την ομάδα σου κατά τη διάρκεια αυτού του εντατικού μαραθωνίου.",
                "Εγγράψου τώρα στο",
                "EU Code Week Hackathon",
                "και κάνε το όνειρό σου πραγματικότητα!",
            ]
        ],

        11 => [
            "title" => "Παράλληλες εκδηλώσεις",
            "content" => [
                "Σε ενδιαφέρουν αυτά τα θέματα αλλά δεν γνωρίζεις προγραμματισμό; Εγγράψου στις παράλληλες εκδηλώσεις μας και ανακάλυψε τον ενθουσιασμό που προσφέρει ο προγραμματισμός, η καινοτομία, η επιχειρηματικότητα και άλλες δεξιότητες που είναι ζωτικής σημασίας για τη συμμετοχή στον ψηφιακό κόσμο. Οι παράλληλες εκδηλώσεις του Code Week Hackathon έχουν προγραμματιστεί να πραγματοποιηθούν από τον Μάιο έως τον Οκτώβριο και θα περιλαμβάνουν διάφορα είδη εργαστηρίων. Η συμμετοχή είναι δωρεάν, πρέπει απλώς να εγγραφείς εδώ. Έλα και μάθε περισσότερα.",
            ]
        ],
        12 => [
            "title" => "Πληροφορίες για το CODEWEEK.EU",
            "content" => [
                "Το EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού, #CodeWeek) είναι ένα κίνημα βάσης που διαχειρίζονται εθελοντές για την προώθηση του ψηφιακού γραμματισμού μέσω δραστηριοτήτων που σχετίζονται με τον προγραμματισμό και την πληροφορική. Δίνει έμπνευση και παρακινεί τους ανθρώπους να αναζητήσουν νέες ιδέες και καινοτομία για το μέλλον. Οι δραστηριότητες για την",
                "EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού)",
                "πραγματοποιούνται σε όλον τον κόσμο από τις 9 έως τις 24 Οκτωβρίου. ",
                "Η ιδέα του EU Code Week Hackathon είναι να δείξει πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των πρωτότυπων ιδεών και των δεξιοτήτων κωδικοποίησης νέων ανθρώπων. Οι μαραθώνιοι χάκινγκ δημιουργούνται και συνδιοργανώνονται από",
                "την Ευρωπαϊκή Επιτροπή",
                "και τους τοπικούς",
                "πρεσβευτές της Ευρωπαϊκής Εβδομάδας Προγραμματισμού",
                "Η πρωτοβουλία χρηματοδοτείται από",
                "το Ευρωπαϊκό Κοινοβούλιο",
                "Ανακάλυψε περισσότερα",
            ]
        ],

        "mentors" => [
            "1" => ["Δημήτριος Τζίμας",
                "Ο Δημήτριος Τζίμας έλαβε το πτυχίο B.Sc στην Πληροφορική, το Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης και το πτυχίο M.Sc στο «Digital Signal Processing for Communications and Multimedia» Πανεπιστήμιο Αθηνών.",
                "Σήμερα είναι διδακτορικός φοιτητής στο Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης. Τα ερευνητικά του ενδιαφέροντα περιλαμβάνουν το Learning Analytics και MOOCs. Έχει δημοσιεύσει πολλά επιστημονικά άρθρα σε περιοδικά και πρακτικά συνεδρίων. Διδάσκει Πληροφορική στη δευτεροβάθμια και τριτοβάθμια εκπαίδευση τα τελευταία 21 χρόνια. Είναι συν-συγγραφέας 4 ελληνικών βιβλίων σχετικά με τον προγραμματισμό υπολογιστών.",
            ],
            "2" => ["Ioannis Papikas",
                "Ο Γιάννης μπήκε στον κόσμο της επιχειρηματικότητας περίπου 8 χρόνια πριν και βοήθησε στο χτίσιμο web εφαρμογών με την ομάδα του σε διάφορα industries.",
                "Επίσης συμμετείχε στον \"Entrepreneur First\" accelerator στο Λονδίνο, χτίζοντας την δική του startup. Ο Γιάννης αυτή τη στιγμή είναι Senior Product Manager στην Orfium.",
            ], "3" => ["Γιάννης Φανίδης",
                "Ονομάζομαι Γιάννης Φανίδης, είμαι 27 χρονών και ζω στη Θεσσαλονίκη.  Ξεκίνησα να ασχολούμαι με τον προγραμματισμό στα χρόνια του Λυκείου δημιουργώντας απλές εφαρμογές για κινητά και ιστοσελίδες.",
                "Τα τελευταία 7 χρόνια έχω συνεργαστεί με πολλές εξαιρετικές και πολύ ταλαντούχες ομάδες ανθρώπων σε περισσότερα από 20 web και mobile έργα. Αυτή την περίοδο εργάζομαι σαν Lead Frontend Engineer στην Exandia, στην πόλη της Θεσσαλονίκης, και παράλληλα αναπτύσσω mobile εφαρμογές σαν freelancer.",
            ], "4" => ["Λήδα Παπατζήκα",
                "Η Λήδα Παπατζήκα είναι Στέλεχος Επικοινωνίας στην Αλεξάνδρεια Ζώνη Καινοτομίας. Διαθέτει εκτεταμένη εμπειρία στο χώρο του marketing και της προώθησης έργων του οικοσυστήματος καινοτομίας της περιοχής."
            ], "5" => ["Νικόλας Γούλιας",
                "Ο Νικόλας είναι ο επικεφαλής της συνεργασίας IBM - Red Hat για το Ηνωμένο Βασίλειο και την Ιρλανδία με στόχο την αξιοποίηση της καινοτομίας ανοιχτού κώδικα και την επιτυχία πελατών στον καθορισμό στρατηγικής και επίλυσης προβλημάτων με βάση την τεχνολογία.",
            ],

            "6" => [
                "Αχιλλέας Υφαντής",
                "Ο Αχιλλέας Υφαντής έχει δημιουργήσει διάφορες νεοσύστατες επιχειρήσεις και έχει εργαστεί σε διάφορες εταιρείες όπως η Citrix.",
                "Είμαι και μηχανικός δοκιμών ασφάλειας αυτοματισμού, το πεδίο γνώσης μου περιλαμβάνει: kybernetes, microservices, shell, container, azure, ci / cd, github, Python, golang.",
            ],
            "7" => [
                "Αλέξανδρος Παπαδάκης",
                "O Αλέξανδρος Παπαδάκης ειναι Συμβουλος Τεχνολογίας με εμπειρία στην ανάπτυξη επιχειρήσεων, πωλήσεων και διαχείριση λογιαριασμών πελατων σε πολλαπλες διεθνείς αγορές. Εργάζετε στην Amazon Web Services απο το 2019.",
                "Η προηγούμενη επαγελματικη του δραστηριότητα ήταν στη Google, Coca Cola, Public Retail World S.A με διάφορες ιδιότητες στις Πωλήσεις και το Marketing. Είναι κατοχος Bachelor΄s Degree στο Ιnternational Business απο το University of Kent καθώς και μεταπτυχιακού τίτλου στο Management απο το CASS Business School.",
            ],
            "8" => [
                "Ανδριάνα Βέρα",
                "Ονομάζομαι Ανδριάνα Βέρα και πρόσφατα σπουδάζω στο Εθνικό & Καποδιστριακό Πανεπιστήμιο Αθηνών, στο τμήμα Πληροφορικής και Τηλεπικοινωνιών.Προς το παρόν, εργάζομαι ως προγραμματίστρια στην Team CANDI / InfoQuest Technologies.",
                "Έχοντας πολύ αγάπη και ενθουσιασμό για τον τομέα της τεχνολογίας, μου αρέσει να περνάω χρόνο να μαθαίνω και να μοιράζομαι τις γνώσεις μου.",
            ],
            "9" => [
                "Antigoni Kakouri",
                "5ος φοιτητής Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών στο Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης. Η Microsoft Learn Student Ambassador από τον Ιανουάριο του 2021.",
            ],


            "10" => [
                "Αθανάσιος Δήμου",
                "Geomentor. Υπάλληλος στο ΥΠΠΟΑ. Μηχανικός Γεωπληροφορικής και Τοπογραφίας και κάτοχος δύο μεταπτυχιακών (Msc) ειδίκευσης. Πρώτη θέση στο διαγωνισμό NASA Space Apps 2017 στην Ελλάδα.",
                "Μέντορας, κριτής και υποστηρικτής σε αρκετά Hackathons, Datathlons (Nasa Space Apps, MIT Covid-19 Challenge, Healthahtlon, Tap2open, Copernicus 2019-2020, Ίδρυμα Ευγενίδου - Hack the Lab, Global Hack, Antivirus Hackathon, HackCoronaGreece κ.α.). Πρόεδρος του Πανελληνίου Συλλόγου Πτυχιούχων Μηχανικών Γεωπληροφορικής και Τοπογραφίας.",
            ],
            "11" => [
                "Δέσποινα αποφοίτησε",
                "Η Δέσποινα αποφοίτησε με διδακτορικο στα εφαρμοσμενα μαθηματικά από το Cnam της Γαλλίας. Είναι συνιδρύτρια και CTO της ΑΙ σταρταπ Trayvisor.",
            ],
            "12" => [
                "Ευαγγελία Ιακωβάκη",
                "Το όνομά μου είναι Ευαγγελία Ιακωβάκη, είμαι Φυσικός και εργάζομαι ως Φυσικός σε δημόσιο λύκειο. Εργάζομαι επίσης ως σύμβουλος καθοδήγησης για μαθητές",

            ],
            "13" => [
                "Γιάννης Πράπας",
                "Το όνομά μου είναι Γιάννης Πράπας και είμαι Account Executive των Digital Native οργανισμών της Amazon Web Services (AWS). ).",
                "Η δουλειά μου είναι να βοηθάω επιχειρήσεις να καινοτομήσουν και να δημιουργήσουν μοντέρνες εφαρμογές χρησιμοποιώντας τις υπηρεσίες της AWS.",
            ],
            "14" => [
                "Ilias Karabasis",
                "Αυτή την περίοδο εργάζομαι ως Full Stack Software Engineer, ενώ παράλληλα εξερευνώ το πεδίο του Data Science και της Τεχνητής Νοημοσύνης. Πρόσφατα έγινα μέλος του προγράμματος MS Learn Student Ambassadors.",
                "Εξειδικεύομαι σε τεχνολογίες .NET, C# και Angular. Επίσης, είμαι εξοικειωμένος με την Python και διάφορα Machine Learning και Data Science Frameworks.",
            ],
            "15" => [
                "Δρ. Κωνσταντίνος Φούσκας",
                "Ο Δρ. Κωνσταντίνος Φούσκας είναι Αναπληρωτής Καθηγητής Ψηφιακής Επιχειρηματικότητας και Τεχνολογικής Καινοτομίας στο Τμήμα Εφαρμοσμένης Πληροφορικής του Πανεπιστημίου Μακεδονίας. Διδάσκει θέματα σχετικά με την ανάπτυξη καινοτομίας και επιχειρηματικότητας, ηλεκτρονικού εμπορίου και επιχειρείν, διοίκησης τεχνολογίας και ψηφιακού μετασχηματισμού.",
                "Παράλληλα διδάσκει σε μεταπτυχιακό επίπεδο και συνεργάζεται με πολλά ακόμα ακαδημαϊκά ιδρύματα σε Ελλάδα και εξωτερικό.  Η έρευνα του έχει δημοσιευτεί σε πάνω από 50 Διεθνή περιοδικά και συνέδρια και έχει συμμετάσχει σε πάνω από 30 χρηματοδοτούμενα ερευνητικά προγράμματα σε Ελληνικό και Διεθνές επίπεδο σχετικά με καινοτομία και ΤΠΕ. ",
            ],
            "16" => [
                "Marina Stavrakantonaki",
                "Χαιρετισμούς από την AWS! Είμαι Υπεύθυνη Δημόσιας Διοίκησης για την Amazon Web Services, για την Ελλάδα και την Κύπρο. Το υπόβαθρο της εκπαιδευτικής και εργασιακής μου εμπειρίας είναι στη Δημόσια Διοίκηση, στην Επιχειρηματική Στρατηγική και το διδακτορικό μου είναι στην Επιδημιολογία. Είμαι διαθέσιμη να βοηθήσω τους μαθητές όπου με χρειάζονται.",

            ],
            "17" => [
                "Νίκος Ζαχαριάδης",
                "Ο Νίκος Ζαχαριάδης είναι Χημικός και διαθέτει 22ετή εμπειρία στο χώρο των επιχειρήσεων και συγκεκριμένα στον τομέα των πωλήσεων, όπου προάγει την κερδοφόρα εργασία, με σεβασμό απέναντι τόσο στους πελάτες όσο και στους συνεργάτες του. Έχοντας στο ενεργητικό του μεγάλες επιχειρήσεις, τα τελευταία 6 χρόνια, εργάζεται ως Chief Commercial Officer, στον μεγαλύτερο Cloud provider της χώρας με τρία ιδιόκτητα Data center, την Lancom.",
                "Έχει συμμετάσχει, ως mentor, σε πάρα πολλά startup weekend και συμβουλεύειstartups πάνω σε θέματα business, όπως Go to market strategies, Business development, κ.λπ.Μπορείτε να βρείτε τον Νίκο στα HQ της Lancom ή να του στείλετε email στη διεύθυνση:nzachariadis@lancom.gr",
            ],

            "18" => [
                "Ροδάνθη Αλεξίου",
                "Ονομάζομαι Ροδάνθη Αλεξίου και σπουδάζω Πληροφορική στο Πανεπιστήμιο Αθηνών. Είμαι Microsoft Learn Student Ambassador, General Organizer στο Google’s Developer Student Club, μέλος της Operations ομάδας της Mindspace NPOκαι με ενδιαφέρει πολύ η Τεχνητή Νοημοσύνη και το Data Science. Μπορείτε να βρείτε τα tech blog μου εδώ: http://www.rodanthi-alexiou.com/",

            ],
            "19" => [
                "Triantafyllos Paschaleris",
                "Ενθουσιώδης με την τεχνολογία και γεμάτος ενδιαφέρον για την απόκτηση νέων γνώσεων γύρω από αυτή. Προγραμματιστής συστημάτων επιχειρηματικών πληροφοριών (BI Developer) κατ’ επάγγελμα και ταυτόχρονα μεταπτυχιακός φοιτητής πάνω στην ανάλυση μαζικών δεδομένων (MSc Big Data Analytics), έχοντας πάντα διάθεση για συνεισφορά σε εθελοντικές δράσεις γύρω από την πληροφορική.",
            ],
            "20" => [
                "Katerina Katmada",
                "Η Κατερίνα είναι σχεδιαστής με φόντο κωδικοποίησης, ειδικευμένος στην οπτική ταυτότητα, UI / UX και σχεδιασμό οπτικοποίησης δεδομένων. Σπούδασε Επιστήμη Υπολογιστών (BSc, MSc) και Σχεδιασμός Προϊόντων (MSc) και εργάζεται ως οπτικός σχεδιαστής στο Geekbot.",
                "Ενδιαφέρεται να δημιουργήσει προσβάσιμα και ευχάριστα σχέδια για διάφορες πλατφόρμες, ξεκινώντας καθορίζοντας τις ανάγκες των χρηστών και μεταφράζοντας τις σε απτές έννοιες, ενισχύοντας παράλληλα τη φωνή της μάρκας μέσω σταθερών οπτικών σημείων επαφής.",
            ],
            "21" => [
                "Alexandra Hatsiou",
                "Η Αλεξάνδρα είναι απο την Αθήνα και δουλεύει στην Amazon Web Services (AWS) στη Μαδρίτη ως Business DevelopmentRepresentative υποστηρίζοντας πελάτες στις χώρες της Κεντρικής και Ανατολικής Ευρώπης. Έχει σπουδάσει Οικονομικά και Management και πριν την AWS εργαζόταν στο Μάρκετινγκ. ",
            ],
            "22" => [
                "Δημήτρης Μπάκας",
                "Ο Δημήτρης Μπάκας είναι Gold Microsoft Learn Student Ambassador και φοιτητής του τμήματος Μηχανικών Η/Υ από το Πανεπιστήμιο Πατρών, που του αρέσει να ασχολείται με software engineering και Artificial Intelligence.",
                "",
            ],
            "23" => [
                "Δήμητρα Ιορδανίδου",
                "Η Δήμητρα Ιορδανίδου έχει οικονομικό υπόβαθρο και εργάζεται στην Ζώνη Καινοτομίας Θεσσαλονίκης ως υπεύθυνη Οικονομικών Υπηρεσιών. Έχει επαγγελματική εμπειρία σε θέματα προϋπολογισμού και οικονομικής παρακολούθησης. Επιπλέον ασχολήθηκε σε επίπεδο πρωταθλητισμού με τον αθλητισμό σαν μαραθωνοδρόμος και έχει στήσει και οργανώνει για 4η χρονιά project για δρομείς και παιδιά Koufalia Hill Run. Είναι κάτοχος μεταπτυχιακού στη Διοίκηση Επιχειρήσεων (Bath University, UK) και πτυχίου Οικονομικών από το ΑΠΘ.",
                "",
            ],
            "24" => [
                "Δημήτρης Δημοσιάρης",
                "Ο Δημήτρης Δημοσιάρης είναι συνιδρυτής του Founderhood που στοχεύει να επηρεάσει κάθε άνθρωπο δίνοντας σε κάθε ιδρυτή τεχνολογικής startup, όπου και αν βρίσκεται, πρόσβαση στα καλύτερα εφόδια. Έχει συμμετάσχει στο παρελθόν σε δύο startup prοjects.  Είναι  ιδρυτικό μέλος του πρώτου φοιτητικού οργανισμού επιχειρηματικότητας στην Ελλάδα με έδρα το ΟΠΑ, το Thinkbiz. Ιδρυτικό μέλος και πρώην πρόεδρος του Mindspace, της ΜΚΟ επιχειρηματικότητας και καινοτομίας με έδρα το ΕΜΠ. Ο Δημήτρης έχει μεγάλη εμπειρία στο σχεδιασμό και ανάπτυξη καινοτόμων web προϊόντων.",

            ],
            "25" => [
                "Γεωργία Μαργιά",
                "Εμπειρία στην δημιουργία λογισμικού για περισσότερα απο 6 χρόνια. Δημιουργία προγραμμάτων σχετικά με την Πρόβλεψη Ζήτησης για μεγάλες εταιρείες λιανικού εμπορίου στις Ηνωμένες Πολιτείες Αμερικής, στην Αγγλία και στην Ρωσία. Επί του παρόντος εργάζομαι ως Database Reporting Analyst και ασχολούμαι με την αποθήκευση, διαχείριση και επεξεργασία δεδομένων με σκοπό την δημιουργία αναφορών, την ανάλυση μοτίβων και τάσεων και την εξαγωγή συμπερασμάτων για στρατηγικούς και υπηρεσιακούς σκοπούς.",

            ],
            "26" => [
                "Κωνσταντίνος Χαλιάσος",
                "Το όνομά μου είναι Κωνσταντίνος Χαλιάσος και μένω στην Θεσσαλονίκη, Ελλάδα. Έχω πάθος για όλες τις πτυχές της ανάπτυξης λογισμικού εστιάζοντας στις διαδικτυακές εφαρμογές όπως και στις εφαρμογές κινητών τηλεφώνων. Τα τελευταία 10 χρόνια έχω δουλέψει με ομάδες σε παγκόσμιο επίπεδο σε πρότζεκτ που έχουν ως στόχο της καλυτέρευση της ποιότητας ζωής μας μέσω της τεχνολογίας. Αυτή την στιγμή δουλεύω ως Lead Software Engineer στην Exandia και ως ελεύθερος επαγγελματίας.",
                "",
            ],
            "27" => [
                "Κώστας Καλογήρου",
                "CEO Exandia - Επιχειρηματίας με τεχνολογικό προσανατολισμό και ικανή εμπειρία στην οπτική επικοινωνία και την εκπαίδευση. Ως στέλεχος του Μουσείου Design Θεσσαλονίκης έχει συνδιοργανώσει εκθέσεις design σε Ευρώπη και Αμερική. Μέλος κριτικών επιτροπών σχεδιασμού οπτικής επικοινωνίας εντός και εκτός Ελλάδας. Θα υποστηρίξει τις ομάδες του Hackathon σε επιχειρηματικά θέματα και στη παρουσίαση των προτάσεών τους.",
                "",
            ],   "28" => [
                "Μαρία-Αναστασία Μουστάκα",
                "Η Μαρία-Αναστασία Μουστάκα είναι τελειόφοιτη φοιτήτρια στο Τμήμα Μηχανικών Η/Υ του πανεπιστημίου Πατρών και Gold Microsoft Learn Student Ambassador. Επίσης, διδάσκει ρομποτική και προγραμματισμό τα τελευταία τέσσερα χρόνια και έχει διακριθεί σε παγκόσμιους διαγωνισμούς ρομποτικής με τη Λέσχη Ρομποτικής του Πανεπιστημίου Πατρών.",
                "",
            ],
            "29" => [
                "Mixalis Nikolaidis",
                "Είμαι ανώτερος μηχανικός λογισμικού, σύμβουλος και εκπαιδευτής. Ενδιαφέρομαι κυρίως για την ανάπτυξη καινοτόμων λύσεων cloud που εκμεταλλεύονται πλήρως τη στοίβα τεχνολογίας της Microsoft. Έχω εργαστεί σε πολλά έργα που παρέχουν ποιοτικές υπηρεσίες τόσο σε ομαδικά περιβάλλοντα όσο και ανεξάρτητα.",

            ],
            "30" => [
                "Νικηφόρος εργάζεται",
                "Ο Νικηφόρος εργάζεται ως Αρχιτέκτονας Λύσεων (Solutions Architect – SA) στην Amazon Web Services, και καλύπτει τον Δημόσιο τομέα στην Ελλἀδα και Κύπρο. Στον ρόλο του ως SA, ο Νικηφόρος είναι υπεύθυνος να επιταχύνει το ταξίδι του ψηφιακού μετασχηματισμού των πελατών του με το να μοιράζεται μαζί τους βέλτιστες πρακτικές για να δημιουργούν πετυχημένες λύσεις στο AWS Cloud. Πριν την έναρξη της συνεργασίας του με την AWS (2.5 χρόνια πριν), ο Νικηφόρος ολοκλήρωσε τις μεταπτυχιακές σπουδές του στην Επιστήμη των Υπολογιστών (Imperial College London) ενώ προηγουμένως είχε αποφοιτήσει από το τμήμα Διοικητικής Επιστήμης και Τεχνολογίας του Οικονομικού Πανεπιστημίου Αθηνών.",

            ],
            "31" => [
                "Παναγιώτης Αντωνίου",
                "Καλησπέρα, ονομάζομαι Παναγιώτης Αντωνίου, είμαι κάτοικος Λονδίνου όπου και εργάζομαι σαν SolutionsArchitect. Κατάγομαι από την Κύπρο και είχα έρθει στο Ηνωμένο Βασίλειο για να πάρω πτυχίο Πληροφορικής. Με ενδιαφέρουν τα Analytics, τα δίκτυα και τα περιβαλλοντικά θέματα. Εχτός δουλειάς μου αρέσει να παίζω αθλήματα που περιλαμβάνουν ρακέτες, να παίζω κιθάρα και να παρακολουθώ ταινίες.",

            ],   "32" => [
                "Anastasia Papadou",
                "Η Αναστασία εργάζεται ως Senior Business Development Representative στην Amazon Web Services με κύρια δραστηρίοτητα την ανάπτυξη της AWS στην Ευρώπη, Μ. Ανατολή και Αφρική. ‘Εχει 5 χρονια εμπειρίας στο κομμάτι της υλοποίησης/ ανάπτυξης cloud τεχνολογιών και είναι απόφοιτος του τμήματος Διοικητικής Επιστήμης και Τεχνολογίας.",
            ],
            "33" => [
                "Κωνσταντίνα Ταγκοπούλου",
                "Η Κωνσταντίνα Ταγκοπούλου αγαπά την επιχειρηματικότητα, και έχει συνεργαστεί με startups και scaleups στην Ευρώπη.  Από το 2019, δουλεύει στην Amazon Web Services υποστηρίζοντας νέες εταιρείες στη στρατηγική ανάπτυξη τους στοcloud. Πριν την AWS, εργαζόταν σε μια B2B SaaS startup στο Λονδίνο, όπου ήταν υπεύθυνη για την εμπορική ανάπτυξη. Κατέχει BSc στην Κοινωνιολογία από το Πανεπιστήμιο του Μπαθ και MSc στην Κοινωνιολογία από το Πανεπιστήμιο της Οξφόρδης.",

            ]

        ],

        "after" => [
            "Επόμενα βήματα",
            "Οι ομάδες που επιλέχθηκαν επεξεργάζονται τώρα το πρωτότυπό τους και θα συναντηθούν στον τελικό μαραθώνιο χάκινγκ στις Χ για να διαγωνιστούν και να αποφασιστεί ο νικητής του ελληνικού μαραθωνίου χάκινγκ. Παρακολούθησε εδώ και στα μέσα κοινωνικής δικτύωσης τις ενημερώσεις από τις ομάδες των διαγωνιζόμενων! ",
            "Το EU Code Week Hackathon Greece προσφέρει σε έξυπνους, παθιασμένους νέους την ευκαιρία να χρησιμοποιήσουν τις δεξιότητές τους στην κωδικοποίηση και τις δημιουργικές ιδέες τους για να επιλύσουν μια συγκεκριμένη τοπική πρόκληση. Μετά από έναν αρχικό 24ωρο εικονικό μαραθώνιο χάκινγκ, έως 10 ομάδες συνεχίζουν στο επόμενο στάδιο. Οι φιναλίστ επεξεργάστηκαν τα πρωτότυπά τους με κάποια καθοδήγηση από τους μέντορες κατά τη διάρκεια του καλοκαιριού και είναι πλέον έτοιμοι να διαγωνιστούν! Το ταξίδι του μαραθώνιου χάκινγκ της Εβδομάδας Προγραμματισμού ολοκληρώθηκε με μια μάχη δεξιοτήτων, γνώσεων και δημιουργικότητας στον τελικό μαραθώνιο χάκινγκ στις Χ Σεπτεμβρίου στην πόλη [πόλη].",
            "Οι νικητές",
            "Δες όλους τους νικητές",
            "Συλλογή",
            "Δες τους «νέους χάκερ» από την Ελλάδα σε δράση κατά τη διάρκεια του EU Code Week Hackathon",
            "Τοίχος υποστήριξης",
            "Ευχαριστούμε τα tweet, τις ειδικές αναφορές και όλη την υποστήριξη κατά τη διάρκεια του μαραθωνίου χάκινγκ! Δες ορισμένες από τις σημαντικότερες στιγμές!",
            "Κριτική επιτροπή και μέντορες",
            "Το EU Code Week Hackathon στην Ελλάδα έφερε κοντά κορυφαία πρόσωπα από τον κόσμο των επιχειρήσεων, του τομέα πληροφορικής, του επιχειρηματικού κεφαλαίου, της εκπαίδευσης, καθώς και πρόσωπα που κατέχουν ηγετική θέση σε τοπικό, εθνικό και ενωσιακό επίπεδο, influencer και εκπαιδευτές για να καθοδηγήσουν και να υποστηρίξουν τους συμμετέχοντες κατά τη διάρκεια του εντατικού μαραθωνίου χάκινγκ. Επιλεγμένα μέλη της κριτικής επιτροπής ορίστηκαν για να καθορίσουν την τελική νικητήρια ομάδα, σύμφωνα με τις σχετικές κατευθυντήριες γραμμές και τους κανόνες του διαγωνισμού.",
            "Διάβασε τις κατευθυντήριες γραμμές"
        ]


    ],


];
