<?php

return [

    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Δώσε πνοή στις ιδέες σου!',
    'sections' => [
        1 => [
            'title' => '6 μαραθώνιοι ανάπτυξης εφαρμογών, 6 προκλήσεις',
            'content' => [
                1 => 'Ζεις στην Ελλάδα, τη Λετονία, την Ιρλανδία, την Ιταλία, τη Ρουμανία ή τη Σλοβενία; Είσαι δημιουργικός, φιλόδοξος και σε ενδιαφέρει το μέλλον της τεχνολογίας; Άρπαξε την ευκαιρία! Εγγράψου σε έναν από τους μαραθώνιους χάκινγκ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και ανάπτυξε μια καινοτόμο λύση που θα σε βάλει στην πρώτη γραμμή της τεχνολογικής επανάστασης!',
                2 => 'Το 2021, το EU Code Week (Ευρωπαϊκή Εβδομάδα Προγραμματισμού) φέρνει έξι εξαιρετικούς μαραθώνιους χάκινγκ και προσκαλεί μαθητές 15-19 ετών, που πηγαίνουν Γυμνάσιο, να σχηματίσουν ομάδες και να χρησιμοποιήσουν τις δεξιότητές τους στην κωδικοποίηση για να λύσουν μια τοπική πρόκληση. Μετά από 24 ώρες χάκινγκ, κάθε ομάδα θα παρουσιάσει τις ιδέες της σε μια ομάδα εμπειρογνωμόνων που θα επιλέξουν τις 10 ομάδες φιναλίστ. Όλες οι ομάδες θα έχουν στη διάθεσή τους ίδιο χρόνο, ίδιους πόρους και ίδια πρόσβαση σε μέντορες και εμπειρογνώμονες για να ολοκληρώσουν την πρόκληση, αλλά μόνο 10 θα έχουν την ευκαιρία να συνεχίσουν στον επόμενο γύρο, να αναπτύξουν το μοντέλο τους, να πάρουν εξειδικευμένη εκπαίδευση και να λάβουν μέρος σε το τελικό μαραθώνιο χάκινγκ το φθινόπωρο. Εδώ οι ομάδες θα ανταγωνιστούν για να αποφασίσουν ποιος θα κερδίσει εκπληκτικό εξοπλισμό πληροφορικής και την ευκαιρία να λάβει καθοδήγηση και εκπαίδευση για να αναπτύξει περαιτέρω το πρωτότυπο του.'
            ]
        ],
        2 => [
            'title' => 'Πώς μπορώ να συμμετάσχω;',
            'content' => [
                1 => "Επίλεξε τον μαραθώνιο χάκινγκ στη χώρα σου και ακολούθησε μερικά απλά βήματα για να εγγραφείς. Μπορείς να συμμετάσχεις ατομικά ή ως μέλος ομάδας έξι ατόμων. Εάν εγγραφείς με φίλους ή συμμαθητές, μην ξεχάσεις να αναφέρεις το όνομα της ομάδας σας κατά την εγγραφή. Κάθε μαραθώνιος χάκινγκ θα ανοίξει τις εγγραφές ξεχωριστά, γι' αυτό ακολούθησε τον μαραθώνιο της χώρας σου!"
            ]
        ],
        3 => [
            'title' => 'Ποιοι είναι οι οργανωτές;',
            'content' => [
                1 => 'Οι Μαραθώνιοι Ανάπτυξης Εφαρμογών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού διοργανώνονται από κοινού από την Ευρωπαϊκή Επιτροπή και τοπικούς ',
                2 => 'Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
                3 => ' και χρηματοδοτούνται από το Ευρωπαϊκό Κοινοβούλιο. Στόχος είναι να παρουσιάσουν πώς συγκεκριμένες λύσεις υλοποιούνται με τη βοήθεια της δημιουργικότητας, του ενθουσιασμού, των καινοτόμων ιδεών και των δεξιοτήτων προγραμματισμού των νέων.'
            ]
        ],
        4 => [
            'title' => 'Πώς είναι ένας μαραθώνιος ανάπτυξης εφαρμογών;',
            'content' => [
                1 => 'Το EU Code Week Hackathon είναι ένα ταξίδι που ξεκινάει με έναν 24ωρο διαδικτυακό μαραθώνιο Έμπειροι μέντορες θα καθοδηγήσουν τις ομάδες και θα πραγματοποιηθούν εργαστήρια που θα παρέχουν ευκαιρίες στους συμμετέχοντες να μάθουν νέες δεξιότητες και να διασκεδάσουν. Ο μαραθώνιος είναι επίσης μια εξαιρετική ευκαιρία για τους συμμετέχοντες να δικτυωθούν και να κοινωνικοποιηθούν με ανθρώπους στον ευρωπαϊκό τομέα της τεχνολογίας. Στο τέλος του μαραθωνίου κάθε ομάδα θα δώσει τη λύση της σε μια κριτική επιτροπή ειδικών. ',
                2 => 'Οι δέκα καλύτερες ομάδες θα συνεχίσουν το ταξίδι τους στον μαραθώνιο χάκινγκ και θα λάβουν εκπαίδευση και καθοδήγηση κατά τη διάρκεια του καλοκαιριού. Στη συνέχεια, οι νικητές θα συμμετάσχουν στον τελευταίο 12ωρο εθνικό μαραθώνιο χάκινγκ τον Σεπτέμβριο ή τον Οκτώβριο (ο οποίος θα πραγματοποιηθεί διαδικτυακά, εάν η κατάσταση της δημόσιας υγείας δεν επιτρέπει τη φυσική συνάντηση).',
            ]
        ],
        5 => [
            'title' => 'Δεν ξέρω προγραμματισμό - τι μπορώ να κάνω;',
            'content' => [
                1 => 'Παράλληλα με τον μαραθώνιο ανάπτυξης εφαρμογών, θα πραγματοποιηθούν εργαστήρια για αρχάριους στον προγραμματισμό, τη χρήση υλισμικού, τη ρομποτική κ.λπ. ώστε οι συμμετέχοντες να αποκτήσουν κάποιες βασικές γνώσεις για την υπολογιστική σκέψη και τον προγραμματισμό. Μάθετε περισσότερες πληροφορίες σχετικά με τον τρόπο εγγραφής στην τοπική σας σελίδα.'
            ]
        ],

        6 => [
            'title' => 'Εταίροι',
        ],

        7 => [
            'title' => "Πάρε μέρος στη διασκέδαση!",
        ],

    ],

    'cities' => [

        1 => [
            'city' => "",
            'country' => "Ρουμανία",
            'date' => "17-18 Απριλίου 2021"
        ],
        2 => [
            'city' => "",
            'country' => "Ιρλανδία",
            'date' => "Απριλίου 2021"
        ],
        3 => [
            'city' => "",
            'country' => "Ιταλία",
            'date' => "7-8 Μαΐου 2021"
        ],
        4 => [
            'city' => "",
            'country' => "Ελλάδα",
            'date' => "8-9 Μαΐου 2021"
        ],
        5 => [
            'city' => "",
            'country' => "Σλοβενία",
            'date' => "15-16 Μαΐου 2021"
        ],
        6 => [
            'city' => "",
            'country' => "Λετονία",
            'date' => "29-30 Μαΐου 2021"
        ],
    ],
    'final' => [
        1 => 'Τελικός τον',
        2 => 'Σεπτέμβριο/Οκτώβριο 2021'
    ]


];
