<?php

return [

    'about' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι μια πρωτοβουλία βάσης που έχει ως στόχο να κάνει τον προγραμματισμό και τον ψηφιακό γραμματισμό προσιτό σε όλους, με διασκεδαστικό και ενδιαφέροντα τρόπο.',
    'when' => '5-20 Οκτωβρίου 2019',
    'when_text' => 'Η εκμάθηση συγγραφής κώδικα μας βοηθάει να κατανοούμε τον κόσμο που εξελίσσεται ταχύτατα γύρω μας, να διευρύνουμε τις γνώσεις μας για τον τρόπο λειτουργίας της τεχνολογίας και να αναπτύσσουμε δεξιότητες και ικανότητες, ώστε να ανακαλύπτουμε νέες ιδέες και να καινοτομούμε.',
    'school_banner_title' => 'ΔΗΛΩΣΕ ΣΥΜΜΕΤΟΧΗ!',
    'school_banner_text' => 'Είσαι εκπαιδευτικός;',
    'school_banner_text2' => 'Κάνε κλικ εδώ για να μάθεις πώς να συμμετάσχεις!'

];
