<?php

return [
    'about' =>
        'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι μια πρωτοβουλία βάσης που έχει ως στόχο να κάνει τον προγραμματισμό και τον ψηφιακό γραμματισμό προσιτό σε όλους, με διασκεδαστικό και ενδιαφέροντα τρόπο.',
    'when' => '7-22 Οκτωβρίου 2023',
    'when_text' =>
        'Η εκμάθηση συγγραφής κώδικα μας βοηθάει να κατανοούμε τον κόσμο που εξελίσσεται ταχύτατα γύρω μας, να διευρύνουμε τις γνώσεις μας για τον τρόπο λειτουργίας της τεχνολογίας και να αναπτύσσουμε δεξιότητες και ικανότητες, ώστε να ανακαλύπτουμε νέες ιδέες και να καινοτομούμε.',
    'school_banner_title' => 'ΔΗΛΩΣΕ ΣΥΜΜΕΤΟΧΗ!',
    'school_banner_text' => 'Είσαι εκπαιδευτικός;',
    'school_banner_text2' => 'Κάνε κλικ εδώ για να μάθεις πώς να συμμετάσχεις!',
    'organize_activity_title' => 'Οργάνωσε ή πάρε μέρος σε μια δραστηριότητα',
    'organize_activity_text' =>
        'Ο καθένας μπορεί να διοργανώσει ή να συμμετέχει σε  μια δραστηριότητα. Διάλεξε θέμα και κοινό στόχος και <a href="/add">πρόσθεσε τη δραστηριότητά σου</a> στον <a href="/events">χάρτη</a>, ή αναζήτησε εκδηλώσεις στην περιοχή σου.',
    'get_started_title' => 'Ξεκίνα',
    'get_started_text' =>
        'Δεν ξέρεις πώς να αρχίσεις; Ρίξε μια ματιά στη <a href="/guide">σελίδα «Οδηγίες»</a>, και κατέβασε τις <a href="/toolkits">εργαλειοθήκες μας για οργανωτές</a> για να ετοιμαστείς και να ενημερώσεις κι άλλους.',
    'access_resources_title' => 'Απέκτησε πρόσβαση σε πόρους και εκπαίδευση',
    'access_resources_text' =>
        'Αν δεν ξέρεις πώς να διοργανώσεις μια δραστηριότητα, επισκέψου τη <a href="/resources/teach">σελίδα εκπαιδευτικών πόρων μας</a> και το υλικό <a href="/training">κατάρτισης εκπαιδευτικών προγραμμάτων</a> για καθοδήγηση και προσαρμοσμένα πλάνα μαθημάτων.'
];
