<?php

return [
    'free-online-courses' => '2.	Δωρεάν διαδικτυακά μαθήματα',
    'intro' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού προσφέρει ευκαιρίες επαγγελματικής ανάπτυξης με τη μορφή διαδικτυακών μαθημάτων. Στόχος είναι η υποστήριξη των δασκάλων στην εισαγωγή του προγραμματισμού και της υπολογιστικής σκέψης μέσα στην τάξη.',
    'icebreaker' =>
        [
            'title' => 'Το εισαγωγικό μάθημα «Σπάμε τον πάγο»',
            'text' => [
                0 => 'Το',
                1 => 'μάθημα «Σπάμε τον πάγο» της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
                2 => 'είναι μια ενότητα πέντε ωρών στα αγγλικά που απευθύνεται σε οποιονδήποτε ενδιαφέρεται για τις βασικές αρχές του προγραμματισμού και της υπολογιστικής σκέψης. Οι συμμετέχοντες μαθαίνουν πως να εγείρουν την περιέργεια και το καινοτόμο πνεύμα των νέων ανθρώπων, ενώ παράλληλα ενδυναμώνονται για να γίνουν ψηφιακοί δημιουργοί. Το μάθημα βοηθά τους συμμετέχοντες να ανακαλύψουν τα οφέλη και τη συσχέτιση της υπολογιστικής σκέψης και του προγραμματισμού με την καθημερινότητά μας. Επίσης προσφέρει ιδέες, δωρεάν εκπαιδευτικό υλικό και πόρους για τη διοργάνωση διασκεδαστικών και εκπαιδευτικών δραστηριοτήτων για παιδιά, πάντα και παντού – ιδίως κατά τη διάρκεια της Εβδομάδας Προγραμματισμού.',
                3 => 'Δεν χρειάζεται να έχετε προηγούμενη εμπειρία ή γνώση προγραμματισμού για να λάβετε μέρος στο μάθημα. Το μόνο που χρειάζεται είναι ένα πνεύμα γεμάτο περιέργεια. ',

            ],
            'registration' => [
                0 => 'Οι εγγραφές έχουν ξεκινήσει εδώ',
                1 => 'για το μάθημα που διεξάγεται από 16 Σεπτεμβρίου και 30 Οκτωβρίου 2020. Σας ενημερώνουμε ότι θα χρειαστεί να ανοίξετε έναν λογαριασμό στην Ευρωπαϊκή Ακαδημία Σχολικού Δικτύου για να εγγραφείτε. ',
            ],
            'check-out' => 'Δείτε την έκδοση του2019'
        ],
    "deep-dive" => [
        'title' => 'Το μάθημα εμβάθυνσης «Στα βαθιά»',
        'text' => [
            0 => 'Το διαδικτυακό μάθημα «Στα βαθιά» της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι μια ενότητα διάρκειας εικοσιπέντε ωρών στα αγγλικά που προσφέρει στους δασκάλους τη δυνατότητα να εξοικειωθούν με τις αρχές του προγραμματισμού και να αποκομίσουν γνώση και εμπιστοσύνη, ώστε να διοργανώσουν εύκολες, διασκεδαστικές, διαδραστικές δραστηριότητες προγραμματισμού με τους μαθητές τους. Οι δάσκαλοι θα ανακαλύψουν τους δωρεάν',
            1 => 'πόρους',
            2 => 'της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και το εκπαιδευτικό υλικό που είναι διαθέσιμο σε 29 γλώσσες, ιδίως τους τομείς που αφορούν τον προγραμματισμό, όπως την υπολογιστική σκέψη, τις δραστηριότητες χωρίς σύνδεση στο διαδίκτυο και τις αστείρευτες δυνατότητες της ρομποτικής, του μαστορέματος και της κατασκευής, των γλωσσών οπτικού προγραμματισμού, της δημιουργίας εφαρμογών και πολλά άλλα.'
        ],
        'course-link' => "Δείτε το μάθημα «Στα βαθιά» του 2019"
    ],
    "social-media" => [
        0 => 'Ακολουθήστε την',
        1 => 'Ευρωπαϊκή Εβδομάδα Προγραμματισμού στα μέσα κοινωνικής δικτύωσης',
        2 => 'για να μάθετε πότε θα ξεκινήσει το επόμενο μάθημα',
    ]

];