<?php

return [

    'title' => 'Δημιουργία πιστοποιητικών συμμετοχής για την τάξη σου',
    'phrase1' => 'Συμπλήρωσε τη φόρμα με τα ονόματα των μαθητών, χωρίζοντάς τα με κόμμα, και θα λάβεις τα ατομικά πιστοποιητικά συμμετοχής.',
    'names' => [
        'label' => 'Ονόματα για πιστοποιητικό',
        'help' => 'Χρησιμοποίησε κόμμα ανάμεσα στα ονόματα κάθε συμμετέχοντα',
    ],
    'event_name' => [
        'label' => 'Όνομα δραστηριότητας',
        'help' => 'Το όνομα της δραστηριότητάς σου που θα τυπωθεί πάνω στο πιστοποιητικό',
    ],
    'event_date' => [
        'label' => 'Ημερομηνία δραστηριότητας',
        'help' => 'Η ημερομηνία της δραστηριότητάς σου που θα τυπωθεί πάνω στο πιστοποιητικό',
    ],
    'submit' => 'Δημιουργία πιστοποιητικών',
    'thanks_page' => [
        'title' => 'Τα πιστοποιητικά σας έχουν δημιουργηθεί!',
        'phrase1' => 'Κάνε κλικ σ’ αυτόν τον σύνδεσμο για να κατεβάσεις τον συμπιεσμένο φάκελο με όλα τα πιστοποιητικά',

    ],

];
