<?php

return [
   
    'podcasts-text' => 'Συντονίσου για εξειδικευμένες γνώσεις από ειδικούς πάνω στον Προγραμματισμό και την ψηφιακή δημιουργικότητα!',
    'podcasts-series-text1' => 'Καλώς ήρθες στη σειρά podcast της Ευρωπαϊκής Εβδομάδας Προγραμματισμού. Φέρνουμε τον προγραμματισμό, την υπολογιστική σκέψη, τη ρομποτική και την καινοτομία πιο κοντά σε εσένα, την κοινότητά σου και το σχολείο σου.',
    'podcasts-series-text2' => 'Ακολούθησε τις Arjana Blazic, Eugenia Casariego και Ειρήνη Συμεωνίδου, καθώς εξερευνούν μια ποικιλία θεμάτων, από τον γραμματισμό στα μέσα επικοινωνίας έως τη ρομποτική, με τη βοήθεια έμπειρων προσκεκλημένων – για να σου δώσουν τη δυνατότητα να εξοπλίσεις τους μαθητές σου με τις δεξιότητες για να αντιμετωπίσουν τις προκλήσεις και τις ευκαιρίες που θέτει το ψηφιακό μέλλον.',

];