<?php

return [
    'subtitle' => 'Η παρούσα δήλωση περί ιδιωτικότητας περιλαμβάνει πληροφορίες σχετικά με την επεξεργασία και την προστασία των προσωπικών σας δεδομένων.',
    'processing-operation' => [
        'Πράξη επεξεργασίας',
        'διαχείριση των Πρέσβεων και των Επικεφαλής Εκπαιδευτικών της Εβδομάδας Προγραμματισμού και καταχώριση δραστηριοτήτων στον ιστότοπο'
    ],
    'data-processors' => [
        'Εκτελούντες την επεξεργασία',
        'GOPA Com. S.A. και EUN Partnership AISBL (European Schoolnet), info@codeweek.eu'
    ],
    '1-intro' => [
        'Οι πληροφορίες σχετικά με την επεξεργασία προσωπικών δεδομένων για τη διαχείριση των Πρέσβεων και των Επικεφαλής Εκπαιδευτικών της Εβδομάδας Προγραμματισμού και την καταχώριση των δραστηριοτήτων στον ιστότοπο.'
    ],

    '3-legal_process' => [
        'Νομιμότητα της πράξης επεξεργασίας: Η μονάδα G.2 συλλέγει, αποθηκεύει και δημοσιεύει τα προσωπικά σας δεδομένα, επειδή δώσατε τη ρητή συγκατάθεσή σας επιλέγοντας το σχετικό τετραγωνίδιο κατά την εγγραφή σας για να γίνετε Πρέσβης ή Επικεφαλής Εκπαιδευτικός της Εβδομάδας Προγραμματισμού ή κατά την υποβολή αίτησης για την καταχώριση εκδήλωσης για την  <a href="https://codeweek.eu/register">Ευρωπαϊκή Εβδομάδα Προγραμματισμού.</a>',

    ],
    '4-collect_data' => [
        'Τα <strong>υποχρεωτικά</strong> προσωπικά δεδομένα που συλλέγονται για τους <strong>Πρέσβεις και τους Επικεφαλής Εκπαιδευτικούς</strong> είναι τα εξής:',
        'Ονοματεπώνυμο',
        'Διεύθυνση ηλεκτρονικού ταχυδρομείου',
        'Κωδικός πρόσβασης',
        'Φωτογραφία',
        'Βιογραφικό',
        'Τίτλος',
        'Γνωστικό πεδίο για Επικεφαλής Εκπαιδευτικούς.',
        'Όταν <strong>καταχωρίζετε μια δραστηριότητα, τα υποχρεωτικά</strong> προσωπικά δεδομένα που συλλέγονται είναι τα εξής:',
        'Ονομασία του οργανισμού',
        'Είδος οργανισμού',
        'Διεύθυνση ηλεκτρονικού ταχυδρομείου για επικοινωνία',
        'Η παροχή των δεδομένων αυτών είναι υποχρεωτική είτε για να γίνετε Πρέσβης ή Επικεφαλής Εκπαιδευτικός της Εβδομάδας Προγραμματισμού είτε για να καταχωρίσετε μια δραστηριότητα στον ιστότοπο της Εβδομάδας Προγραμματισμού.',
        'Επιπλέον, <strong>οι Πρέσβεις και οι Επικεφαλής Εκπαιδευτικοί</strong> μπορούν <strong>να</strong> παρέχουν οικειοθελώς τα ακόλουθα προσωπικά δεδομένα:',
        'Λογαριασμοί στα μέσα κοινωνικής δικτύωσης',
        '<strong>Οι διοργανωτές δραστηριότητας</strong> μπορούν <strong>να</strong> παρέχουν οικειοθελώς τα ακόλουθα δεδομένα:',
        'Δημόσια διεύθυνση ηλεκτρονικού ταχυδρομείου για επικοινωνία',
        'Ιστότοπος διοργανωτή',
        'Κωδικός Εβδομάδας Προγραμματισμού για Όλους',
        'Για τους διοργανωτές δραστηριοτήτων, επισημαίνεται ότι ο υπεύθυνος Πρέσβης για τη χώρα σας ή η μονάδα G.2 μπορεί να χρησιμοποιήσει τα προσωπικά δεδομένα που υποβάλατε για να καταχωρίσετε μια δραστηριότητα προκειμένου να επικοινωνήσει μαζί σας σχετικά με την εν λόγω δραστηριότητα.',
        'Υποβάλατε τα προσωπικά σας δεδομένα στη',
        'σελίδα σύνδεσης του ιστότοπου της Εβδομάδας Προγραμματισμού',
        'και στη',
        'σελίδα καταχώρισης δραστηριότητας.',
    ],
    '5-how_long' => [
        'Όλα τα προσωπικά δεδομένα θα διαγραφούν από τις βάσεις δεδομένων εάν αποσυρθείτε από την πρωτοβουλία ή 5 έτη μετά το τέλος της πρωτοβουλίας.',
    ],

    '6-protect_data' => [
        'Όλα τα προσωπικά δεδομένα σε ηλεκτρονική μορφή (μηνύματα ηλεκτρονικού ταχυδρομείου, έγγραφα, βάσεις δεδομένων, δέσμες δεδομένων που έχουν αναφορτωθεί κ.λπ.) αποθηκεύονται στους εξυπηρετητές είτε της Ευρωπαϊκής Επιτροπής είτε των εξωτερικών συνεργατών της. Όλες οι πράξεις επεξεργασίας διενεργούνται σύμφωνα με την <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?qid=1548093747090&uri=CELEX:32017D0046">απόφαση (ΕΕ, Ευρατόμ) 2017/46 της Επιτροπής</a>,, της 10ης Ιανουαρίου 2017, σχετικά με την ασφάλεια των συστημάτων επικοινωνίας και πληροφοριών στην Ευρωπαϊκή Επιτροπή.',
        'Οι εξωτερικοί συνεργάτες της Επιτροπής δεσμεύονται, όσον αφορά κάθε πράξη επεξεργασίας των δεδομένων σας για λογαριασμό της Επιτροπής, από ειδική συμβατική ρήτρα, καθώς και από τις υποχρεώσεις τήρησης του απορρήτου που απορρέουν από τις διατάξεις μεταφοράς του γενικού κανονισμού για την προστασία των δεδομένων στο εθνικό δίκαιο των κρατών μελών («ΓΚΠΔ» <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32016R0679">κανονισμός (ΕΕ) 2016/679</a>).',
        'Για την προστασία των προσωπικών σας δεδομένων η Επιτροπή εφαρμόζει σειρά τεχνικών και οργανωτικών μέτρων. Τα τεχνικά μέτρα περιλαμβάνουν κατάλληλες δράσεις για την αντιμετώπιση των ζητημάτων ασφάλειας στο διαδίκτυο και των κινδύνων απώλειας ή αλλοίωσης δεδομένων ή μη εξουσιοδοτημένης πρόσβασης σε δεδομένα, λαμβανομένων υπόψη του κινδύνου που ενέχει η επεξεργασία και της φύσης των προσωπικών δεδομένων που υποβάλλονται σε επεξεργασία. Τα οργανωτικά μέτρα περιορίζουν, μεταξύ άλλων, την πρόσβαση στα προσωπικά δεδομένα αποκλειστικά σε εξουσιοδοτημένα πρόσωπα, τα οποία πρέπει να τα γνωρίζουν για την εκτέλεση αυτής της πράξης επεξεργασίας.',
    ],
    '7-access_data' => [
        'Το προσωπικό της Επιτροπής μπορεί να έχει πρόσβαση σε όλα τα προσωπικά δεδομένα που έχετε υποβάλει με βάση την αρχή της «αναγκαίας γνωστοποίησης». Επιπλέον, πρόσβαση στα προσωπικά σας δεδομένα παρέχεται στον εξωτερικό μας συνεργάτη με βάση την αρχή της «αναγκαίας γνωστοποίησης».',
        'Για τους σκοπούς της ενίσχυσης της προβολής των Πρέσβεων, των Επικεφαλής Εκπαιδευτικών ή των καταχωρισμένων δραστηριοτήτων της Εβδομάδας Προγραμματισμού, όλα τα προσωπικά σας δεδομένα δημοσιεύονται στον ακόλουθο  <a href="https://codeweek.eu/">ιστότοπο</a>.',
        'Επιπλέον, η μονάδα G.2 ενδέχεται να κοινοποιήσει τα στοιχεία επικοινωνίας σας σε άτομο ή ενδιαφερόμενο μέρος το οποίο θα χρειαστεί να επικοινωνήσει μαζί σας σε σχέση με την Εβδομάδα Προγραμματισμού. Για τους διοργανωτές δραστηριοτήτων, επισημαίνεται ότι ο υπεύθυνος Πρέσβης για τη χώρα σας ή η μονάδα G.2 μπορεί να χρησιμοποιήσει τα προσωπικά δεδομένα που υποβάλατε για να καταχωρίσετε μια δραστηριότητα προκειμένου να επικοινωνήσει μαζί σας σχετικά με την εν λόγω δραστηριότητα.',
    ],
    '8-rights' => [
        'Έχετε συναινέσει στην παροχή των προσωπικών σας δεδομένων στη μονάδα G.2 για την παρούσα πράξη επεξεργασίας. Μπορείτε να αποσύρετε τη συγκατάθεσή σας ανά πάσα στιγμή ειδοποιώντας τη μονάδα G.2 στη διεύθυνση CNECT-G2@ec.europa.eu. Η ανάκληση της συγκατάθεσης δεν θίγει τη νομιμότητα της επεξεργασίας που πραγματοποιήθηκε πριν από την ανάκληση.'
    ],

    '10-detailed-info' => [
        'Η συγκεκριμένη πράξη επεξεργασίας έχει συμπεριληφθεί στο δημόσιο μητρώο του υπευθύνου προστασίας δεδομένων με τα ακόλουθα στοιχεία αναφοράς παλαιότερης ειδοποίησης: DPR-EC-02631 Διαχείριση των σημείων επαφής για τις πολιτικές, τα προγράμματα και τα έργα της ΓΔ CONNECT.'
    ]
];