<?php

return [
    'title' => 'ΠΡΟΣΤΑΣΙΑ ΤΩΝ ΠΡΟΣΩΠΙΚΩΝ ΣΑΣ ΔΕΔΟΜΕΝΩΝ',
    'processing-operation' => [
        'Πράξη επεξεργασίας',
        'Επεξεργασία δεδομένων προσωπικού χαρακτήρα στον ιστότοπο codeweek.eu, συμπεριλαμβανομένων των διευθύνσεων IP, από επισκέπτες των ιστότοπων που είναι προσβάσιμοι στο κοινό.'
    ],

    'data-controller' => [
        'Υπεύθυνος επεξεργασίας δεδομένων',
        'Ευρωπαϊκή Επιτροπή, Γενική Διεύθυνση Επικοινωνιακών Δικτύων, Περιεχομένου και Τεχνολογιών, Μονάδα G.2.'
    ],
    'record-reference' => 'Στοιχεία αναφοράς καταχώρισης',
    'table-of-contents' => 'Πίνακας περιεχομένων',

    '1-intro' => [
        'title' => 'Εισαγωγή',
        'items' => [
            '1' =>
                'Η Ευρωπαϊκή Επιτροπή (στο εξής: Επιτροπή) δεσμεύεται να προστατεύει τα προσωπικά σας δεδομένα και να σέβεται την ιδιωτική σας ζωή. Η Επιτροπή συλλέγει και επεξεργάζεται περαιτέρω τα προσωπικά δεδομένα σύμφωνα με <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv:OJ.L_.2018.295.01.0039.01.ENG&toc=OJ:L:2018:295:TOC">τον κανονισμό (ΕΕ) 2018/1725</a> του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 23ης Οκτωβρίου 2018, για την προστασία των φυσικών προσώπων έναντι της επεξεργασίας δεδομένων προσωπικού χαρακτήρα από τα θεσμικά και λοιπά όργανα και τους οργανισμούς της Ένωσης και την ελεύθερη κυκλοφορία των δεδομένων αυτών [ο οποίος καταργεί τον κανονισμό (ΕΚ) αριθ. 45/2001].',
            '2' =>
                'Η παρούσα δήλωση περί ιδιωτικότητας εξηγεί τον λόγο επεξεργασίας των προσωπικών σας δεδομένων, τον τρόπο συλλογής, διαχείρισης και προστασίας όλων των παρεχόμενων προσωπικών δεδομένων, τον τρόπο με τον οποίο χρησιμοποιούνται οι εν λόγω πληροφορίες και τα δικαιώματα που έχετε ως προς τα προσωπικά σας δεδομένα. Επίσης, παρέχει τα στοιχεία επικοινωνίας του υπευθύνου επεξεργασίας δεδομένων στον οποίο μπορείτε να απευθύνεστε για να ασκήσετε τα δικαιώματά σας, καθώς και του υπευθύνου προστασίας δεδομένων και του Ευρωπαίου Επόπτη Προστασίας Δεδομένων.',
            '3' => [
                'Οι πληροφορίες σχετικά με την πράξη επεξεργασίας',
                'Επεξεργασία δεδομένων στον ιστότοπο codeweek.eu',
                'στην οποία προβαίνει η Επιτροπή παρουσιάζεται παρακάτω.'
            ]
        ]
    ],
    '2-why' => [
        'title' => 'Γιατί και πώς επεξεργαζόμαστε τα προσωπικά σας δεδομένα;',
        'items' => [
            "Σκοπός της επεξεργασίας",
            "Η Γενική Διεύθυνση Επικοινωνιακών Δικτύων, Περιεχομένου και Τεχνολογιών της Επιτροπής προσφέρει διάφορους εξωτερικούς ιστότοπους. Η τεχνική δομή συλλέγει και χρησιμοποιεί τα προσωπικά σας στοιχεία για να είναι σε θέση να παρέχει τους ιστότοπους που βρίσκονται εκτός της ελεγχόμενης από την Επιτροπή υποδομής φιλοξενίας.",
            "Τα προσωπικά σας δεδομένα δεν θα χρησιμοποιηθούν για τη λήψη αυτοματοποιημένων αποφάσεων, συμπεριλαμβανομένης της κατάρτισης προφίλ."
        ]
    ],
    '3-legal_process' => [
        'title' =>
            'Με ποια ή με ποιες νομικές βάσεις επεξεργαζόμαστε τα προσωπικά σας δεδομένα;',
        'items' => [
            'Επεξεργαζόμαστε τα προσωπικά σας δεδομένα με βάση:',
            '<strong>το άρθρο 5 παράγραφος 1 στοιχείο α) του κανονισμού (ΕΕ) 2018/1725</strong>: η επεξεργασία είναι <span style="text-decoration: underline">απαραίτητη για την εκπλήρωση καθήκοντος </span> που εκτελείται προς το δημόσιο συμφέρον ή κατά την άσκηση δημόσιας εξουσίας που έχει ανατεθεί στο όργανο ή τον οργανισμό της Ένωσης.',
            "Πράγματι, η ενημέρωση του ευρέος κοινού αποτελεί καθήκον που απορρέει από τα προνόμια της Ευρωπαϊκής Επιτροπής σε θεσμικό επίπεδο, όπως προβλέπεται στο άρθρο 58 παράγραφος 2 στοιχείο δ) του κανονισμού (ΕΕ, Ευρατόμ) αριθ. 2018/1046 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 18ης Ιουλίου 2018, σχετικά με τους δημοσιονομικούς κανόνες που εφαρμόζονται στον γενικό προϋπολογισμό της Ένωσης  (ΕΕ L 193 της 30.7.2018, σ. 1). Διασφαλίζουμε ότι εφαρμόζονται επαρκείς και ειδικές εγγυήσεις για την επεξεργασία προσωπικών δεδομένων, σύμφωνα με την εφαρμοστέα νομοθεσία για την προστασία των δεδομένων.",
            '<strong>το άρθρο 5 παράγραφος 1 στοιχείο δ) του κανονισμού (ΕΕ) 2018/1725:</strong> για τις δραστηριότητες επεξεργασίας που συνίστανται σε cookies και επαλήθευση ταυτότητας, η <span style="text-decoration: underline">συναίνεσή σας</span> είναι απαραίτητη. Σύμφωνα με το άρθρο 3 σημείο 15 και το άρθρο 7 του κανονισμού (ΕΕ) 2018/1725, η συγκατάθεση πρέπει να είναι ελεύθερη, συγκεκριμένη, ρητή και εν πλήρει επιγνώσει.',
            "Έχουμε λάβει τη συγκατάθεσή σας απευθείας από εσάς. Μπορεί να την έχετε δώσει μέσω μηνύματος ηλεκτρονικού ταχυδρομείου, μέσω ηλεκτρονικού εντύπου εγγραφής ή με οποιαδήποτε άλλη γραπτή μορφή."
        ]
    ],
    '4-collect_data' => [
        'title' => 'Ποια προσωπικά δεδομένα συλλέγουμε και υποβάλλουμε σε περαιτέρω επεξεργασία;',
        'items' => [
            'Για τους σκοπούς <strong>της συγκεκριμένης πράξης επεξεργασίας</strong>, η μονάδα G.2 συλλέγει τις ακόλουθες κατηγορίες προσωπικών δεδομένων:',
            'διεύθυνση πρωτοκόλλου διαδικτύου (διεύθυνση IP) ή αναγνωριστικό συσκευής της συσκευής που χρησιμοποιείται για την πρόσβαση στον ιστότοπο.',
            'Χωρίς τη συγκεκριμένη πράξη επεξεργασίας δεν θα μπορείτε να δημιουργήσετε τεχνική σύνδεση μεταξύ των συσκευών σας και της υποδομής του διακομιστή και, ως εκ τούτου, δεν θα μπορείτε να έχετε πρόσβαση στον ιστότοπό μας.',
            'Για να μπορείτε να προβαίνετε σε <strong>επαλήθευση της ταυτότητάς σας σε αυτόν τον ιστότοπο</strong>, η μονάδα G.2 συλλέγει τις ακόλουθες κατηγορίες προσωπικών δεδομένων:',
            'διεύθυνση ηλεκτρονικού ταχυδρομείου',
            'κωδικό πρόσβασης· ή',
            'επαλήθευση ταυτότητας με τα μέσα κοινωνικής δικτύωσης.'
        ]
    ],
    '5-how_long' => [
        'title' => 'Για πόσο χρονικό διάστημα διατηρούμε τα προσωπικά σας δεδομένα;',
        'items' => [
            'Η μονάδα G.2 διατηρεί τα προσωπικά σας δεδομένα για όσο χρονικό διάστημα απαιτείται για την εκπλήρωση του σκοπού της συλλογής ή περαιτέρω επεξεργασίας τους, δηλαδή για τη διάρκεια της περιόδου περιήγησής σας στον ιστότοπο. Επιπλέον, οι διευθύνσεις IP ενδέχεται να αποθηκευτούν για ένα έτος στα αρχεία καταγραφής των υπηρεσιών για λόγους ασφάλειας. Όσον αφορά το εργαλείο ανάλυσης, η διεύθυνση IP και το αναγνωριστικό της συσκευής (π.χ. αριθμός IMEI και διεύθυνση MAC WIFI) διαγράφονται αμέσως κατά την αποσύνδεση.',
        ]
    ],
    '6-protect_data' => [
        'title' => 'Πώς προστατεύουμε και διαφυλάσσουμε τα προσωπικά σας δεδομένα;',
        'items' => [
            'Όλα τα προσωπικά δεδομένα σε ηλεκτρονική μορφή (μηνύματα ηλεκτρονικού ταχυδρομείου, έγγραφα, βάσεις δεδομένων, δέσμες δεδομένων που έχουν αναφορτωθεί κ.λπ.) αποθηκεύονται στους εξυπηρετητές της Ευρωπαϊκής Επιτροπής. Κάθε πράξη επεξεργασίας πραγματοποιείται σύμφωνα με την',
            'απόφαση (ΕΕ, Ευρατόμ) 2017/46 της Επιτροπής',
            'της 10ης Ιανουαρίου 2017, σχετικά με την ασφάλεια των συστημάτων επικοινωνίας και πληροφοριών στην Ευρωπαϊκή Επιτροπή.',
            'Για την προστασία των προσωπικών σας δεδομένων, η Επιτροπή εφαρμόζει σειρά τεχνικών και οργανωτικών μέτρων. Τα τεχνικά μέτρα περιλαμβάνουν κατάλληλες δράσεις για την αντιμετώπιση των ζητημάτων ασφάλειας στο διαδίκτυο και των κινδύνων απώλειας ή αλλοίωσης δεδομένων ή μη εξουσιοδοτημένης πρόσβασης σε δεδομένα, λαμβανομένων υπόψη του κινδύνου που ενέχει η επεξεργασία και της φύσης των προσωπικών δεδομένων που υποβάλλονται σε επεξεργασία. Τα οργανωτικά μέτρα περιορίζουν, μεταξύ άλλων, την πρόσβαση στα προσωπικά δεδομένα αποκλειστικά σε εξουσιοδοτημένα πρόσωπα, τα οποία πρέπει να τα γνωρίζουν για την εκτέλεση αυτής της πράξης επεξεργασίας.',

        ]
    ],
    '7-access_data' => [
        'title' =>
            'Ποιοι έχουν πρόσβαση στα προσωπικά σας δεδομένα και σε ποιους κοινοποιούνται;',
        'items' => [
            'Πρόσβαση στα προσωπικά σας δεδομένα παρέχεται στο προσωπικό της Επιτροπής που είναι αρμόδιο για την εκτέλεση της εν λόγω πράξης επεξεργασίας και σε εξουσιοδοτημένο προσωπικό σύμφωνα με την αρχή της «αναγκαίας γνωστοποίησης». Το εν λόγω προσωπικό δεσμεύεται από τις εκ του νόμου προβλεπόμενες και, όταν απαιτείται, από πρόσθετες συμφωνίες τήρησης του απορρήτου.',
            'Επιπλέον, πρόσβαση στα προσωπικά σας δεδομένα μπορεί να παρασχεθεί σε εξωτερικούς συνεργάτες που εργάζονται βάσει συμβατικής συμφωνίας για λογαριασμό της υπηρεσίας της Επιτροπής στην οποία ανήκουν οι ιστότοποι και που έχουν αναλάβει τη δημιουργία, τη συντήρηση, τη διαχείριση και την αρχειοθέτηση ιστότοπων, σύμφωνα με την αρχή της «αναγκαίας γνωστοποίησης».',
            'Οι πληροφορίες που συλλέγουμε δεν κοινοποιούνται σε οποιονδήποτε τρίτο, παρά μόνο στον βαθμό και για σκοπό που ενδεχομένως επιβάλλεται εκ του νόμου.'
        ]
    ],
    '8-rights' => [
        'title' => 'Ποια είναι τα δικαιώματά σας και πώς μπορείτε να τα ασκήσετε;',
        'items' => [
            'Ως «υποκείμενο των δεδομένων» έχετε συγκεκριμένα δικαιώματα βάσει του κεφαλαίου ΙΙΙ (άρθρα 14-25) του κανονισμού (ΕΕ) 2018/1725, ιδίως το δικαίωμα πρόσβασης, διόρθωσης ή διαγραφής των δεδομένων προσωπικού χαρακτήρα που σας αφορούν και το δικαίωμα περιορισμού της επεξεργασίας των δεδομένων αυτών. Κατά περίπτωση, έχετε επίσης το δικαίωμα εναντίωσης στην επεξεργασία ή το δικαίωμα στη φορητότητα των δεδομένων.',
            'Έχετε το δικαίωμα να αντιταχθείτε στην επεξεργασία των προσωπικών σας δεδομένων, η οποία εκτελείται νόμιμα σύμφωνα με το άρθρο 5 παράγραφος 1 στοιχείο α).',
            'Έχετε δώσει τη συγκατάθεσή σας για την παροχή των προσωπικών σας δεδομένων για την παρούσα πράξη επεξεργασίας. Μπορείτε να αποσύρετε τη συγκατάθεσή σας ανά πάσα στιγμή ειδοποιώντας τη μονάδα G.2. Η ανάκληση της συγκατάθεσης δεν θίγει τη νομιμότητα της επεξεργασίας που πραγματοποιήθηκε πριν από την ανάκληση.',
            'Μπορείτε να ασκήσετε τα δικαιώματά σας επικοινωνώντας με τον υπεύθυνο επεξεργασίας των δεδομένων ή, σε περίπτωση διαφωνίας μαζί του, με τον υπεύθυνο προστασίας δεδομένων. Εάν χρειαστεί, μπορείτε επίσης να απευθυνθείτε στον Ευρωπαίο Επόπτη Προστασίας Δεδομένων. Τα στοιχεία επικοινωνίας τους παρέχονται στο σημείο 9 κατωτέρω.',
            'Εάν επιθυμείτε να ασκήσετε τα δικαιώματά σας στο πλαίσιο μίας ή περισσότερων συγκεκριμένων πράξεων επεξεργασίας, συμπεριλάβετε περιγραφή των πράξεων στην αίτησή σας (δηλ. παραθέστε τα στοιχεία αναφοράς της καταχώρισης ή των καταχωρίσεων, όπως ορίζεται στο σημείο 10 παρακάτω).'
        ]
    ],
    '9-contact' => [
        'title' => 'Στοιχεία επικοινωνίας',
        'data-controller' => [
            'title' => 'Υπεύθυνος επεξεργασίας δεδομένων',
            'text' => 'Εάν επιθυμείτε να ασκήσετε τα δικαιώματά σας βάσει του κανονισμού (ΕΕ) 2018/1725, ή εάν έχετε παρατηρήσεις, ερωτήματα ή ανησυχίες, ή εάν θέλετε να υποβάλετε καταγγελία σχετικά με τη συλλογή και τη χρήση των προσωπικών σας δεδομένων, μπορείτε να επικοινωνήσετε με τον υπεύθυνο επεξεργασίας δεδομένων, μονάδα G.2, Ευρωπαϊκή Επιτροπή, στη διεύθυνση ηλεκτρονικού ταχυδρομείου'

        ],
        'data-protection-officer' => [
            'title' => 'Υπεύθυνος προστασίας δεδομένων (ΥΠΔ) της Επιτροπής',
            'text' => "Μπορείτε να επικοινωνήσετε με τον υπεύθυνο προστασίας δεδομένων (<a href='mailto:DATA-PROTECTION-OFFICER@ec.europa.eu'>DATA-PROTECTION-OFFICER@ec.europa.eu</a>) σχετικά με ζητήματα που αφορούν την επεξεργασία των προσωπικών σας δεδομένων βάσει του κανονισμού (ΕΕ) 2018/1725."
        ],
        'european-data-protection' => [
            'title' => 'Ευρωπαίος Επόπτης Προστασίας Δεδομένων (ΕΕΠΔ)',
            'text' => 'Εάν θεωρείτε ότι τα δικαιώματά σας βάσει του κανονισμού (ΕΕ) 2018/1725 έχουν παραβιαστεί λόγω της επεξεργασίας των προσωπικών σας δεδομένων από τον υπεύθυνο επεξεργασίας, έχετε δικαίωμα να προσφύγετε (δηλ. μπορείτε να υποβάλετε καταγγελία) στον Ευρωπαίο Επόπτη Προστασίας Δεδομένων (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>) .'
        ]
    ],
    '10-detailed-info' => [
        'title' => 'Πού μπορείτε να βρείτε περισσότερες πληροφορίες;',
        'items' => [
            'Ο υπεύθυνος προστασίας δεδομένων της Επιτροπής (ΥΠΔ) δημοσιεύει το μητρώο όλων των διενεργούμενων από την Επιτροπή πράξεων επεξεργασίας προσωπικών δεδομένων, οι οποίες έχουν τεκμηριωθεί και του έχουν κοινοποιηθεί. Πρόσβαση στο εν λόγω μητρώο παρέχεται μέσω του ακόλουθου συνδέσμου: <a href="https://ec.europa.eu/dpo-register">https://ec.europa.eu/dpo-register</a>',
            'Η συγκεκριμένη πράξη επεξεργασίας έχει συμπεριληφθεί στο δημόσιο μητρώο του υπευθύνου προστασίας δεδομένων με τα ακόλουθα στοιχεία αναφοράς καταχώρισης: <strong>DPR-EC-09706.1</strong>.'
        ]
    ]
];