<?php

return [
    'remote-teaching' => 'διδασκαλία εξ αποστάσεως',
    'intro' => [
        'title' => 'Εβδομάδα Προγραμματισμού και διδασκαλία εξ αποστάσεως',
        'text' => 'Η εξ αποστάσεως εκπαίδευση μπορεί να αποτελέσει μεγάλη πρόκληση για τους εκπαιδευτικούς και τους εκπαιδευόμενους και υπάρχουν πολλά εμπόδια που πρέπει να ξεπεραστούν. Ωστόσο, η διδασκαλία προγραμματισμού, υπολογιστικής σκέψης —ακόμη και ρομποτικής— δεν χρειάζεται να σταματήσει, επειδή οι μαθητές σας είναι στο σπίτι. Ας δούμε μερικές συμβουλές και πόρους που ελπίζουμε ότι θα σας βοηθήσουν.',
        'points' => [
            1 => 'πρόκειται για μια συλλογή σύντομων βίντεο με υλικά για ιδιοκατασκευές, παζλ, παιχνίδια και προκλήσεις προγραμματισμού για καθημερινή χρήση τόσο μέσα στην οικογένεια όσο και στο σχολείο.',
            2 => ['Προγραμματισμός χωρίς σύνδεση στο διαδίκτυο', 'εδώ θα βρείτε διάφορες δραστηριότητες που μπορείτε εύκολα να κάνετε στο σπίτι για να μάθετε ή να διδάξετε προγραμματισμό με υλικά καθημερινής χρήσης.'],
            3 => [
                'Εκπαιδευτικές ενότητες',
                'δώ θα βρείτε «εκπαιδευτικές ενότητες» ή εκπαιδευτικά προγράμματα για τη βιώσιμη ανάπτυξη και την τεχνητή νοημοσύνη τα οποία περιλαμβάνουν στα σχέδια μαθημάτων τους διδακτικές ενότητες εξ αποστάσεως.',
            ],
            4 => [
                'Αποθετήριο πόρων',
                'πολλοί από τους πόρους του αποθετηρίου μπορούν επίσης να χρησιμοποιηθούν σε σενάρια διδασκαλίας εξ αποστάσεως. Μπορείτε να βρείτε πόρους για να διδάξετε προγραμματισμό ή για να μάθετε προγραμματισμό.',
            ],
            5 => [
                'Διαδικτυακά σεμινάρια προγραμματισμού από το σπίτι',
                'γνωρίζατε ότι η Εβδομάδα Προγραμματισμού διοργάνωσε διάφορα διαδικτυακά σεμινάρια για το πώς να μάθετε και να διδάξετε προγραμματισμό από το σπίτι; Ρίξτε μια ματιά!',
            ],

        ],
    ],
    'tips' => [
        'title' => '7 συμβουλές για εξ αποστάσεως διδασκαλία προγραμματισμού',
        'points' => [
            1 => [
                'Εξοικειωθείτε με τις έννοιες, τη γλώσσα προγραμματισμού και το λογισμικό',
                'παρόλο που οι μαθητές μπορούν να μάθουν συγγραφή κώδικα και προγραμματισμό σχεδόν αυτόνομα με τη μέθοδο δοκιμής-σφάλματος, εσείς θα πρέπει να τους καθοδηγήσετε και να τους βοηθήσετε να εντοπίσουν λάθη στη σύνταξή τους. Να είστε έτοιμοι να αλλάξετε και να προσαρμοστείτε αν ένα ψηφιακό εργαλείο ή μια γλώσσα προγραμματισμού δεν φέρει τα μαθησιακά αποτελέσματα που αναμένατε.',
            ],
            2 => [
                'Ενδυναμώστε τους μαθητές',
                'βοηθήστε τους μαθητές σας να αξιοποιήσουν πλήρως τις δυνατότητές τους, παρέχοντας ενδιαφέροντα και ουσιαστικά μαθήματα. Αφήστε τους να εξερευνήσουν τις δεξιότητες και τη δημιουργικότητά τους, δίνοντάς τους τη δυνατότητα να επιλέγουν τα δικά τους σχέδια και αποτελέσματα. Επιπλέον, σας συνιστούμε να είστε ρεαλιστές και να ορίζετε στόχους που μπορούν να επιτευχθούν από τους μαθητές σας.',
            ],
            3 => [
                'Ενθαρρύνετε τους μαθητές να εργάζονται σε ομάδες',
                'ο προγραμματισμός σε ομάδες δεν είναι μόνο πιο διασκεδαστικός, αλλά βοηθά επίσης τους μαθητές να επιτύχουν πιο σύνθετα και δημιουργικά έργα. Επιπλέον, η εξ αποστάσεως μάθηση μπορεί να σημαίνει απομόνωση για ορισμένους μαθητές, και η ομαδική εργασία μπορεί να το αποτρέψει αυτό. Για παράδειγμα, θα μπορούσατε να δημιουργήσετε διαδικτυακές αίθουσες συσκέψεων όπου οι μαθητές σας θα μπορούν να συγκεντρώνονται σε ομάδες ή να οργανώσετε μια αξιολόγηση από ομοτίμους, καλώντας τους μαθητές να δώσουν και να λάβουν εποικοδομητικά σχόλια για τα έργα των άλλων.
', ],
            4 => [
                'Εξερευνήστε το ανοικτό λογισμικό και τις δωρεάν διαδικτυακές πλατφόρμες για να μάθετε πώς να προγραμματίζετε',
                'υπάρχουν πολλοί πόροι υψηλής ποιότητας για να διδαχθείτε και για να διδάξετε προγραμματισμό. Οι πόροι οποίοι είναι προηγμένοι αλλά εξακολουθούν να είναι εύχρηστοι. Πρόκειται για δωρεάν εργαλεία που μπορούν να χρησιμοποιούν οι μαθητές σας χωρίς να χρειάζεται να αγοράσουν άδειες ή να τηλεφορτώσουν λογισμικό. Τα περισσότερα από αυτά μπορείτε να τα βρείτε στο αποθετήριο της Εβδομάδας Προγραμματισμού, π.χ., Scratch, App Inventor, Code.org, EarSketch, Sonic Pi και τα λοιπά. Όπως είδαμε στις εκπαιδευτικές ενότητεςτης Εβδομάδας Προγραμματισμού, μπορείτε να εφαρμόσετε τα εργαλεία αυτά σε οποιοδήποτε θέμα!',

            ],
            5 => [
                'Βάλτε στη διδασκαλία σας το παιχνίδι',
                'τα πρώτα σας βήματα στον προγραμματισμό θα πρέπει να είναι ευχάριστα και διασκεδαστικά, και παρόλο που μπορεί αυτή τη φορά να μην έχετε την ευκαιρία να μοιραστείτε αυτή την ευχαρίστηση με κάποιον άλλον από κοντά, υπάρχουν τρόποι να παίξετε και να διασκεδάσετε μαζί! Για παράδειγμα, μπορείτε να προτείνετε στους μαθητές σας να κάνουν ένα διάλειμμα από το μάθημα για να έρθουν κοντά και να παίξουν μαζί το CodyColor, ένα εκπαιδευτικό παιχνίδι με πολλούς παίκτες που έχει σχεδιαστεί έτσι ώστε οι μαθητές να διδάσκονται υπολογιστική σκέψη παίζοντας.',

            ],
            6 => [
                'Μιμηθείτε την πραγματική αλληλεπίδραση στην τάξη',
                'η τεχνολογία μάς επιτρέπει να αναπαράγουμε τουλάχιστον εν μέρει το είδος της αλληλεπίδρασης που θα αναπτυσσόταν στην τάξη. Μπορείτε να ενθαρρύνετε τους μαθητές σας να χρησιμοποιούν την κάμερά τους σε συγκεκριμένες χρονικές στιγμές, να σηκώνουν το χέρι τους εικονικά, να υποβάλλουν ερωτήσεις πρόσωπο με πρόσωπο ή στο πλαίσιο συνομιλίας, να απαντούν σε ψηφιακές δημοσκοπήσεις και κουίζ κ.λπ. Ορισμένα δωρεάν ψηφιακά εργαλεία που μπορείτε να χρησιμοποιήσετε για τον σκοπό αυτόν είναι τα εξής: Zoom, Microsoft Teams, GoToMeeting ή Jitsi για ζωντανά μαθήματα στην τάξη, και Kahoot, Mentimeter ή Google Forms για κουίζ και αλληλεπίδραση στην τάξη. Τα εργαλεία αυτά θα βοηθήσουν τους μαθητές να αισθάνονται ότι βρίσκονται στην τάξη και να νιώθουν κοντά με τους ομοίους τους',
            ],

            7 => [
                'Εξασφαλίστε τη διαθεσιμότητα και την οικονομική προσιτότητα των υλικών',
                'βεβαιωθείτε ότι τα μαθήματα προγραμματισμού είναι ρεαλιστικά και ότι μπορούν να συμμετέχουν όλοι, διασφαλίζοντας ότι τα απαιτούμενα υλικά είναι εύκολο να βρεθούν σε οποιοδήποτε νοικοκυριό και ότι είτε όλοι οι μαθητές μπορούν να τα καταφέρουν είτε ότι κάνετε τις κατάλληλες προσαρμογές για εκείνους που ίσως να μη τα καταφέρουν. Για παράδειγμα, για τις δραστηριότητες προγραμματισμού χωρίς σύνδεση στο διαδίκτυο απαιτούνται φθηνά υλικά όπως ψαλίδι, χαρτί ή μαρκαδόροι. Όταν ασχολείστε με διαδικτυακές ασκήσεις προγραμματισμού, βεβαιωθείτε ότι όλοι οι μαθητές έχουν στο σπίτι τους πρόσβαση σε ταμπλέτα ή υπολογιστή και αξιόπιστη σύνδεση στο διαδίκτυο.',

            ],

        ],
        'conclusion' => 'Πώς μαθαίνετε και διδάσκετε συγγραφή κώδικα και προγραμματισμό σε περιβάλλοντα διδασκαλίας εξ αποστάσεως; Έχετε συμβουλές για άλλους επαγγελματίες του τομέα της εκπαίδευσης; Προσθέστε ένα σχόλιο στο παρακάτω φόρουμ!',
    ],

];
