<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'title' => 'Υποβολή αναφοράς για την εκδήλωσή σου #codeEU',
    'event_title' => 'Τίτλος εκδήλωσης',
    'number_required' => 'Παρακαλούμε δώσε κάποιες γενικές εκτιμήσεις, ακόμα και αν δεν έχεις τα ακριβή στοιχεία.',
    'phrase1'=>'Μπορείς να συμπληρώσεις αυτό το έντυπο μόνο μία φορά! Παρακαλούμε έλεγξε τα στοιχεία σου προσεχτικά. Αν κάνεις κάποιο λάθος, ',
    'phrase2'=>'Μετά την υποβολή της αναφοράς, θα εκδοθεί αυτόματα ένα εξατομικευμένο πιστοποιητικό συμμετοχής στην Εβδομάδα Προγραμματισμού και θα μπορείς να το καταφορτώσεις ή να το κοινοποιήσεις. Μπορείς να δεις ένα υπόδειγμα πιστοποιητικού εδώ.',
    'phrase3'=>'Τα υποχρεωτικά πεδία σημειώνονται με αστερίσκο *.',
    'phrase4'=>'Μπορείς να συμπληρώσεις αυτό το έντυπο μόνο μία φορά! Παρακαλούμε έλεγξε τα στοιχεία σου προσεχτικά. Αν κάνεις κάποιο λάθος,',
    'contactus'=>'επικοινώνησε μαζί μας',
    'participants_count' => [
        'label' => 'Αριθμός συμμετεχόντων',
    ],
    'average_participant_age' => [
        'label'=>'Μέσος όρος ηλικίας συμμετεχόντων',
    ],
    'percentage_of_females' => [
        'label' => 'Ποσοστό κοριτσιών/γυναικών',
    ],
    'codeweek_for_all_participation_code' => [
        'label' => 'Κωδικός συμμετοχής στην πρόκληση Codeweek for all',
        'help' => 'Μπορείς να συμπληρώσεις εδώ τον κωδικό της πρόκλησης Codeweek4All, εάν έχεις. Εάν δεν συμμετέχεις, απλώς αγνόησέ αυτό το πεδίο.'
    ],
    'name_for_certificate' => [
        'label' => 'Όνομα για πιστοποιητικό',
        'help' => 'Άλλαξέ το με το όνομα του διοργανωτή της εκδήλωσης, για τον οποίο θα εκδοθεί πιστοποιητικό συμμετοχής στην Εβδομάδα Προγραμματισμού. Παρακαλούμε χρησιμοποίησε μόνο ASCII (λατινικούς) χαρακτήρες. Οι χαρακτήρες με τόνους, διαλυτικά και συναφή δεν υποστηρίζονται.'
    ],
    'submit' => 'Υποβολή αναφοράς εκδήλωσης',
    'thanks_page'=>[
        'title'=>'Ευχαριστούμε για την υποβολή της αναφοράς της εκδήλωσής σου!',
        'certificate_ready'=>'Το πιστοποιητικό σου είναι έτοιμο.',
        'download_button'=>'Πάτησε εδώ για λήψη.',
        'back_events'=>'Επιστροφή στην εκδήλωσή σου'
    ]



];
