<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'title' => 'ΣΧΟΛΕΙΑ: ΜΙΛΗΣΤE ΣΤΟΥΣ ΜΑΘΗΤΕΣ ΣΑΣ ΓΙΑ ΤΗΝ ΕΒΔΟΜΑΔΑ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ',
    '1' => [
        "title1" => "Γιατί θα πρέπει να εισάγεις τον προγραμματισμό στην τάξη σου;",
        "title2" => "Πώς μπορεί ο προγραμματισμός να βοηθήσει τους μαθητές σου; Τι όφελος μπορεί να έχεις εσύ ως εκπαιδευτικός;",
        "content" => [
            "Πιστεύουμε ότι ο βασικός γραμματισμός όλων σε μια ψηφιακή εποχή πρέπει να περιλαμβάνει την κατανόηση του προγραμματισμού και την ανάπτυξη καίριων ικανοτήτων που σχετίζονται με την υπολογιστική σκέψη, όπως είναι η επίλυση προβλημάτων, η συνεργασία και οι δεξιότητες ανάλυσης.",
            "Η εκμάθηση της συγγραφής κώδικα μπορεί να δώσει ώθηση στους μαθητές σου έτσι ώστε να βρεθούν στο προσκήνιο μιας κοινωνίας ψηφιακών ικανοτήτων, να κατανοήσουν καλύτερα τον κόσμο που τους περιβάλλει και να έχουν περισσότερες ευκαιρίες επιτυχίας στην προσωπική και επαγγελματική ζωή τους.",
            "Η Εβδομάδα Προγραμματισμού προσφέρει σε όλους τους μαθητές τη δυνατότητα να κάνουν τα πρώτα τους βήματα ως δημιουργοί ψηφιακού περιεχομένου, παρέχοντας δωρεάν σε σχολεία και δασκάλους ευκαιρίες επαγγελματικής ανάπτυξης, εκπαιδευτικό υλικό, διεθνείς προκλήσεις και ευκαιρίες ανταλλαγών."
        ],
        "button" => [
            "label" => "Θέλεις να ξεκινήσεις αμέσως; Εγγράψου εδώ!",
        ]
    ],
    '2' => [
        "title1" => "Έτοιμος/η να δηλώσεις συμμετοχή;",
        "title2" => "Διοργάνωσε ένα μάθημα, ένα σεμινάριο κατάρτισης ή μια εκδήλωση, και καρφίτσωσέ την στον χάρτη.",
        "content" => [
            "Είτε έχεις γνώσεις στη συγγραφή κώδικα ή στον προγραμματισμό είτε όχι, μπορείς εύκολα να διοργανώσεις ένα μάθημα στην τάξη σου, μια ημέρα γνωριμίας ή μια εκδήλωση στο σχολείο σου. Απλώς βρες μια ημερομηνία και καταχώρισε τη δραστηριότητά σου στον παρακάτω χάρτη. Αν πιστεύεις ότι χρειάζεσαι υποστήριξη για την προετοιμασία ενός μαθήματος προγραμματισμού, προχώρησε απευθείας στην επόμενη ενότητα.",
            "Δες ορισμένα παραδείγματα δραστηριοτήτων που διοργανώνονται κάνοντας περιήγηση στον παρακάτω χάρτη και προσθέστε τις δικές σας δραστηριότητες ακολουθώντας το παράδειγμα χιλιάδων άλλων συναδέλφων εκπαιδευτών σε όλη την Ευρώπη και τον κόσμο:"

        ],
        "button" => [
            "label" => "Έτοιμος/η να το προσπαθήσεις; Πρόσθεσε μια δραστηριότητα!",
        ]

    ], '3' => [

        "title1" => "Δεν έχεις εμπειρία στον προγραμματισμό; Μην ανησυχείς",
        "title2" => "Τα εργαλεία μας σε βοηθούν να μυηθείς στον προγραμματισμό πριν τον μεταδόσεις στους μαθητές σου",
        "content" => [
            "Αν επιθυμείς να εισάγεις τον προγραμματισμό στο μάθημά σου αλλά δεν ξέρεις από πού να αρχίσεις, μην ανησυχείς! Μια διεθνής ομάδα εκπαιδευτικών και ειδικών έχουν αναπτύξει μια σειρά από σύντομες ηλεκτρονικές εκπαιδευτικές ενότητες για να σε βοηθήσουν να ξεκινήσεις.",
            "Δεν απαιτείται προηγούμενη εμπειρία στον προγραμματισμό για να παρακολουθήσεις τα εκπαιδευτικά προγράμματά μας!"

        ],
        "button" => [
            "label" => "Πρόσβαση στις εκπαιδευτικές ενότητες",
        ]
    ], '4' => [

        "title1" => "Θέλεις να δοκιμάσεις μια ακόμα πρόκληση;",
        "title2" => "Δημιούργησε ένα δίκτυο δραστηριοτήτων, συμπερίλαβε όσο περισσότερους μαθητές γίνεται, και κέρδισε το Πιστοποιητικό Αριστείας",
        "content" => [
            "Οι προκλήσεις Code Week 4 All σε καλούν να ενώσεις τις δυνάμεις σου με άλλους εκπαιδευτικούς ή άλλα σχολεία και να συμμετέχεις σε μια διεθνή κοινότητα ατόμων με παρόμοιο τρόπο σκέψης, δίνοντας την ευκαιρία στους μαθητές να κάνουν τα πρώτα τους βήματα στον προγραμματισμό. Δημιούργησε μια συμμαχία που να περιλαμβάνει πάνω από 1 000 μαθητές και θα κερδίσεις το Πιστοποιητικό Αριστείας.",

        ],
        "button" => [
            "label" => "Μάθε περισσότερα για την πρόκληση Code Week 4 All",
        ]
    ],


];
