<?php

return [
    'featured-activities' => 'Εδώ θα βρείτε τις προσεχείς προτεινόμενες δραστηριότητες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού που υποδέχονται τους διαδικτυακούς συμμετέχοντες. Μπορείτε να φιλτράρετε ανά γλώσσα και ανά μήνα και, κάνοντας κλικ στο κουμπί «Προβολή», θα έχετε πρόσβαση σε όλα τα λεπτομερή στοιχεία σχετικά με τη δραστηριότητα και τα στοιχεία επικοινωνίας των διοργανωτών. Καλή διασκέδαση!',
    'learn' => 'Η συγγραφή κώδικα και ο προγραμματισμός είναι βασικές ικανότητες με όλο και μεγαλύτερη ζήτηση σε κάθε τομέα, και η Ευρωπαϊκή Εβδομάδα Προγραμματισμού θέλει να σας στηρίξει στην εκμάθηση αυτών των ικανοτήτων! Φυλλομετρήστε το αποθετήριό μας και βρείτε τον τέλειο πόρο για να ξεκινήσετε ή να συνεχίσετε το ταξίδι προγραμματισμού. Όλοι αυτοί οι πόροι διατίθενται δωρεάν. Μην ξεχνάτε ότι μπορείτε να φιλτράρετε την αναζήτησή σας ανά είδος πόρου, επίπεδο δεξιοτήτων, γλώσσα προγραμματισμού, κατηγορία και γλώσσα.',
    'teach' => 'Η συγγραφή κώδικα και ο προγραμματισμός είναι βασικές ικανότητες που θα προσφέρουν νέες δυνατότητες στους μαθητές και στα παιδιά σας. Θέλετε να διδάξετε προγραμματισμό στο σπίτι, στην τάξη ή σε λέσχη προγραμματισμού; Φυλλομετρήστε το αποθετήριο μας για να βρείτε τον καταλληλότερο πόρο για να εντάξετε τη συγγραφή κώδικα και τον προγραμματισμό στην πρακτική διδασκαλίας σας. Όλοι αυτοί οι πόροι διατίθενται δωρεάν. Μην ξεχνάτε ότι μπορείτε να φιλτράρετε την αναζήτησή σας ανά είδος πόρου, επίπεδο δεξιοτήτων, γλώσσα προγραμματισμού, θέμα, κατηγορία και γλώσσα.',
    'toolkits' => [
        'Στην ενότητα αυτή θα βρείτε υλικό που θα σας βοηθήσει να οργανώσετε τη δραστηριότητά σας στο πλαίσιο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και να προωθήσετε την πρωτοβουλία στην κοινότητά σας.',
        'Εργαλειοθήκη επικοινωνίας',
        'εδώ θα βρείτε τα επίσημα λογότυπα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, το σήμα, το φυλλάδιο, την αφίσα, τα πρότυπα PowerPoint και Word, παραδείγματα δημοσιεύσεων στα μέσα κοινωνικής δικτύωσης και εικόνες.',
        'Εργαλειοθήκη δασκάλων',
        'εδώ θα βρείτε τα επίσημα λογότυπα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, το σήμα, το υπόδειγμα πιστοποιητικού συμμετοχής για τους μαθητές σας, μια εισαγωγική παρουσίαση για την Ευρωπαϊκή Εβδομάδα Προγραμματισμού και υλικό για τα μέσα κοινωνικής δικτύωσης.',
        'Επίσημο φυλλάδιο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού.',
    ],
    'about' => [
        'goal' => 'Στόχος είναι να βοηθήσουμε περισσότερους νέους να εξοικειωθούν με τις βασικές έννοιες του προγραμματισμού και της υπολογιστικής σκέψης.',
    ],
    'guide' => [
        'tutorials' => [
            '1' => 'Ρίξτε μια ματιά στα',
            '2' => 'εκπαιδευτικά μας βοηθήματα και προγράμματα',
            '3' => 'που είναι διαθέσιμα σε 29 γλώσσες, τα οποία θα σας προετοιμάσουν για να οργανώσετε δραστηριότητες που θα διδάξουν στους νέους προγραμματισμό και υπολογιστική σκέψη.',
        ],
    ],
    'dance' => [
        'menu' => 'Χορευτική πρόκληση',
        'subtitle' => 'Ποιος είπε ότι οι προγραμματιστές δεν χορεύουν; Εμείς θα αποδείξουμε το αντίθετο με την πρόκληση #EUCodeWeekDance.',
        'content' => 'Μπορούν να συμμετάσχουν οι πάντες: σχολεία, δάσκαλοι, βιβλιοθήκες μέχρι λέσχες προγραμματισμού, επιχειρήσεις και δημόσιες αρχές είναι ευπρόσδεκτοι στη γιορτή της Εβδομάδας Προγραμματισμού. Πρέπει απλά να οργανώσουν μια δραστηριότητα #EUCodeWeekDance και να την προσθέσουν στον χάρτη Code Week.',
    ],
    'treasure-hunt' => [
        'menu' => 'Κυνήγι θησαυρού',
        'subtitle' => 'Πρόκειται για ένα παιχνίδι στο Telegram',
    ],

    'videos' => [
        1 => 'Παρακολουθήστε τα βίντεο των πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού σχετικά με τις αξίες μας',
        2 => 'Παρακολουθήστε την Katja Osljak, πρέσβειρα της Σλοβενίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι ανεξάρτητη',
        3 => 'Παρακολουθήστε τον Laurent Touché, πρέσβη της Γαλλίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι για όλους',
        4 => 'Παρακολουθήστε τη Fatma Bouaziz, πρέσβειρα της Τυνησίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι παντοπική',
        5 => 'Παρακολουθήστε τη Linda Sinka, πρέσβειρα της Λετονίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού αφορά τη συνεργασία',
        6 => 'Παρακολουθήστε τον Alessandro Bogliolo, πρέσβη της Ιταλίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού δεν είναι κερδοσκοπική',
        7 => 'Παρακολουθήστε τη Marjana Prifti, πρέσβειρα της Αλβανίας, με θέμα: Γιατί η Εβδομάδα Προγραμματισμού ενθαρρύνει την καινοτομία και τη δημιουργικότητα',
        8 => 'Παρακολουθήστε την Cristiana Lucaci, πρέσβειρα της Ρουμανίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού ευχαριστεί την κοινότητά της',
    ],

    'learn_and_teach_1' => 'Μια αποθήκη πόρων για να ξεκινήσεις ή να συνεχίσεις το ταξίδι σου στον προγραμματισμό και να αναπτύξεις ψηφιακές και τεχνικές δεξιότητες - όλα διαθέσιμα χωρίς κόστος.',
    'learn_and_teach_2' => 'Ο προγραμματισμός και οι βασικές δεξιότητες είναι στοιχειώδης ικανότητες που έχουν όλο και μεγαλύτερη ζήτηση σε κάθε τομέα, και η Ευρωπαϊκή Εβδομάδα Προγραμματισμού θέλει να σε υποστηρίξει στη διδασκαλία και τη μάθησή σου! Περιηγήσου στο αποθετήριο μας και βρες τον τέλειο πόρο για να ξεκινήσεις ή να συνεχίσεις το ταξίδι προγραμματισμού. Όλοι αυτοί οι πόροι είναι δωρεάν. Μην ξεχνάς ότι μπορείς να φιλτράρεις την αναζήτησή σου ανά τίτλο, τύπο πόρου, επίπεδο δεξιοτήτων, γλώσσα προγραμματισμού, θέμα, κατηγορία και γλώσσα.',

];
