<?php

return [

    "about" => [
        "goal" => "Στόχος είναι να βοηθήσουμε περισσότερους νέους να εξοικειωθούν με τις βασικές έννοιες του προγραμματισμού και της υπολογιστικής σκέψης."
    ],
    "guide" => [
        "tutorials" => [
            "1" => "Ρίξτε μια ματιά στα",
            "2" => "εκπαιδευτικά μας βοηθήματα και προγράμματα",
            "3" => "που είναι διαθέσιμα σε 29 γλώσσες, τα οποία θα σας προετοιμάσουν για να οργανώσετε δραστηριότητες που θα διδάξουν στους νέους προγραμματισμό και υπολογιστική σκέψη.",
        ]
    ],
    "dance" => [
        "menu" => "Χορευτική πρόκληση",
        "subtitle" => "Ποιος είπε ότι οι προγραμματιστές δεν χορεύουν; Εμείς θα αποδείξουμε το αντίθετο με την πρόκληση #CodeWeekDance.",
        "content" => "Μπορούν να συμμετάσχουν οι πάντες: σχολεία, δάσκαλοι, βιβλιοθήκες μέχρι λέσχες προγραμματισμού, επιχειρήσεις και δημόσιες αρχές είναι ευπρόσδεκτοι στη γιορτή της Εβδομάδας Προγραμματισμού. Πρέπει απλά να οργανώσουν μια δραστηριότητα #CodeWeekDance και να την προσθέσουν στον χάρτη Code Week."
    ],
    "treasure-hunt" => [
        "menu" => "Κυνήγι θησαυρού",
        "subtitle" => "Πρόκειται για ένα παιχνίδι στο Telegram",
    ],


    "videos" => [
        1 => "Παρακολουθήστε τα βίντεο των πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού σχετικά με τις αξίες μας",
        2 => "Παρακολουθήστε την Katja Osljak, πρέσβειρα της Σλοβενίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι ανεξάρτητη",
        3 => "Παρακολουθήστε τον Laurent Touché, πρέσβη της Γαλλίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι για όλους",
        4 => "Παρακολουθήστε τη Fatma Bouaziz, πρέσβειρα της Τυνησίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού είναι παντοπική",
        5 => "Παρακολουθήστε τη Linda Sinka, πρέσβειρα της Λετονίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού αφορά τη συνεργασία",
        6 => "Παρακολουθήστε τον Alessandro Bogliolo, πρέσβη της Ιταλίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού δεν είναι κερδοσκοπική",
        7 => "Παρακολουθήστε τη Marjana Prifti, πρέσβειρα της Αλβανίας, με θέμα: Γιατί η Εβδομάδα Προγραμματισμού ενθαρρύνει την καινοτομία και τη δημιουργικότητα",
        8 => "Παρακολουθήστε την Cristiana Lucaci, πρέσβειρα της Ρουμανίας, να εξηγεί γιατί η Εβδομάδα Προγραμματισμού ευχαριστεί την κοινότητά της",
    ]


];