<?php

return [

    'learning_bits' => 'Δωρεάν εκπαιδευτικό υλικό και διαδικτυακά μαθήματα',
    'title' => 'Σκέφτεστε να συμμετάσχετε στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού, αλλά δεν ξέρετε από πού να αρχίσετε;',
    'text' => '<p>Εδώ μπορείτε να βρείτε δωρεάν εκπαιδευτικό υλικό και πόρους που θα σας βοηθήσουν να ξεκινήσετε και να σχεδιάσετε το επόμενο καινοτόμο μάθημά σας.</p>
<h2 class="subtitle">1.	Εκπαιδευτικά προγράμματα</h2>
                    <p>Δεν χρειάζεται προηγούμενη εμπειρία συγγραφής κώδικα ή προγραμματισμού, και κάθε ενότητα θα σας πάρει γύρω στα 15 λεπτά. Οι ενότητες σας μυούν σε βασικές έννοιες που σχετίζονται με δραστηριότητες προγραμματισμού και υπολογιστικής σκέψης. Επίσης, στις ενότητες παρέχονται πρακτικές συμβουλές και υποδείξεις για τον τρόπο παρουσίασης των εννοιών στην τάξη σας.</p>',
    'text_2' => '<p>Τώρα που ολοκληρώσατε ένα ή περισσότερα εκπαιδευτικά προγράμματα της Εβδομάδας Προγραμματισμού, ελπίζουμε ότι νιώθετε την άνεση να εισαγάγετε λίγη ψηφιακή δημιουργικότητα στην τάξη σας και να "καρφιτσώσετε" τη δραστηριότητά σας στον <a href="/events">χάρτη της Εβδομάδας Προγραμματισμού</a>!</p>

                    <p>Μπορείτε εύκολα να διοργανώσετε ένα μάθημα στην τάξη σας, μια ημέρα γνωριμίας ή μια εκδήλωση στο σχολείο σας. Απλώς βρείτε μια ημερομηνία και καταχωρίστε τη δραστηριότητά σας στον <a href="/events">χάρτη της Εβδομάδα Προγραμματισμού</a>. Κάθε διοργανωτής δραστηριότητας θα λάβει πιστοποιητικό συμμετοχής για την προσπάθεια του.</p>

                    <p>Αν θέλετε να επικοινωνείτε με μια διεθνή ομάδα δασκάλων που διαπνέεται από ενθουσιασμό, εγγραφείτε στην <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">ομάδα για δασκάλους της Ευρωπαϊκής Εβδομάδας Προγραμματισμού στο Facebook</a>! Αν θέλετε να κάνετε ένα παραπάνω βήμα και να συνεργαστείτε με άλλα σχολεία της χώρας σας ή και πέρα από τα σύνορα της χώρας σας, δηλώστε συμμετοχή στην <a href="/codeweek4all">πρόκληση Code Week 4 All</a>.</p>',
    'lessons' => [
        '1' => [
            'title' => 'Προγραμματισμός χωρίς ψηφιακή τεχνολογία (χωρίς σύνδεση στο διαδίκτυο)',
            'author' => 'του Alessandro Bogliolo',
            'text' => '<p>Ο προγραμματισμός είναι η γλώσσα των πραγμάτων που μας επιτρέπει να συγγράφουμε προγράμματα ώστε να προσδίδουμε νέες λειτουργικές δυνατότητες σε δεκάδες δισεκατομμύρια προγραμματίσιμων αντικειμένων γύρω μας. Ο προγραμματισμός είναι ο ταχύτερος τρόπος να υλοποιήσουμε τις ιδέες μας και ο αποτελεσματικότερος τρόπος να αναπτύξουμε τις ικανότητες μας σε θέματα υπολογιστικής σκέψης. Ωστόσο, η τεχνολογία δεν είναι απολύτως απαραίτητη για την ανάπτυξη της υπολογιστικής σκέψης. Αντιθέτως, οι δικές μας δεξιότητες υπολογιστικής σκέψης είναι ουσιαστικής σημασίας προκειμένου να λειτουργήσει η τεχνολογία.</p>

                    <p>Σε αυτό το βίντεο ο Alessandro Bogliolo, καθηγητής συστημάτων πληροφορικής στην Ιταλία και συντονιστής της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, παρουσιάζει δραστηριότητες προγραμματισμού εκτός διαδικτύου, στις οποίες μπορεί κανείς να εξασκηθεί χωρίς καμία ηλεκτρονική συσκευή. Ο βασικός σκοπός των δραστηριοτήτων χωρίς σύνδεση στο διαδίκτυο είναι να υποβαθμιστούν οι φραγμοί πρόσβασης, ώστε ο προγραμματισμός να εισέλθει σε κάθε σχολείο, ανεξαρτήτως από τη διαθέσιμη χρηματοδότηση κι εξοπλισμό.</p>

                    <p>Οι δραστηριότητες προγραμματισμού χωρίς σύνδεση στο διαδίκτυο αποκαλύπτουν πλευρές της υπολογιστικής λογικής του φυσικού κόσμου που μας περιβάλλει.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 – CodyRoby για το Δημοτικό',
                '2' => 'Δραστηριότητα 2 – CodyRoby για το Γυμνάσιο',
                '3' => 'Δραστηριότητα 3 – CodyRoby για το Λύκειο'
            ]
        ],
        '2' => [
            'title' => 'Υπολογιστική σκέψη και επίλυση προβλημάτων',
            'author' => 'του Miles Berry',
            'text' => '<p>Η υπολογιστική σκέψη περιγράφει έναν τρόπο εξέτασης των προβλημάτων και των συστημάτων ώστε να μπορεί να χρησιμοποιείται υπολογιστής για να μας βοηθάει να τα επιλύουμε ή να τα κατανοούμε. Η υπολογιστική σκέψη δεν είναι θεμελιώδης μόνο για την ανάπτυξη των προγραμμάτων υπολογιστών, αλλά μπορεί επίσης να χρησιμοποιείται για την υποβοήθηση της επίλυσης προβλημάτων σε όλους τους κλάδους.</p>

                    <p>Μπορείτε να διδάξετε την υπολογιστική σκέψη στους μαθητές σας βάζοντάς τους να κατατμήσουν περίπλοκα προβλήματα σε μικρότερα (αποσύνθεση), να αναγνωρίσουν επαναλαμβανόμενες μορφές (αναγνώριση μορφών), να εντοπίσουν τις λεπτομέρειες που είναι καίριες για την επίλυση ενός προβλήματος (αφαίρεση)· ή ορίζοντας τους κανόνες ή τις εντολές που πρέπει να ακολουθηθούν προκειμένου να επιτευχθεί το επιθυμητό αποτέλεσμα (σχεδιασμός αλγόριθμου). Η υπολογιστική σκέψη μπορεί να διδαχθεί μέσα από διάφορα μαθήματα, για παράδειγμα τα μαθηματικά (να καταλάβουν τους κανόνες για την παραγώγιση πολυώνυμων 2ης τάξης), τη λογοτεχνία (να κατατμήσουν την ανάλυση ενός ποιήματος σε ανάλυση μέτρου, ρυθμού και δομής), τις γλώσσες (να βρουν μορφές στα καταληκτικά γράμματα ενός ρήματος που επηρεάζουν την ορθογραφία όταν αλλάζει ο χρόνος), και πολλά άλλα.</p>

                    <p>Σε αυτό το βίντεο, ο Miles Berry, Τακτικός Λέκτορας στο Πανεπιστήμιο του Roehampton στην Παιδαγωγική σχολή του Guildford (Ηνωμένο Βασίλειο), παρουσιάζει την έννοια της υπολογιστικής σκέψης και τους διάφορους τρόπους με τους οποίος ένας δάσκαλος μπορεί να την ενσωματώσει στην τάξη με απλά παιχνίδια.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 – Ανάπτυξη της λογικής των μαθηματικών για το Δημοτικό',
                '2' => 'Δραστηριότητα 2 – Γνωριμία με τους αλγόριθμους για το Γυμνάσιο',
                '3' => 'Δραστηριότητα 3 – Αλγόριθμοι για το Λύκειο'
            ]
        ],
        '3' => [
            'title' => 'Οπτικός προγραμματισμός – Εισαγωγή στη Scratch',
            'author' => 'του Margo Tinawi',
            'text' => '<p>Ο οπτικός προγραμματισμός δίνει στους ανθρώπους τη δυνατότητα να περιγράψουν διαδικασίες χρησιμοποιώντας εικονογραφήσεις ή γραφήματα. Συνήθως μιλάμε για οπτικό προγραμματισμό σε αντιπαράθεση με τον προγραμματισμό που βασίζεται σε κείμενο. Οι γλώσσες οπτικού προγραμματισμού (VPLs) ενδείκνυνται ιδιαιτέρως για την παρουσίαση της αλγοριθμικής σκέψης σε παιδιά (αλλά ακόμη και σε ενήλικες). Με τις VPLs υπάρχουν λιγότερα στοιχεία να διάβασμα και δεν υπάρχει θέμα συντακτικού.</p>

                    <p>Σε αυτό το βίντεο, η Margo Tinawi, δασκάλα ανάπτυξης ιστού στο Le Wagon και συνιδρύτρια του Techies Lab asbl (Βέλγιο), θα σας βοηθήσει να ανακαλύψετε τη Scratch, μία από τις πιο δημοφιλείς VPL που χρησιμοποιούνται παγκοσμίως. Η Scratch αναπτύχθηκε από το MIT το 2002, και έκτοτε έχει δημιουργηθεί ευρεία κοινότητα γύρω της, όπου μπορεί κανείς να βρει εκατομμύρια έργων να αντιγράψει με τους μαθητές του και αμέτρητα μαθήματα σε αρκετές γλώσσες.</p>

                    <p>Δεν χρειάζεται να διαθέτετε εμπειρία στον προγραμματισμό για να χρησιμοποιήσετε τη Scratch, και μπορείτε να τη χρησιμοποιήσετε σε όλα τα μαθήματα! Για παράδειγμα, αν χρησιμοποιήσετε τη Scratch ως ψηφιακό εργαλείο αφήγησης ιστοριών, οι μαθητές μπορούν να δημιουργήσουν ιστορίες, να εικονογραφήσουν ένα πρόβλημα μαθηματικών ή να διαδραματίσουν παίζοντας έναν διαγωνισμό τέχνης ώστε να μάθουν περισσότερα για την πολιτιστική κληρονομιά και την υπολογιστική σκέψη, και πάνω από όλα, να διασκεδάσουν.</p>

                    <p>Η Scratch είναι δωρεάν εργαλείο, πολύ εύληπτο και ενδιαφέρον για τους μαθητές σας. Ρίξτε μια ματιά στο βίντεο της Margo για να μάθετε πώς να ξεκινήσετε.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 – Τα βασικά της Scratch για το Δημοτικό',
                '2' => 'Δραστηριότητα 2 – Τα βασικά της Scratch για το Γυμνάσιο',
                '3' => 'Δραστηριότητα 3 – Τα βασικά της Scratch για το Λύκειο'
            ]
        ],
        '4' => [
            'title' => 'Δημιουργία εκπαιδευτικών παιχνιδιών με Scratch',
            'author' => 'του Jesús Moreno León',
            'text' => '<p>Κριτική σκέψη, επιμονή, επίλυση προβλημάτων, υπολογιστική σκέψη και δημιουργικότητα είναι μόνο λίγες από τις καίριες δεξιότητες που χρειάζονται οι μαθητές σας για να επιτύχουν στον 21ο αιώνα, και η συγγραφή κώδικα μπορεί να βοηθήσει να επιτευχθούν τα παραπάνω με διασκεδαστικό και ενδιαφέροντα τρόπο.</p>

                    <p>Αλγοριθμικές έννοιες ελέγχου ροής που χρησιμοποιούν αλληλουχία εντολών και βρόγχους, απεικόνιση δεδομένων χρησιμοποιώντας μεταβλητές και λίστες ή συγχρονισμός διεργασιών: όλα τα παραπάνω μπορεί να ηχούν περίπλοκα, αλλά σε αυτό το βίντεο θα ανακαλύψετε ότι είναι ευκολότερο να τα μάθετε από όσο φαντάζεστε.</p>

                    <p>Σε αυτό το βίντεο, ο Jesús Moreno León, δάσκαλος της επιστήμης των υπολογιστών και ερευνητής από την Ισπανία, εξηγεί πώς μπορείτε να αναπτύξετε αυτές και άλλες δεξιότητες στους μαθητές σας, ενώ παράλληλα διασκεδάζουν. Πώς μπορεί να γίνει αυτό; Δημιουργώντας ένα παιχνίδι ερωτήσεων-απαντήσεων σε Scratch, στην πιο δημοφιλή γλώσσα προγραμματισμού που χρησιμοποιείται στα σχολεία παγκοσμίως. Η Scratch δεν ενδυναμώνει μόνο την υπολογιστική σκέψη, άλλα επιτρέπει επίσης την εισαγωγή στοιχείων παιχνιδιού στην τάξη ώστε το ενδιαφέρον των μαθητών σας να παραμένει ζωντανό ενώ παράλληλα μαθαίνουν και διασκεδάζουν.</p>

                    <p>Ρίξτε μια ματιά στο βίντεο για να μάθετε πώς να ξεκινήσετε:</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 - Παιχνίδι ερωτήσεων και απαντήσεων με Scratch για το Δημοτικό',
                '2' => 'Δραστηριότητα 2 - Παιχνίδι ερωτήσεων και απαντήσεων με Scratch για το Γυμνάσιο',
                '3' => 'Δραστηριότητα 3 - Παιχνίδι ερωτήσεων και απαντήσεων με Scratch για το Λύκειο'
            ]
        ],
        '5' => [
            'title' => 'Ασχολούμαστε με τη ρομποτική και τα μαστορέματα μέσα στις σχολικές τάξεις',
            'author' => 'της Tullia Urschitz',
            'text' => '<p>Η ενσωμάτωση του προγραμματισμού, του μαστορέματος, της ρομποτικής και της μικροηλεκτρονικής στο σχολικό πρόγραμμα ως εργαλείων διδασκαλίας και μάθησης είναι το κλειδί για την εκπαίδευση του 21ου αιώνα.</p>

                    <p>Η χρήση του μαστορέματος και της ρομποτικής στα σχολεία προσφέρει πολλά οφέλη στους μαθητές, καθώς βοηθάει στην ανάπτυξη κρίσιμων δεξιοτήτων, όπως είναι η επίλυση προβλημάτων, η ομαδική εργασία και η συνεργασία. Επίσης, τονώνει τη δημιουργικότητα και την αυτοπεποίθηση των μαθητών και μπορεί να βοηθήσει τους μαθητές να αναπτύξουν την επιμονή και την αποφασιστικότητά τους απέναντι σε προκλήσεις. Η ρομποτική είναι επίσης ένα πεδίο το οποίο προάγει τον μη αποκλεισμό, καθώς είναι εύκολα προσβάσιμη για ευρύ φάσμα μαθητών με διάφορα ταλέντα και δεξιότητες (τόσο αγόρια όσο και κορίτσια) και έχει θετική επίδραση στους μαθητές στο φάσμα του αυτισμού.</p>

                    <p>Ρίξτε μια ματιά σε αυτό το βίντεο όπου η Tullia Urschitz, πρέσβης της Ιταλίας για το Scientix και δασκάλα θετικών επιστημών, τεχνολογίας, μηχανικής και μαθηματικών στο Sant’Ambrogio Di Valpolicella, στην Ιταλία, δίνει ορισμένα πρακτικά παραδείγματα για το πώς οι δάσκαλοι μπορούν να εισαγάγουν το μαστόρεμα και τη ρομποτική στην τάξη, μεταμορφώνοντας έτσι παθητικούς μαθητές σε ενθουσιώδεις κατασκευαστές.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 - Πώς να κατασκευάσετε ένα μηχανικό χέρι από χαρτόνι στο Δημοτικό',
                '2' => 'Δραστηριότητα 2 - Πώς να κατασκευάσετε ένα μηχανικό ή ρομποτικό χέρι στο Γυμνάσιο',
                '3' => 'Δραστηριότητα 3 - Πώς να κατασκευάσετε ένα μηχανικό ή ρομποτικό χέρι στο Λύκειο'
            ]
        ],
        '6' => [
            'title' => 'Ανάπτυξη εφαρμογών με το App Inventor',
            'author' => 'της Rosanna Kurrer',
            'text' => '<p>Ρίξτε μια ματιά σε αυτό το βίντεο, στο οποίο η Rosanna Kurrer (ιδρύτρια του CyberWayFinder) εξηγεί τι είναι το App Inventor, παρουσιάζει τα πλεονεκτήματα της ανάπτυξης εφαρμογών στην τάξη και παραθέτει ορισμένα πρακτικά παραδείγματα για το πώς οι εκπαιδευτικοί μπορούν να ενσωματώσουν το App Inventor στην τάξη, μετατρέποντας τους μαθητές από παθητικούς ακροατές σε ενθουσιώδεις δημιουργούς παιχνιδιών.</p>
<p>Όλοι χρησιμοποιούμε εφαρμογές, καθώς μας επιτρέπουν να συντονίζουμε τις δραστηριότητές μας εύκολα και γρήγορα. Οι εφαρμογές χρησιμοποιούνται ολοένα και περισσότερο και στην εκπαίδευση, καθώς καθιστούν δυνατή την εξατομικευμένη μάθηση και επιτρέπουν στους χρήστες να αντλούν πληροφορίες. Γιατί λοιπόν να μην δώσουμε στους μαθητές τη δυνατότητα να δημιουργήσουν μια εκπαιδευτική εφαρμογή για τους άλλους;</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 – Τίτλος, για το δημοτικό',
                '2' => 'Δραστηριότητα 2 – Τίτλος, για το γυμνάσιο',
                '3' => 'Δραστηριότητα 3 – Τίτλος, για το λύκειο'
            ]
        ],
        '7' => [
            'title' => 'Χειροτεχνίες και κατασκευές',
            'author' => 'του Diogo da Silva',
            'text' => '<p>Ο κόσμος της εργασίας αλλάζει και η εκπαίδευση πρέπει κι αυτή να ακολουθήσει τις εξελίξεις. Κατά την προετοιμασία των μαθητών για τις σταδιοδρομίες του 21ου αιώνα, αποκτούν μεγάλη σημασία νέες δεξιότητες, όπως η χειροτεχνία, οι κατασκευές ή η εφευρετικότητα, , καθώς γεφυρώνουν το χάσμα μεταξύ του σχολείου και πραγματικότητας. Με τον μετασχηματισμό της τάξης σε ένα περιβάλλον συνεργασίας που επικεντρώνεται στην επίλυση προβλημάτων, οι μαθητές έχουν την ευκαιρία να συμμετάσχουν ενεργά και να αναπτύξουν τις ικανότητές τους. Οι δραστηριότητες αυτές προωθούν τον διάλογο και μετατρέπουν την τάξη σε έναν κόμβο επικοινωνίας, όπου οι συμβολή του κάθε μαθητή είναι σημαντική.</p> 
<p>Ρίξτε μια ματιά στο παρακάτω βίντεο, στο οποίο ο Diogo da Silva, καθηγητής ΕΤΜΤΜ (επιστήμη, τεχνολογία, μηχανική, τέχνη, μαθηματικά) από την Πορτογαλία και μέλος της Escola Global, εξηγεί βήμα προς βήμα πώς μπορούμε να σχεδιάσουμε ένα μάθημα στο οποίο οι μαθητές βρίσκουν τις λύσεις μέσα από χειροτεχνίες, κατασκευές και αξιοποίηση της εφευρετικότητάς τους.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 – Τίτλος, για το δημοτικό',
                '2' => 'Δραστηριότητα 2 – Τίτλος, για το γυμνάσιο',
                '3' => 'Δραστηριότητα 3 – Τίτλος, για το λύκειο'
            ]
        ],
        '8' => [
            'title' => 'Προγραμματισμός για όλα τα μαθήματα',
            'author' => 'Από τους Μ. Isabel Blanco, Μ. Concepción Fernández, Elisabetta Nanni, Debora Carmela Niutta, Stefania Altieri',
            'text' => '<p>Όταν σκεφτόμαστε τον προγραμματισμό στο σχολείο, το μυαλό μας πάει σε μαθήματα όπως η πληροφορική, η τεχνολογία, τα μαθηματικά ή οι φυσικές επιστήμες. Ωστόσο, γιατί να μην αξιοποιήσουμε την πληθώρα των μαθημάτων και των ενδιαφερόντων των μαθητών προκειμένου να εντάξουμε τον προγραμματισμό σε ολόκληρο το πρόγραμμα σπουδών;</p>  
<p>Η ένταξη του προγραμματισμού στο μάθημα έχει πολλαπλά οφέλη, καθώς βοηθάει τους μαθητές να αναπτύξουν κριτική σκέψη και δεξιότητες επίλυσης προβλημάτων, να γίνουν ενεργοί χρήστες και να καθοδηγήσουν οι ίδιοι την εκπαιδευτική διαδικασία. Όλα αυτά είναι ουσιαστικής σημασίας στο σχολείο. Ωστόσο, το πιο σημαντικό είναι ότι οι μαθητές μαθαίνουν διασκεδάζοντας!</p>
<p>Οι γλώσσες, η μουσική, τα μαθήματα ΕΤΜΜ (επιστήμες, τεχνολογία, μηχανική και μαθηματικά) είναι μόνο μερικά από τα μαθήματα στα οποία οι εκπαιδευτικοί μπορούν να αξιοποιήσουν τον προγραμματισμό προς όφελος των μελλοντικών επιστημόνων, μουσικών, καλλιτεχνών, αλλά και του κάθε μαθητή! Όλοι οι εκπαιδευτικοί μπορούν να ενσωματώσουν τον προγραμματισμό και την υπολογιστική σκέψη στην τάξη. Μπορείτε για παράδειγμα να χρησιμοποιήσετε ένα μάθημα ΟΕΠΓ (ολοκληρωµένη εκµάθηση περιεχοµένου και γλώσσας) για να εξηγήσετε έναν αλγόριθμο της καθημερινής ζωής στην τάξη , να δημιουργήσετε ένα χειριστήριο από τσόχα για να διδάξετε φυσικές επιστήμες ή να χρησιμοποιήσετε εκπαιδευτικά ρομπότ για να κάνετε τους μαθητές να ενδιαφερθούν για τα μαθηματικά.</p> 
<p>Ρίξτε μια ματιά στο παρακάτω βίντεο για να δείτε πώς οι καθηγητές μουσικής, φυσικής ή γλωσσών μπορούν εύκολα να ενσωματώσουν τον προγραμματισμό και την υπολογιστική σκέψη στην τάξη, ακόμα κι αν δεν έχουν προηγούμενη σχετική εμπειρία.</p>',
            'activities' => [
                '1' => 'Δραστηριότητα 1 Ένταξη μέσω της ρομποτικής σε μαθήματα ETMM του δημοτικού',
                '2' => 'Δραστηριότητα 2 Η μουσική είναι προγραμματισμός',
                '3' => 'Δραστηριότητα 3 Χειροτεχνίες και προγραμματισμός με το Makey Makey',
                '4' => 'Δραστηριότητα 4 Ένας αλγόριθμος από την καθημερινή ζωή για ένα μάθημα ΟΕΠΓ'
            ]
        ],
        '9' => [
            'title' => 'Δημιουργήστε ένα αυτόματο με ένα micro:bit',
            'author' => 'της Pauline Maas',
            'text' => '<p>
                   Το Micro: bit, ο εύκολα προγραμματιζόμενος υπολογιστής τσέπης, μπορεί να είναι ένας διασκεδαστικός και εύκολος τρόπος να φτιάξετε ενδιαφέρουσες δημιουργίες, από ρομπότ έως μουσικά όργανα, με τους μαθητές σας, ενώ παράλληλα θα τους διδάσκετε πώς να φτιάχνουν κώδικα. Είναι απλό και εύκολο στη χρήση ακόμα και για τους νεότερους προγραμματιστές, ενώ ταυτόχρονα είναι αρκετά ισχυρό για πιο προχωρημένους μαθητές. Μπορείτε να το ενσωματώσετε σε διάφορα μαθήματα, από την ιστορία μέχρι τα μαθηματικά, ακόμη και τη φυσική. Οι δυνατότητες είναι ατελείωτες. Το Micro: bit είναι ένας συναρπαστικός και οικονομικός τρόπος για να διδάξετε στους μαθητές τον προγραμματισμό, καλλιεργώντας ταυτόχρονα καίριες δεξιότητες όπως η υπολογιστική σκέψη, η επίλυση προβλημάτων και η δημιουργικότητα.
                   </p>
                   <p>
                   Σε αυτό το βίντεο, η Pauline Maas, καθηγήτρια πληροφορικής στο Koninklijke Visio, θα παρουσιάσει το Micro: bit και θα δώσει μερικά πρακτικά παραδείγματα για το πώς οι εκπαιδευτικοί μπορούν να το ενσωματώσουν στην τάξη, μετατρέποντας τους παθητικούς μαθητές σε ενθουσιώδεις δημιουργούς.
                </p>',
            'activities' => [
                '1' => 'Κώδικας Μορς με το micro: bit, για το Δημοτικό',
                '2' => 'Δωμάτιο διαφυγής με το micro: bit, για το Γυμνάσιο',
                '3' => 'Δημιουργία αυτόματου, για το Λύκειο',
            ]
        ],
        '10' => [
            'title' => 'Δημιουργικός προγραμματισμός με το Python',
            'author' => 'της Ivana Vezjak',
            'text' => '<p>
Η μετάβαση από οπτικό προγραμματισμό σε προγραμματισμό με βάση το κείμενο αποτελεί φυσική εξέλιξη στην κωδικοποίηση. Αν και ο οπτικός προγραμματισμός είναι συχνά ιδανικός για αρχάριους, ύστερα από λίγο, οι μαθητές ενδέχεται να ζητήσουν μια νέα πρόκληση. Ο προγραμματισμός με βάση το κείμενο είναι το επόμενο βήμα για όποιον επιθυμεί να εντρυφήσει περισσότερο στον προγραμματισμό και την υπολογιστική σκέψη. 
                   </p>
                   <p>                   
Στο βίντεο αυτό, η Ivana Vezjak σας παρουσιάζει τη βασική σύνταξη του Python. Το Python είναι μία από τις πιο δημοφιλείς γλώσσες προγραμματισμού σήμερα, που χρησιμοποιείται σε πολλούς τομείς, όπως η επιστήμη δεδομένων, η τεχνητή νοημοσύνη, η εκμάθηση μηχανής, η ανάπτυξη ιστού κλπ. Ενώ το Python είναι μια ισχυρή γλώσσα προγραμματισμού που χρησιμοποιείται από έμπειρους προγραμματιστές, μπορεί να χρησιμοποιηθεί ακόμα και από εκείνους που δεν έχουν εμπειρία στην κωδικοποίηση λόγω της απλότητας και της ξεκάθαρης σύνταξής του.                    
</p>
<p> 
Με το Python, οι μαθητές μπορούν να δημιουργήσουν παιχνίδια ερωτήσεων για ιστορικά γεγονότα, να λύσουν μαθηματικά προβλήματα και να κάνουν προσομοιώσεις φυσικής, να δημιουργήσουν παιχνίδια, να φτιάξουν ιστότοπους, να διεξαγάγουν ανάλυση δεδομένων για επιστημονικά έργα και πολλά άλλα. Το Python διαθέτει μια πλούσια και εκτεταμένη τυποποιημένη βιβλιοθήκη, μια μεγάλη κοινότητα και ένα μεγάλο αριθμό εκπαιδευτικού υλικού και έργων που διατίθενται στο διαδίκτυο, τα οποία μπορούν να χρησιμοποιηθούν για διδασκαλία, εκμάθηση και εξάσκηση. Με τον προγραμματισμό σε Python, την ανάλυση προγραμμάτων και την επιδιόρθωση σφαλμάτων προγραμματισμού, οι μαθητές αναπτύσσουν τη δημιουργικότητά τους και μαθαίνουν πώς να είναι συνεπείς, επίμονοι και υπομονετικοί. Αποκτούν δεξιότητες αναλυτικής σκέψης και επίλυσης προβλημάτων, διασπώντας σύνθετα προβλήματα σε μικρότερα κομμάτια. Αυτές οι ικανότητες θα τους βοηθήσουν στον τρόπο προσέγγισης των προβλημάτων σε κάθε άλλη πτυχή της ζωής τους.
                </p>',
            'activities' => [
                '1' => 'Το πρώτο μου παιχνίδι ερωτήσεων, για το Δημοτικό',
                '2' => 'Κρεμάλα, για το Γυμνάσιο',
                '3' => 'Μάντεψε τη σημαία!, για το Λύκειο',
            ],
            'links' => [
                'title' => 'Άλλες σχετικές πηγές',
                '1' => [
                    "url" => "https://docs.python.org/3/library/",
                    "title" => "•	Τυποποιημένη βιβλιοθήκη Python",
                    "description" => "Συλλογή έτοιμων κωδίκων και λειτουργικών μονάδων (π.χ. λειτουργική μονάδα turtle, λειτουργική μονάδα math κ.λπ.).",
                ],
                '2' => [
                    "url" => "https://codecombat.com/",
                    "title" => "CodeCombat",
                    "description" => "Εκπαιδευτικό βιντεοπαιχνίδι για έννοιες εκμάθησης προγραμματισμού.",
                ],
                '3' => [
                    "url" => "https://projects.raspberrypi.org/el-GR/codeclub",
                    "title" => "Έργα CodeClub",
                    "description" => "Από αρχάριους μέχρι προχωρημένους, έργα προγραμματισμού βήμα-βήμα για παιδιά.",
                ],
                '4' => [
                    "url" => "https://inventwithpython.com/invent4thed/",
                    "title" => "Επινόησε τα δικά σου παιχνίδια στον υπολογιστή με το Python",
                    "description" => "Βιβλίο που θα σου μάθει πώς να προγραμματίσεις τα δικά σου παιχνίδια στον υπολογιστή με το Python.",
                ],
                '5' => [
                    "url" => "https://www.codewars.com/",
                    "title" => "CodeWars",
                    "description" => "Εκπαιδευτική κοινότητα όπου μαθητές και καθηγητές μπορούν να εκπαιδεύονται μέσω μιας σειράς προκλήσεων.",
                ],
                '6' => [
                    "url" => "https://hourofpython.com/",
                    "title" => "Η ώρα του Python",
                    "description" => "Συλλογή εισαγωγικών μαθημάτων για το Python (τόσο με βάση το κείμενο όσο και με μπλοκ εντολών) με τη χρήση διαδραστικών Trinket.",
                ],
            ]
        ],
        '11' => [
            'title' => 'Προγραμματισμός για την Ένταξη',
            'author' => 'από την ομάδα της Εβδομάδας Προγραμματισμού',
            'text' => '<p>
                   Η εισαγωγή του προγραμματισμού στην τάξη σας μπορεί να είναι μια πρόκληση, ειδικά αν έχετε μαθητές με συγκεκριμένες αναπηρίες στην τάξη σας. Αλλά είναι σημαντικό να θυμόμαστε ότι ο καθένας, ανεξάρτητα από τις ικανότητές του, μπορεί να μάθει πώς να συγγράφει κώδικα. Τα παιδιά με ειδικές ανάγκες μπορούν να επωφεληθούν σε μεγάλο βαθμό από την εκμάθηση πτυχών του προγραμματισμού, διότι διδάσκει στους μαθητές σημαντικές δεξιότητες ζωής, όπως την επίλυση προβλημάτων, την οργάνωση και την ανεξαρτησία. Ο προγραμματισμός μπορεί επίσης να βελτιώσει τις διαπροσωπικές δεξιότητες και τις κοινωνικές δεξιότητες μέσω της συνεργασίας και της ομαδικής εργασίας, δεξιότητες με τις οποίες δυσκολεύονται πολλά παιδιά με αναπηρίες. Το πιο σημαντικό είναι ότι οι μαθητές διασκεδάζουν μαθαίνοντας μαζί με τους συμμαθητές τους.
                   </p><p>
                   Σε αυτό το βίντεο, η ομάδα της Εβδομάδας Προγραμματισμού θα σας δείξει κάποιες πρακτικές, εύκολες και διασκεδαστικές δραστηριότητες προγραμματισμού που έχουν προσαρμοστεί ειδικά για μαθητές με προβλήματα όρασης, σύνδρομο Ντάουν, καθώς και για μαθητές στο φάσμα του αυτισμού, που οι εκπαιδευτικοί μπορούν εύκολα να εισάγουν στην τάξη τους.
                </p>',
            'activities' => [
                '1' => 'Χάρτινη Αυγοθήκη Χωρίς Σύνδεση',
                '2' => 'Ένα πολύ έξυπνο ποντίκι',
                '3' => 'Ένα αστέρι φτιάχνει αστέρια',
            ]
        ],

        "12" => [
            "title" => "Προγραμματισμός για στόχους βιώσιμης ανάπτυξης",
            "author" => "των Francisco Javier Masero, Cristina Nicolaita και Ervila Koonyi",
            "text" => [
                "1" => "Η παραδοσιακή εκπαίδευση παρέχει στους μαθητές λίγες ευκαιρίες για να κατανοήσουν και να επιλύσουν πραγματικά παγκόσμια προβλήματα όπως η παγκόσμια κλιματική αλλαγή, η ισότητα των φύλων, η πείνα, η φτώχεια ή η καλή υγεία και η ευεξία.",
                "2" => "Οι Στόχοι Βιώσιμης Ανάπτυξης (ΣΒΑ) αποτελούν τον πυρήνα της Ατζέντας 2030 για τη Βιώσιμη Ανάπτυξη, που υιοθετήθηκε από όλα τα κράτη μέλη των Ηνωμένων Εθνών ως χάρτης πορείας για την επίτευξη ειρήνης και ευημερίας στον πλανήτη, ενθαρρύνοντας την παγκόσμια ανάπτυξη. Οι εκπαιδευτικοί μπορούν να χρησιμοποιούν τους ΣΒΑ στην αίθουσα διδασκαλίας ως εργαλείο για την καλλιέργεια της κριτικής τους σκέψης, αλλά και για να τους βοηθήσουν να βρουν την ταυτότητα και τον σκοπό τους. Ο συνδυασμός των βασικών στοιχείων του προγραμματισμού και της υπολογιστικής σκέψης με τους ΣΒΑ θα ενισχύσει την αυτοπεποίθηση των μαθητών σας και θα τους βοηθήσει να αναπτύξουν τη δημιουργικότητά τους, το επιχειρηματικό τους πνεύμα, την ικανότητα επίλυσης προβλημάτων ή τις επικοινωνιακές τους δεξιότητες.",
                "3" => "Στις παρακάτω δραστηριότητες, οι μαθητές θα εφαρμόσουν τις αρχές της γλώσσας προγραμματισμού Scratch, της κωδικοποίησης ASCII και της κωδικοποίησης χωρίς σύνδεση στο διαδίκτυο σε σημερινά θέματα παγκόσμιας και κοινωνικής σημασίας. Οι εκπαιδευτικοί θα ευαισθητοποιήσουν τους μαθητές σχετικά με τους στόχους της βιώσιμης ανάπτυξης, βοηθώντας τους παράλληλα να αναπτύξουν ενσυναίσθηση, ενεργό πολιτότητα και θετική κοινωνική συμπεριφορά με διασκεδαστικό και ενεργό τρόπο.",
                "4" => "Τα εν λόγω σχέδια μαθημάτων επικεντρώνονται το καθένα σε έναν από τους ΣΒΑ:",
                "5" => "Στόχος Βιώσιμης Ανάπτυξης 3: Η εξασφάλιση υγιεινής ζωής και η προώθηση ευημερίας για όλους σε όλες τις ηλικίες",
                "6" => "Στόχος Βιώσιμης Ανάπτυξης 5: Η επίτευξη της ισότητας των φύλων και η εμψύχωση όλων των γυναικών και των κοριτσιών",
                "7" => "Στόχος Βιώσιμης Ανάπτυξης 13: Η ανάληψη επείγουσας δράσης για την καταπολέμηση της κλιματικής αλλαγής και των επιπτώσεών της",
            ],
            "activities" => [
                "1" => "Το έργο Καρατέκα: Γνωριμία με το καράτε μέσα από τον προγραμματισμό, για την πρωτοβάθμια, την κατώτερη και την ανώτερη δευτεροβάθμια εκπαίδευση",
                "2" => "Στόχοι βιώσιμης ανάπτυξης και κωδικοποίηση για την κλιματική αλλαγή, για την πρωτοβάθμια εκπαίδευση",
                "3" => "Κωδικοποίηση για την ισότητα των φύλων, για την ανώτερη δευτεροβάθμια εκπαίδευση",
            ]
        ]
        ,

        "13" => [
            "title" => "Εισαγωγή στην Τεχνητή Νοημοσύνη στη σχολική αίθουσα",
            "author" => "των Artur Coelho και Marjana Prifti Skenduli",
            "text" => [
                "1" => "Η Τεχνητή Νοημοσύνη (ΤΝ) επηρεάζει πολλούς τομείς της καθημερινής ζωής: διορθώνει αυτόματα το κείμενο που πληκτρολογείτε στο τηλέφωνό σας, επιλέγει τη μουσική που παίζει η αγαπημένη σας εφαρμογή μουσικής και απομνημονεύει τους κωδικούς πρόσβασής σας όταν εσείς τους έχετε ξεχάσει. Η ΤΝ αναφέρεται σε έναν συνδυασμό εκμάθησης μηχανής, ρομποτικής και αλγορίθμων, με εφαρμογές σε όλους τους τομείς: από την επιστήμη των υπολογιστών έως την παραγωγή και από την ιατρική έως τη μόδα. Επομένως, έχει μια αδιαμφισβήτητη θέση στη ζωή μας και στις κοινωνίες μας και διαδραματίζει καίριο ρόλο στην εξέλιξη της επιστήμης. Και όπως με κάθε άλλο σημαντικό φαινόμενο στη ζωή μας, οι μαθητές θα επωφεληθούν μαθαίνοντας σχετικά με αυτή. Πώς όμως να διδάξετε κάτι τόσο σύνθετο όσο η ΤΝ;",
                "2" => "Αυτό το Εκπαιδευτικό Πρόγραμμα θα σας βοηθήσει να εξηγήσετε στους μαθητές τι είναι η ΤΝ και τι ρόλο παίζει στη ζωή των μαθητών. Οι δραστηριότητες αυτές έχουν σχεδιαστεί για μη ειδικούς, έτσι ώστε να κατανοούν εύκολα το περιεχόμενο και να μπορούν να αναλύουν αποτελεσματικά περίπλοκους όρους σε εύκολα κατανοητές ιδέες. Με αυτά τα σχέδια μαθημάτων μπορείτε να βοηθήσετε τους μαθητές να μάθουν τις χρήσεις της ΤΝ και ορισμένους από τους μηχανισμούς που την στηρίζουν. Οι δραστηριότητες αυτές έχουν σχεδιαστεί έτσι ώστε να καλλιεργήσουν οι μαθητές τις ικανότητες ανάλυσης και κριτικής σκέψης τους: για παράδειγμα, στη δραστηριότητα της Marjana, οι μαθητές προγραμματίζουν μια σειρά εργασιών ταξινόμησης.. Οι δραστηριότητες αυτές θα βοηθήσουν επίσης τους μαθητές να κατανοήσουν τις ποικίλες εφαρμογές της ΤΝ: στη δραστηριότητα του Artur θα μάθουν για τη σύνδεση της ΤΝ με την Τέχνη και για τον τρόπο με τον οποίο η ΤΝ μπορεί να χρησιμοποιηθεί για να βελτιώσει την οπτική έκφραση. Με τις δραστηριότητες αυτές, οι μαθητές θα διερευνήσουν επίσης τους κινδύνους της ΤΝ και τον αντίκτυπο αυτών."
            ],
            "activities" => [
                "1" => "Άνθρωποι-ΤΝ- Τέχνη, για την πρωτοβάθμια εκπαίδευση",
                "2" => "Εκμάθηση Ταξινόμησης σε Μηχανές: Εισαγωγή στην Επιβλεπόμενη Εκμάθηση Μηχανής, για την κατώτερη δευτεροβάθμια εκπαίδευση",
                "3" => "Εκμάθηση Ταξινόμησης σε Μηχανές: Εισαγωγή στην Επιβλεπόμενη Εκμάθηση Μηχανής, για την ανώτερη δευτεροβάθμια εκπαίδευση",
            ]
        ],

        '14' => [
            'title' => 'Μάθηση στην εποχή των ευφυών μηχανών',
            'author' => 'από τους Adil Tugyan, Γεωργία Λάσκαρη και Marco Neves',
            'text' => [
                '1' => 'Η πρόοδος της ΤΝ κατά τα τελευταία έτη ήταν εντυπωσιακή, χάρη στις γρήγορες εξελίξεις που σημειώθηκαν στην υπολογιστική δύναμη αλλά και στη διαθεσιμότητα μεγάλης ποσότητας δεδομένων. Αυτό έχει οδηγήσει σε σημαντικές επενδύσεις στην έρευνα της ΤΝ, καθώς επίσης στην ταχεία επέκταση του κλάδου της ΤΝ, καθιστώντας την ΤΝ μια σημαίνουσα τεχνολογική επανάσταση της εποχής μας. Η ΤΝ υπάρχει παντού γύρω μας. Έχει γίνει μέρος της καθημερινότητάς μας, σε τέτοιο βαθμό που μερικές φορές δεν την θεωρούμε ΤΝ: χρησιμοποιούμε διαδικτυακές προτάσεις, ανίχνευση προσώπου, συστήματα ασφαλείας και βοηθούς φωνής σχεδόν καθημερινά. Τι γίνεται όμως με την εκπαίδευση; ',
                '2' => 'Η ΤΝ έχει τεράστιες δυνατότητες ώστε να επιτρέψει νέους τρόπους διδασκαλίας και μάθησης, καθώς επίσης να βελτιώσει την εκπαίδευση των μαθητών. Το συγκεκριμένο Εκπαιδευτικό υλικό θα σας βοηθήσει να ενσωματώσετε αυθεντικές δραστηριότητες ΤΝ στη διδασκαλία σας, καθώς επίσης να προετοιμάσετε τους μαθητές σας για να ζήσουν και να σταδιοδρομήσουν σε έναν κόσμο που διαμορφώνεται από την ΤΝ. Οι δραστηριότητες αυτές έχουν σχεδιαστεί ώστε να μπορέσουν οι μαθητές να αναπτύξουν την περιέργειά τους, την ικανότητα επίλυσης προβλημάτων και τη δημιουργικότητά τους: για παράδειγμα, στη δραστηριότητα του Adil, οι μαθητές μαθαίνουν για αλγόριθμους και νευρωνικά δίκτυα, ενώ ενθαρρύνονται να δημιουργήσουν το δικό τους νευρωνικό δίκτυο ώστε να απεικονίσουν έναν εγκέφαλο ΤΝ. Η Γεωργία θα καθοδηγήσει τους μαθητές σας βήμα προς βήμα στο να αναπτύξουν ένα chatbot. Οι μαθητές θα δημιουργήσουν το δικό τους chatbot, θα προετοιμάσουν σύνολα δεδομένων με ερωτήσεις και απαντήσεις, ενώ θα το εκπαιδεύσουν ώστε να μπορεί να απαντά σε ερωτήσεις σχετικά με τον Covid-19. Στη δραστηριότητα του Marco, οι μαθητές θα αναζητήσουν τα οφέλη και τις προκλήσεις των ευφυών μηχανών στην καθημερινή ζωή και στην εργασία. Ποιους κινδύνους της ΤΝ πρέπει να λάβουμε υπόψη; Τι επιπτώσεις θα έχει η ΤΝ στο μέλλον της εργασίας; Τι είδους θέσεις εργασίας θα είναι διαθέσιμες όταν βγουν στην αγορά εργασίας στο μέλλον;'
            ],
            'activities' => [
                'title' => 'Στα εκπαιδευτικά πλάνα πιο πάνω, οι μαθητές θα μάθουν για τις ευφυείς μηχανές με διασκεδαστικό και αλληλεπιδραστικό τρόπο.',
                '1' => 'Τεχνητή νοημοσύνη και τα Νευρωνικά δίκτυά της, για το Δημοτικό σχολείο',
                '2' => 'Το chatbot μου για τον Covid-19, για το Γυμνάσιο',
                '3' => 'Ζώντας στην εποχή των «έξυπνων μηχανών»: Προκλήσεις και ευκαιρίες, για το Λύκειο',
            ]
        ],

        "15" => [
            "title" => "Εξορύσσοντας τον γραμματισμό στα μέσα",
            "author" => "των Marijana Smolčec, Tea Horvatić και Sanja Božinović",
            "text" => [
                "Η εκπαίδευση και ο γραμματισμός στα μέσα δεν υπήρξαν ποτέ πιο σημαντικά για τους σημερινούς μαθητές. Οι μαθητές όλων των ηλικιών πρέπει να αποκτήσουν σχετικές δεξιότητες, γνώσεις και συμπεριφορές για να μπορούν να περιηγηθούν στον πλούσιο σε μέσα κόσμο. Οι δεξιότητες γραμματισμού στα μέσα θα τους βοηθήσουν να χρησιμοποιούν αξιόπιστο περιεχόμενο στο internet και να αναγνωρίζουν παραπλανητικές πηγές πληροφοριών. Θα κατανοήσουν τον τρόπο με τον οποίο μπορούν να ελέγχουν την πιστότητα των πληροφοριών που βρίσκουν ηλεκτρονικά και να τις ερμηνεύουν με κριτική σκέψη. Θα ευαισθητοποιηθούν σχετικά με την ορθή χρήση του δημιουργικού έργου και θα εφαρμόσουν όσα έμαθαν κατά τη δημιουργία του δικού τους δημιουργικού περιεχομένου.",
                "Αυτό το εκπαιδευτικό πρόγραμμα θα σας δώσει τη δυνατότητα να υλοποιήσετε διάφορες στρατηγικές και τεχνικές για να ενισχύσετε τους μαθητές σας και να αποκτήσουν γραμματισμό στα μέσα. Στη δραστηριότητα της Marijana, οι μαθητές μαθαίνουν πώς να χρησιμοποιούν το περιεχόμενο του Web με ασφάλεια και υπευθυνότητα. Ενημερώνονται για τους διαφορετικούς τύπους αδειών χρήσης και προγραμματίζουν μια απλή εφαρμογή για να καταλάβουν πώς να κάνουν σωστή κοινή χρήση του δημιουργικού έργου. Στη δραστηριότητα της Tea, οι μαθητές ξεκινούν για μια αποστολή αναζήτησης, όπου θα μάθουν για το clickbait. Μέσα από τις ενδιαφέρουσες εργασίες, οι μαθητές εξερευνούν στρατηγικές για τον εντοπισμό και την αποκάλυψη του clickbait και μαθαίνουν πώς να το αποφεύγουν. Η Sanja επιτρέπει στους μαθητές να εξερευνούν και να αναλύουν και να αξιολογούν με κριτική σκέψη το περιεχόμενο του Web, τη συνάφεια, την ακρίβεια, την προέλευση και τον σκοπό του. Μαθαίνουν πώς να βρίσκουν αξιόπιστες πηγές στο διαδίκτυο και πώς να αναγνωρίζουν ψευδείς ηλεκτρονικές πληροφορίες.",
                "Στα παρακάτω σχέδια μαθημάτων, θα βρείτε εμπνευσμένες και ενδιαφέρουσες δραστηριότητες για την ενίσχυση των δεξιοτήτων γραμματισμού στα μέσα των μαθητών:",
            ],
            "activities" => [
                "1" => "Είναι δωρεάν αν είναι στο Internet;",
                "2" => "Να κάνει κανείς κλικ ή να μην κάνει κλικ",
                "3" => "Επαλήθευση πληροφοριών",
            ]
        ],
        "16" => [
            "title" => "ΑΦΗΓΗΣΗ ΙΣΤΟΡΙΑΣ ΜΕ ΤΗ HEDY",
            "author" => "από τη Felienne Hermans",
            "text" => [
                "Οι μαθητές σου γνωρίζουν ήδη μια γλώσσα οπτικού προγραμματισμού αλλά δεν αισθάνονται έτοιμοι να μελετήσουν μια γλώσσα προγραμματισμού που βασίζεται σε γραπτό κώδικα; Τότε αυτό το εκπαιδευτικό πρόγραμμα είναι ιδανικό για σένα και τους μαθητές σου γιατί θα τους βοηθήσει να γεφυρώσουν το χάσμα μεταξύ μιας γλώσσας οπτικού προγραμματισμού και μιας γλώσσας προγραμματισμού που βασίζεται σε γραπτό κώδικα. Το εκπαιδευτικό πρόγραμμα <strong>Αφήγηση ιστορίας με τη Hedy</strong> περιλαμβάνει τρία πλάνα μαθημάτων που χρησιμοποιούν τη Hedy – μια σταδιακή γλώσσα προγραμματισμού για τη διδασκαλία του προγραμματισμού σε παιδιά.",

                "Η Hedy απευθύνεται σε παιδιά που θέλουν να ξεκινήσουν με γλώσσες προγραμματισμού που βασίζονται σε γραπτό κώδικα, αλλά για τα οποία η Python μπορεί να είναι ακόμα αρκετά πολύπλοκη. Οι σταδιακές γλώσσες χρησιμοποιούν διαφορετικά επίπεδα γλωσσών, όπου κάθε επίπεδο προσθέτει έννοιες και πιο πολύπλοκο συντακτικό. Στο τέλος της σειράς επιπέδων της Hedy, οι μαθητές γνωρίζουν ένα μέρος των συντακτικών κανόνων της Python.",

                "Σε αυτό το Εκπαιδευτικό Πρόγραμμα θα βρεις ενδιαφέρουσες και καθηλωτικές δραστηριότητες που θα βοηθήσουν τους μαθητές σου να χρησιμοποιήσουν αποτελεσματικά γλώσσες προγραμματισμού που βασίζονται σε γραπτό κώδικα. Δημιουργώντας τις δικές τους διαδραστικές ιστορίες, θα μάθουν σταδιακά προγραμματισμό, χωρίς να πρέπει να τα μάθουν όλα μονομιάς. Στο πλάνο μαθήματος για δημοτικό σχολείο, οι μαθητές εισάγονται στις βασικές έννοιες του προγραμματισμού. Το πλάνο μαθήματος για το γυμνάσιο εισάγει περαιτέρω έννοιες προγραμματισμού, ενώ το πλάνο μαθήματος για το λύκειο επιτρέπει στους μαθητές να κωδικοποιούν πιο πολύπλοκες ιστορίες και δραστηριότητες.",

                "Δες τη διαδραστική ιστορία παρακάτω για να κατανοήσεις πώς οι αναγνώστες μπορούν να συμμετέχουν στην ιστορία και πώς εξασφαλίζεται η ενεργός συμμετοχή τους."
            ],
            "activities" => [
                "1" => "Δημιούργησε τη δική σου διαδραστική ιστορία με τη Hedy για μαθητές δημοτικού",
                "2" => "Δημιούργησε τη δική σου διαδραστική ιστορία με τη Hedy για μαθητές γυμνασίου",
                "3" => "Δημιούργησε τη δική σου διαδραστική ιστορία με τη Hedy για μαθητές λυκείου",
            ]
        ],
        "17" => [
            "title" => "Νιώστε τον Κώδικα",
            "author" => "από την Alenka Miljević ",
            "text" => [
                "Η κοινωνική και συναισθηματική ευημερία είναι η ικανότητα να είναι κάποιος ανθεκτικός, να γνωρίζει πώς να διαχειρίζεται τα συναισθήματά του και να ανταποκρίνεται στα συναισθήματα των άλλων, να αναπτύσσει ουσιαστικές σχέσεις με τους γύρω του, να αναπτύσσει συναισθήματα τα οποία να οδηγούν σε θετική ψυχολογία, καθώς και να δημιουργεί το δικό του δίκτυο συναισθηματικής υποστήριξης. Οι κοινωνικές και συναισθηματικές δεξιότητες που διδάσκονται οι νέοι στο σχολείο συμβάλουν στην ανάπτυξη της ανθεκτικότητας και θέτουν πρότυπα διαχείρισης της σωματικής και ψυχικής τους υγεία καθ’ όλη τη διάρκεια της ζωής τους. (Συμβούλιο της Ευρώπης)",
                "Το Εκπαιδευτικό Πρόγραμμα Νιώστε τον Κώδικα θα σας δώσει τη δυνατότητα να καλλιεργήσετε την κοινωνική και συναισθηματική ευημερία των μαθητών σας μέσω της αναγνώρισης, της ερμηνείας, της κατανόησης και της ανταπόκρισης σε θετικά και αρνητικά αισθήματα, καθώς και σε συναισθήματα για την ανάπτυξη της ενσυναίσθησης και της ανθεκτικότητας.  Στο εν λόγω Εκπαιδευτικό Πρόγραμμα θα βρείτε ενδιαφέρουσες και διαδραστικές δραστηριότητες που θα βοηθήσουν τους μαθητές σας να αναπτύξουν δεξιότητες με σκοπό τη διαχείριση διαφορετικών συναισθημάτων μέσω του προγραμματισμού.  Οι μαθητές σας θα μάθουν να εκφράζουν τα συναισθήματά τους και να ανταποκρίνονται στα συναισθήματα των συνομηλίκων τους με τη βοήθεια ενός ρομπότ Bee-bot.",
                "Το εκπαιδευτικό πρόγραμμα Νιώστε τον Κώδικα περιλαμβάνει τρία πλάνα μαθημάτων τα οποία χρησιμοποιούν ένα εκπαιδευτικό ρομπότ Bee-Bot με σκοπό τη δημιουργία δραστηριοτήτων οι οποίες ενθαρρύνουν τους μαθητές να μιλούν για τα συναισθήματα και να αναπτύσσουν ενσυναίσθηση. Στο πλαίσιο του πλάνου μαθημάτων για τα Δημοτικά Σχολεία οι μαθητές προγραμματίζουν ένα Bee-Bot για να μιλήσουν για συναισθήματα, όπως τη λύπη, τη χαρά, τον φόβο και τον θυμό και να ανακαλύψουν τους λόγους για τους οποίους οι ίδιοι, καθώς και οι συνομήλικοί τους νιώθουν αυτά τα συναισθήματα.  Το πλάνο μαθημάτων για τα Γυμνάσια ενθαρρύνει τους μαθητές να προγραμματίσουν ένα Bee-Bot, να αναγνωρίσουν τα συναισθήματά τους και τα συναισθήματα των συνομηλίκων τους, να κατανοήσουν την αιτία που τα προκάλεσε και πώς να ανταποκριθούν σε αυτά. Το πλάνο μαθημάτων για τα Λύκεια επιτρέπει στους μαθητές να κατευθύνουν το Bee-Bot και να επινοούν ιστορίες για συναισθήματα, ανθεκτικότητα και ενσυναίσθηση.",
                "Εάν η τάξη σας δεν διαθέτει εκπαιδευτικό ρομπότ, το εν λόγω Εκπαιδευτικό Πρόγραμμα θα σας δώσει ιδέες για δραστηριότητες χωρίς σύνδεση στο διαδίκτυο οι οποίες καλλιεργούν την ανάπτυξη κοινωνικών και συναισθηματικών δεξιοτήτων. Η παρακάτω διαδραστική ιστορία παρέχει μια σύντομη επισκόπηση των δραστηριοτήτων τις οποίες μπορείτε να εφαρμόσετε στην τάξη σας:"
            ],
            "activities" => [
                "1" => "Προγραμματίζω - Νιώθω - Μαθαίνω για μαθητές δημοτικών σχολείων",
                "2" => "Η καρδιά μου δεν είναι από πέτρα για μαθητές γυμνασίων",
                "3" => "Προγραμματίζω τη διάθεσή μου για μαθητές λυκείων",
            ]
        ],
        "18" => [

            "title" => "SOS για το Νερό",
            "author" => "του Francisco Delgado Cecilia",
            "text" => [

                "Το εκπαιδευτικό πρόγραμμα \"SOS για το Νερό\" είναι μια απάντηση στην ανάγκη αντιμετώπισης του προβλήματος της ρύπανσης των υδάτων. Παρά τις προσπάθειες που καταβλήθηκαν τα τελευταία χρόνια, εξακολουθούν να υπάρχουν 2 δισεκατομμύρια άνθρωποι σε όλο τον κόσμο που δεν έχουν πρόσβαση σε ασφαλές πόσιμο νερό. Αυτό σημαίνει ότι ο στόχος 6 της Ατζέντας του 2030 για τη Βιώσιμη Ανάπτυξη (ΣΒΑ), ο οποίος ορίζει ότι όλοι οι άνθρωποι θα πρέπει να έχουν πρόσβαση σε καθαρό νερό και αποχέτευση έως το 2030, απέχει πολύ από το να επιτευχθεί. Το ίδιο ισχύει και για τον ΣΒΑ 14 σχετικά με τη ζωή στο νερό, ο οποίος αποσκοπεί στη διατήρηση και τη βιώσιμη χρήση των ωκεανών, των θαλασσών και των θαλάσσιων πόρων για τη βιώσιμη ανάπτυξη.",

                "Αυτό το εκπαιδευτικό πρόγραμμα επικεντρώνεται στο σχετικό και επίκαιρο θέμα της μέτρησης της ποιότητας του νερού και στους νέους ρύπους που θέτουν σε κίνδυνο την ποιότητα του νερού. Οι μαθητές θα έχουν την ευκαιρία να διερευνήσουν και να αναζητήσουν λύσεις σε πραγματικά προβλήματα που σχετίζονται με το νερό και το περιβάλλον, γεγονός που θα τους επιτρέψει να αναπτύξουν δεξιότητες όπως η έρευνα, η κριτική σκέψη και η επίλυση προβλημάτων.",

                "Τα πλάνα μαθημάτων περιλαμβάνουν πρακτικές και δημιουργικές δραστηριότητες, όπως ο προγραμματισμός στο Scratch, η μύηση στη μηχανική μάθηση και την τεχνητή νοημοσύνη με το Learning Machine Learning και η κατασκευή καθοδηγούμενων οχημάτων με σετ Lego για τη δειγματοληψία νερού και την ανάλυση του pH του νερού. Αυτές οι δραστηριότητες θα επιτρέψουν στους μαθητές να εφαρμόσουν τις δεξιότητες και τις γνώσεις τους στην πράξη σε ένα διαδραστικό και παιχνιδιάρικο περιβάλλον, το οποίο θα αυξήσει τα κίνητρα και το ενδιαφέρον τους για το έργο.",

                "Για την υλοποίηση αυτού του εκπαιδευτικού προγράμματος προτείνεται η πραγματοποίηση των τριών δραστηριοτήτων στην τάξη, ώστε να ολοκληρωθεί πλήρως το έργο και να επιτευχθεί μια πιο ουσιαστική και ενδιαφέρουσα μαθησιακή διαδικασία. Ωστόσο, κάθε δραστηριότητα μπορεί να εκτελεστεί μεμονωμένα."

            ],
            "activities" => [
                "1" => "SOS για το νερό με το Scratch",
                "2" => "SOS για το νερό με τη Μηχανική Μάθηση",
                "3" => "SOS για το νερό με τα Ρομποτικά Παιχνίδια",
            ]

        ],
        "19" => [
            "title" => "Δημιουργικό Εργαστήριο Scratch",
            "author" => "από τον Krzysztof Jaworski",
            "text" => [

                "Η εκμάθηση του προγραμματισμού στις μέρες μας δεν αφορά μόνο την προετοιμασία για μια επαγγελματική σταδιοδρομία στην πληροφορική και εκτείνεται πέρα ​​από τα όρια της επιστήμης των υπολογιστών. Θα πρέπει να προσεγγίζεται ευρέως, να περιλαμβάνει μια διεπιστημονική προοπτική και να χρησιμοποιεί τον προγραμματισμό ως εργαλείο μάθησης και παιχνιδιού για την προώθηση της ανάπτυξης δεξιοτήτων του μέλλοντος.",

                "Για τα παιδιά και τους νέους, είναι σημαντικό να κατανοήσουν πώς να χρησιμοποιούν τα ψηφιακά εργαλεία με ασφάλεια, υπευθυνότητα και αποτελεσματικότητα. Πρέπει να κατανοήσουν πώς λειτουργούν αυτά τα εργαλεία και να γνωρίζουν πώς να αλληλεπιδρούν μαζί τους μέσω του προγραμματισμού. Επιπλέον, αυτή η εμπειρία θα πρέπει να περιλαμβάνει τη συνεργασία με τους συμμαθητές τους.",

                "Το Εκπαιδευτικό Πρόγραμμα <strong>Creative Scratch Laboratory</strong> θα ενισχύσει τη δημιουργικότητα των μαθητών, θα εξάψει την περιέργειά τους και θα κάνει τη συγγραφή κώδικα απολαυστική και διασκεδαστική.  Αποτελείται από τρία πλάνα μαθημάτων για μαθητές με διάφορα επίπεδα δεξιοτήτων στον προγραμματισμό. Στο πλάνο μαθήματος για αρχάριους, οι μαθητές φτιάχνουν ένα χαρακτήρα σε χαρτί, τον εισάγουν στο Scratch και τον ζωντανεύουν χρησιμοποιώντας επιλεγμένες εντολές. Το πλάνο μαθήματος για μαθητές μεσαίου επιπέδου διδάσκει στους μαθητές το εργαλείο Video Sprites, να δημιουργούν γραφικά με χαρτί και μαρκαδόρους και να φτιάχνουν μωσαϊκά στο Scratch με Video Sprites, με σφραγίδες και έργα τέχνης. Στο πλάνο μαθήματος για προχωρημένους, οι μαθητές εξερευνούν τη λειτουργία αναγνώρισης προσώπου στο Scratch, πειραματίζονται με τον χειρισμό γραφικών αντικειμένων και δημιουργούν ένα μίνι θεατρικό με διαλόγους που δημιουργούνται στο Scratch.",

            ],
            "activities" => [
                "1" => "Σχέδιο και κίνηση αντικειμένου: για αρχάριους",
                "2" => "Σφραγίδες: για μαθητές μεσαίου επιπέδου",
                "3" => "Κουκλοθέατρο: για μαθητές προχωρημένου επιπέδου",
            ]
        ],
        "20" => [
            "title" => "Προγραμματισμός μέσω της Τέχνης",
            "author" => "από τη Μαρία Τσαπάρα",
            "text" => [
                "Τα παιδιά μεγαλώνουν σε έναν πολύπλοκο κόσμο που εξελίσσεται συνεχώς τεχνολογικά, γεγονός που απαιτεί καινοτόμες εκπαιδευτικές προσεγγίσεις για τους παιδαγωγούς της πρώιμης παιδικής ηλικίας. Οι προσεγγίσεις αυτές περιλαμβάνουν δραστηριότητες που προωθούν την υπολογιστική σκέψη και τον προγραμματισμό από νεαρή ηλικία. Οι έρευνες δείχνουν ότι οι στοχευμένες δραστηριότητες μπορούν να αναπτύξουν αποτελεσματικά την υπολογιστική σκέψη και τις δεξιότητες επίλυσης προβλημάτων των παιδιών και ταυτόχρονα οι δραστηριότητες αυτές προωθούν τη δημιουργική τους έκφραση μέσω της τεχνολογίας.",
                "Αν και η πιο συνηθισμένη στρατηγική για τη διδασκαλία του προγραμματισμού περιλαμβάνει τη χρήση εκπαιδευτικών ρομπότ, υπάρχει επίσης η δυνατότητα προγραμματισμού χωρίς τη χρήση ενός κιτ ρομποτικής (χωρίς ηλεκτρονικές συσκευές). Η προσέγγιση αυτή μπορεί να λάβει διάφορες μορφές και να περιλαμβάνει ένα ευρύ φάσμα δραστηριοτήτων (ψηφιοποίηση εικόνας, τα παιδιά σε ρόλο ρομπότ, χρήση πλέγματος δαπέδου κ.λπ.). Οι δραστηριότητες αυτές προσφέρουν βιωματικά μαθησιακά οφέλη, ιδίως για τα μικρά παιδιά που μαθαίνουν αποτελεσματικότερα μέσω του παιχνιδιού. ",
                "<strong>To Εκπαιδευτικό Πρόγραμμα «Προγραμματισμός μέσω της Τέχνης» </strong> περιλαμβάνει τρία πλάνα μαθήματος για παιδαγωγούς προσχολικής ηλικίας, μια δραστηριότητα χωρίς σύνδεση, τη χρήση ενός εκπαιδευτικού ρομπότ Bee-bot (έξυπνη μέλισσα) και το κιτ εφευρέσεων Makey Makey. Με τη χρήση του κιτ Makey Makey οι μαθητές έχουν την ευκαιρία να δημιουργήσουν απτές διεπαφές και να δοκιμάσουν διαφορετικές λύσεις, να δημιουργήσουν, να πειραματιστούν και να ενισχύσουν όλες τις μαθησιακές τους ικανότητες σε ένα συνεργατικό περιβάλλον μάθησης.",
                "Όπως είπε ο Πάμπλο Πικάσο «Κάθε παιδί είναι ένας καλλιτέχνης. Το πρόβλημα είναι πώς θα παραμείνει καλλιτέχνης όταν μεγαλώσει». Η τέχνη παρέχει στα παιδιά ευκαιρίες να αναπαραστήσουν και να επικοινωνήσουν δημιουργικά τις ιδέες και τα συναισθήματά τους. Σε αυτό το Εκπαιδευτικό Πρόγραμμα θα βρείτε ενδιαφέρουσες δραστηριότητες ώστε οι μαθητές σας να αναπτύξουν κοινωνικές δεξιότητες και δεξιότητες του 21ου αιώνα μέσω της τέχνης και του προγραμματισμού, ώστε να τους ενθαρρύνετε να εκφράζονται δημιουργικά και να καλλιεργήσετε τη φαντασία τους. Το Εκπαιδευτικό Πρόγραμμα «Προγραμματισμός μέσω της Τέχνης» θα σας δώσει τη δυνατότητα να προωθήσετε τη δημιουργικότητα, το πνεύμα συνεργασίας και τις δεξιότητες επίλυσης προβλημάτων των μαθητών σας ενσωματώνοντας την τέχνη και τον προγραμματισμό."
            ],
            "activities" => [
                "1" => "Έντεχνος προγραμματισμός: ",
                "2" => "Εργαστήριο δημιουργικής συγγραφής κώδικα: μαθητές νηπιαγωγείου 4-6 ετών",
                "3" => "Καμβάς αφής: Δημιουργία διαδραστικών πινάκων ζωγραφικής: παιδιά νηπιαγωγείου, προχωρημένο επίπεδο."
            ]
        ],

        "21" => [
            "title" => "Κατασκευές και συγγραφή κώδικα",
            "author" => "από την Ulla Hauptmann",
            "text" => [
                "Οι χώροι δημιουργίας (makerspace) είναι δυναμικοί κόμβοι όπου η ενισχύεται η δημιουργικότητα και υλοποιούνται πρακτικά έργα. Κατά την επιλογή του εξοπλισμού για έναν  χώρο δημιουργίας, η έμφαση δίνεται σε εργαλεία όπως το Calliope mini, το Microbit ή το Makey Makey, καθώς προσφέρουν ένα ευρύ φάσμα δυνατοτήτων κατάλληλων για μαθητές διαφορετικών ηλικιών και επιπέδων δεξιοτήτων. Αυτά τα ταμπλό υποστηρίζουν την ανάπτυξη δημιουργικών έργων για μικρότερα παιδιά χάρη στις γλώσσες προγραμματισμού που βασίζονται σε μπλοκ εντολών που είναι διαθέσιμες για αυτά τα ταμπλό. Για τους μεγαλύτερους μαθητές, μπορούν να δημιουργηθούν πιο σύνθετα έργα χρησιμοποιώντας αυτά τα ταμπλό.",
                "Εξερευνήστε το <strong>Εκπαιδευτικό Πρόγραμμα \"Κατασκευές και Συγγραφή Κώδικα\"</strong> για να εισαχθείτε στον κόσμο των χώρων δημιουργίας και να αναπτύξετε διαθεματικές δεξιότητες όπως η ομαδική εργασία και η κοινωνική συνεργασία, ενώ παράλληλα θα ενθουσιάσετε και θα εγείρετε το ενδιαφέρον των μαθητών σας για την καινοτομία!",
                "Το Makey Makey είναι μια πλακέτα κυκλώματος που μετατρέπει καθημερινά αντικείμενα σε πλήκτρα υπολογιστή. Συνδέοντας αντικείμενα στην πλακέτα με κλιπ αλιγάτορα, τα οποία στη συνέχεια συνδέονται με τον υπολογιστή μέσω καλωδίου USB (ή ενός iPad με προσαρμογέα κάμερας), το Makey Makey μπορεί να ανοίγει και να κλείνει ηλεκτρικά κυκλώματα μεταξύ ενός ατόμου και ενός αντικειμένου. Αυτό στέλνει ηλεκτρικά σήματα τα οποία ο υπολογιστής λαμβάνει ως χτυπήματα του πληκτρολογίου ή κλικ του ποντικιού. Αυτό επιτρέπει στους μαθητές να αναπτύξουν δημιουργικές εφευρέσεις όπως μουσικά όργανα, παιχνίδια υπολογιστή ή διαδραστικές αφίσες - οι δυνατότητες είναι απεριόριστες! Το Makey Makey και τα έργα που παρουσιάζονται σε αυτό το Εκπαιδευτικό Πρόγραμμα μπορούν να χρησιμοποιηθούν τόσο στην πρωτοβάθμια όσο και στη δευτεροβάθμια εκπαίδευση για τη διδασκαλία δεξιοτήτων σε τομείς όπως η εκπαίδευση στα μέσα μαζικής ενημέρωσης, η επιστήμη των υπολογιστών, η επιστήμη, η φυσική, η μουσική, ο αθλητισμός και διαθεματικές δεξιότητες όπως η ομαδική εργασία και οι κοινωνικές δεξιότητες.",
                "Μπείτε στον συναρπαστικό κόσμο του Makey Makey και απελευθερώστε απεριόριστη δημιουργικότητα στην τάξη σας!"
            ],
            "activities" => [
                "1" => "Το Makey Makey συναντά τη μουσική: για αρχάριους.",
                "2" => "Εικόνες που μιλούν: για μαθητές μεσαίου επιπέδου.",
                "3" => "Δημιουργήστε μια διαδραστική αφίσα: για προχωρημένους μαθητές.",
            ]
        ]


    ],
    'download_video_script' => 'Κατεβάστε τα λόγια του βίντεο σε μορφή κειμένου',
    'ready_to_share' => 'Έτοιμοι να μεταδώσετε όσα μάθατε στους μαθητές σας;',
    'choose_lessons' => 'Επιλέξτε ένα από τα προγράμματα διδασκαλίας παρακάτω και διοργανώστε μια δραστηριότητα με τους μαθητές σας.',
    'footer' => [
        'title' => 'Μην ξεχάσετε να προσθέσετε την εκδήλωσή σας στον χάρτη της Εβδομάδας Προγραμματισμού!',
        'text' => '<p>Μπορείτε εύκολα να διοργανώσετε ένα μάθημα στην τάξη σας, μια ημέρα γνωριμίας ή μια εκδήλωση στο σχολείο σας. Απλώς βρείτε μια ημερομηνία και καταχωρίστε τη δραστηριότητά σας στον <a href="/events">χάρτη της Εβδομάδα Προγραμματισμού</a>. Κάθε διοργανωτής δραστηριότητας θα λάβει πιστοποιητικό συμμετοχής για την προσπάθεια του.</p>

<p>Αν θέλετε να επικοινωνείτε με μια διεθνή ομάδα δασκάλων που διαπνέεται από ενθουσιασμό, εγγραφείτε στην <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">ομάδα για δασκάλους της Ευρωπαϊκής Εβδομάδας Προγραμματισμού στο Facebook</a>! Αν θέλετε να κάνετε ένα παραπάνω βήμα και να συνεργαστείτε με άλλα σχολεία της χώρας σας ή και πέρα από τα σύνορα της χώρας σας, δηλώστε συμμετοχή στην <a href="/codeweek4all">πρόκληση Code Week 4 All</a>.</p>'
    ],
'training-text'=>'Υλικά σε μικρές δόσεις, έτοιμα προς χρήση,  που θα σε βοηθήσουν να εισαγάγεις  τις βασικές έννοιες του  προγραμματισμού και να σχεδιάσεις το επόμενο καινοτόμο μάθημά σου.',
'quick-practical-text1'=> "Ανακάλυψε τα βασικά στοιχεία του προγραμματισμού και της υπολογιστικής σκέψης μέσα από πρακτικές δραστηριότητες μικρού μεγέθους, σχεδιασμένες για εκπαιδευτικούς, μαθητές και για οποιονδήποτε που επιθυμεί να εξερευνήσει τον ψηφιακό κόσμο. Είτε είσαι νέος/νέα στον προγραμματισμό, είτε αναζητάς  νέες ιδέες για να τις ενσωματώσεις στο μάθημα σου  ή σε σεμινάρια κατάρτισης, τα Learning Bits θα πυροδοτήσουν τη φαντασία σου και θα σου  παρέχουν ένα σταθερό σημείο εκκίνησης.",
'watch-learn-title'=>'Παρακολούθησε &; Μάθε',
'watch-learn-text'=>'Ανακάλυψε τα βασικά στοιχεία του προγραμματισμού μέσω ελκυστικών Learning Bits. Αυτές οι ενότητες μικρού μεγέθους , διάρκειας περίπου 15 λεπτών, εισάγουν βασικές έννοιες που σχετίζονται με τον προγραμματισμό και την υπολογιστική σκέψη. Εκτός από τις θεωρητικές γνώσεις, οι ενότητες παρέχουν πρακτικές συμβουλές σχετικά με τον τρόπο εφαρμογής αυτών των εννοιών σε διάφορα εκπαιδευτικά περιβάλλοντα - είτε διδάσκεις σε παιδιά, μαθητές ή ενήλικες.',
'get-hands-on-title' =>'Δοκίμασε στην πράξη',
'get-hands-on-text' =>'Επίλεξε ένα Learning Bit, παρακολούθησε το εκπαιδευτικό βίντεο και εξερεύνησε  τις πρακτικές δραστηριότητες που συνοδεύουν το υλικό. Είτε είσαι νέος/νέα στην κωδικοποίηση είτε αναζητάς φρέσκες, δημιουργικές ιδέες διδασκαλίας, το Coding Basics θα σε εξοπλίσει με τα εργαλεία για να πυροδοτήσεις την ψηφιακή περιέργεια και τη δημιουργικότητα στους μαθητές σου.',
'share-inspire-title' =>'Μοιράσου & Ενέπνευσε',
'share-inspire-text1' =>'Μόλις ολοκληρώσεις ένα ή περισσότερα bit εκμάθησης της Εβδομάδας Προγραμματισμού, σε ενθαρρύνουμε να φέρεις την ψηφιακή δημιουργικότητα στο εκπαιδευτικό σου περιβάλλον και να καταχωρίσεις τη δραστηριότητά σου στον χάρτη της <a href="/events" class="font-semibold text-dark-blue underline">Εβδομάδας Προγραμματισμού</a>!',
'share-inspire-text2' =>'Μπορείς να οργανώσεις ένα μάθημα στην τάξη σου, ένα εργαστήριο σε ένα κοινοτικό κέντρο ή μια ανοιχτή εκδήλωση στον φορέα σου. Απλώς επίλεξε μια ημερομηνία και καταχώρισε τη δραστηριότητά σου στον <a href="/events" class="font-semibold text-dark-blue underline">Χάρτη της Εβδομάδας Προγραμματισμού</a>. Κάθε διοργανωτής της δραστηριότητας θα λάβει πιστοποιητικό συμμετοχής για την προσπάθειά του.',
'share-inspire-text3' =>'Αν θέλεις να συνδεθείς με μια διεθνή ομάδα ενθουσιωδών εκπαιδευτικών, γίνε μέλος της <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215" target="_blank" class="font-semibold text-dark-blue underline">ομάδας εκπαιδευτικών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού στο Facebook</a>! Και αν θες να πας ένα  βήμα παραπέρα και να συνεργαστείς με άλλα σχολεία στη χώρα σου ή διασυνοριακά, λάβε μέρος στην πρόκληση της Ευρωπαϊκής <a href="/codeweek4all" class="font-semibold text-dark-blue underline">Εβδομάδας Προγραμματισμού 4 Όλα</a>.',
];
