<?php


return [
    'title' => 'Δήλωση αξιών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
    'description' => [
        1 =>
            [
                1 => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα εθελοντών –',
                2 => 'πρέσβεων',
                3 => ', κορυφαίων δασκάλων και οπαδών του προγραμματισμού από ολόκληρο τον κόσμο. Χαίρει της υποστήριξης της',
                4 => 'Ευρωπαϊκής Επιτροπής',
                5 => 'και των Υπουργείων Παιδείας στην Ευρωπαϊκή Ένωση και τις χώρες των Δυτικών Βαλκανίων.',
            ],

        2 => 'Ο πυρήνας της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι η κοινότητα εθελοντών διοργανωτών δραστηριοτήτων που περιλαμβάνει δασκάλους, μέντορες, ομάδες προγραμματισμού, βιβλιοθήκες, ιδιωτικές εταιρείες, γονείς και μη κυβερνητικούς οργανισμούς. Αφιερώνουμε χρόνο, ενέργεια και δεξιότητες με στόχο να μεταφέρουμε την υπολογιστική σκέψη, τον προγραμματισμό, τη ρομποτική, την ενασχόληση με υλισμικό, την πληροφορική και τις ψηφιακές δεξιότητες γενικά σε όσους περισσότερους ανθρώπους γίνεται στην Ευρώπη και ολόκληρο τον κόσμο.',
        3 => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού αποτελείται επίσης και από τους εκατομμύρια συμμετέχοντες, που είναι άνθρωποι όλων των φύλων, των ηλικιών, των πλαισίων, των πολιτισμών και των δεξιοτήτων από όλο τον κόσμο.',
        4 => 'Είμαστε υπερήφανοι που ανήκουμε στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού. Αυτές είναι οι αξίες μας. Διέπουν πάντα τη δουλειά και τις αποφάσεις μας.',
    ],
    '1' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ανεξάρτητη',
        'content' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι μια κοινότητα που αποτελείται από εθελοντές. Δεν ενεργούμε με γνώμονα το οικονομικό όφελος. Σεβόμαστε και εκτιμούμε τις ιδέες, τα πιστεύω και τους πολιτισμούς άλλων ανθρώπων. Λαμβάνουμε μέρος στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού διότι πιστεύουμε στη σημασία αυτού που κάνουμε. Αυτή είναι η δύναμή μας. Στόχος μας είναι να καταστήσουμε την υπολογιστική σκέψη, την κωδικοποίηση, τον προγραμματισμό, την πληροφορική, τη ρομποτική, την ενασχόληση με το υλισμικό και τις ψηφιακές δεξιότητες γενικότερα προσβάσιμα σε όλους.',
    ],
    '2' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού απευθύνεται σε όλους',
        'content' => 'Ο καθένας μπορεί να οργανώσει δραστηριότητες στο πλαίσιο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού. Κατανοούμε ότι είναι ουσιώδους σημασίας για τις διοργανώσεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού να απευθύνονται σε όλους ανεξάρτητα από ηλικία, χρώμα, φύλο, πολιτισμικό πλαίσιο ή διανοητικές ικανότητες. Οι δραστηριότητες μπορούν να αποτελούν έναυσμα για την κινητοποίηση ενδιαφέροντος και περιέργειας ή να συμβάλλουν στη μεγαλύτερη ανάπτυξη δεξιοτήτων. Ισότητα, σεβασμός, ελευθερία και συμμετοχικότητα αποτελούν τις αρχές μας. Θέλουμε όλοι οι συμμετέχοντες να αποκτούν εμπειρίες και να δημιουργούν μέσω της τεχνολογίας με διασκεδαστικό τρόπο.',
    ],
    '3' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι παγκοσμιοτοπική',
        'content' =>
            [
                1 => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού έχει ως στόχο να σας προσεγγίσει ανεξάρτητα εάν ζείτε σε μεγάλη πόλη, περιφερειακή πρωτεύουσα ή απομακρυσμένο χωριό. Καταβάλλουμε ιδιαίτερη προσπάθεια να υποστηρίζουμε τους τοπικούς διοργανωτές με',
                2 => 'υλικό',
                3 => 'στη γλώσσα τους και να ανταποκρινόμαστε στις ανάγκες τους. Ο',
                4 => 'χάρτης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού',
                5 => 'αποτελεί το βασικό εργαλείο καταγραφής κάθε δραστηριότητας και συγκεκριμένης τοποθεσίας. Ταυτόχρονα, η Ευρωπαϊκή Εβδομάδα Προγραμματισμού έχει παγκόσμιο χαρακτήρα και καλωσορίζει ανθρώπους από ολόκληρο τον κόσμο στην κοινότητα. Είμαστε «παγκοσμιοτοπικοί».',
            ]
    ],
    '4' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού αφορά τη συνεργασία',
        'content' => [
            1 => 'Τα μέλη της κοινότητας της Ευρωπαϊκής Εβδομάδας Προγραμματισμού αλληλεπιδρούν μεταξύ τους, ανταλλάσσουν πληροφορίες, μαθαίνουν το ένα από το άλλο και οικοδομούν από κοινού γνώση. Είμαστε συνδεδεμένοι και υποστηρικτικοί μεταξύ μας. Μοιραζόμαστε πόρους, ιδέες και βέλτιστες πρακτικές. Ενθαρρύνουμε τις συνεργασίες και την αμοιβαία μάθηση.',
            2 => 'Η πρόκληση ‘Εβδομάδα Προγραμματισμού για όλους’',
            3 => 'έχει ως στόχο να δημιουργήσει δεσμούς πέρα από σύνορα και κοινότητες. Βοηθά στη μετάδοση θετικής ενέργειας και τη διασύνδεση των ανθρώπων που ανταλλάσσουν γνώσεις.'
        ]
    ],
    '5' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι μη κερδοσκοπική',
        'content' =>
            [
                1 => 'Οι δραστηριότητες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι μη κερδοσκοπικού χαρακτήρα. Όλοι οι',
                2 => 'πόροι',
                3 => 'της δικτυακής τοποθεσίας της #CodeWeek είναι δωρεάν. Όλα τα εκπαιδευτικά προγράμματα και τα διαδικτυακά μαθήματα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού είναι επίσης δωρεάν.'
            ]
    ],
    '6' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού ενθαρρύνει τη δημιουργικότητα και την καινοτομία',
        'content' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού ενθαρρύνει τη δημιουργικότητα, την καινοτομία και την προοπτική σκέψη. Είμαστε ανοιχτοί και ευγνώμονες για οποιαδήποτε σχόλια και κριτική, προκειμένου να λαμβάνουμε πιο ενημερωμένες αποφάσεις και να εξελίσσουμε την Ευρωπαϊκή Εβδομάδα Προγραμματισμού. Ακόμη και οι αποτυχίες, μας βοηθούν να αναπτυχθούμε ως άτομα και ως κοινότητα.'
    ],
    '7' => [
        'title' => 'Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού ευγνωμονεί την κοινότητά της',
        'content' => 'Είμαστε ευγνώμονες για την υποστήριξη που λαμβάνουμε από δασκάλους, προγυμναστές και άλλους διοργανωτές δραστηριοτήτων, μαθητές, γονείς, ομάδες προγραμματισμού και όλους τους συνεργάτες μας. Έχουμε όλοι έναν κοινό στόχο. Θέλουμε να φέρουμε την υπολογιστική σκέψη, τον προγραμματισμό, την πληροφορική και τις ψηφιακές δεξιότητες σε επαφή με όσο το δυνατόν περισσότερους ανθρώπους.'
    ],

];
