<?php

return [   
    'webinars-text' => 'Ανακάλυψε μια σειρά από δωρεάν διαδικτυακά σεμινάρια για να ενισχύσεις τις γνώσεις και τις δεξιότητές σου στον προγραμματισμό. Συντονίσου και μάθε από ειδικούς, με τον δικό σου ρυθμό!',
    'webinars-sub-text1' => 'Αυτή η σειρά διαδικτυακών σεμιναρίων, που διοργανώνεται από την ομάδα της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, έχει σχεδιαστεί για να υποστηρίζει τη διοργάνωση εκδηλώσεων και δραστηριοτήτων. Αυτή η σειρά συγκεντρώνει ειδικούς, εκπαιδευτικούς και λάτρεις της τεχνολογίας, για να εξερευνήσουν το συναρπαστικό σημείο όπου συναντιούνται ο προγραμματισμός και η ψηφιακή δημιουργικότητα.',
    'webinars-sub-text2' => "Είτε είσαι εκπαιδευτικός  που θέλεις να εμπλουτίσεις την διδακτέα ύλη σου , μαθητής/τρια πρόθυμος/η να επεκτείνεις τις δεξιότητές σου ή λάτρης του προγραμματισμού που σε ενδιαφέρεσαι για τις τελευταίες εκπαιδευτικές τάσεις, αυτή η σειρά έχει κάτι για όλους.",
    'recordings-youtube-list-title' => "Όλο το υλικό είναι επίσης διαθέσιμο σε λίστα αναπαραγωγής YouTube:",
    '2024-webinar-series-title'=>"Σειρά διαδικτυακών σεμιναρίων 2024:",
    '2025-webinar-series-title'=>"Σειρά διαδικτυακών σεμιναρίων 2025:",
];