<?php

return [
    "titles" => [
        "Ποιος ο σκοπός του προγραμματισμού",
        "Να δώσει ζωή σε ιδέες",
        "Ο προγραμματισμός βοηθά επίσης στην ανάπτυξη βασικών ικανοτήτων.",
        "Τέλος, να διαμορφώσει το μέλλον μας",
    ],
    "texts" => [
        "Ποιον αφορά; Την Pia, η οποία ένιωθε ότι έπρεπε να σπουδάσει νομική, παρόλο που πάντα της άρεσαν τα μαθηματικά και απολάμβανε να παίζει με υπολογιστές. Αφορά τον Mark, που έχει μια ιδέα για ένα καλύτερο κοινωνικό δίκτυο, αλλά δεν ξέρει πώς να το κατασκευάσει μόνος του. Αφορά την Alice, η οποία ονειρεύεται να κατασκευάσει ρομπότ γιατί οι γονείς της δεν της επιτρέπουν να έχει γάτα. Και αφορά και όσους από εσάς βοηθούν ήδη να γίνουν πραγματικότητα αυτά τα όνειρα.",
        "Βασικά, ο προγραμματισμός μάς αφορά όλους και αφορά τον τρόπο με τον οποίο διαμορφώνουμε τη ζωή και το μέλλον μας. Όλοι μας μπορούμε να κάνουμε κάτι περισσότερο από το να κοινοποιούμε απλώς μια δημοσίευση ή να δηλώνουμε ότι μας αρέσει. Μπορούμε να δώσουμε ζωή στις ιδέες μας, να δημιουργήσουμε πράγματα που θα φέρουν χαρά στους άλλους.",
        "Δεν ήταν ποτέ πιο εύκολο να αναπτύξετε μια εφαρμογή, να κατασκευάσετε το δικό σας ρομπότ ή ποιος ξέρει —ακόμη και να εφεύρετε το ιπτάμενο αυτοκίνητο! Δεν είναι ένα άνετο ταξίδι, αλλά ένα ταξίδι γεμάτο δημιουργικές προκλήσεις, πολλή διασκέδαση και μια κοινότητα που σας στηρίζει. Είστε έτοιμοι να αποδεχθείτε την πρόκληση και να γίνετε ψηφιακοί δημιουργοί",
        "Οι γλώσσες προγραμματισμού είναι σαν οποιαδήποτε άλλη γλώσσα. Μόνο που στην περίπτωση αυτή τα παιδιά δεν μαθαίνουν να εκφράζονται και να επικοινωνούν με άλλους ανθρώπους. Αντ’ αυτού, μαθαίνουν πώς να επικοινωνούν με την τεχνολογία. Την τεχνολογία που βρίσκεται παντού γύρω μας —στα έξυπνα τηλέφωνα, στους υπολογιστές, στα οχήματα, παντού!",
        "Ωστόσο, η κατανόηση και η επικοινωνία με τους υπολογιστές αποτελούν ένα μόνο μέρος του. Ο προγραμματισμός συμβάλλει επίσης στην ανάπτυξη πολυεπιστημονικών ικανοτήτων, όπως η υπολογιστική σκέψη, η επίλυση προβλημάτων, η δημιουργικότητα και η ομαδική εργασία —εξαιρετικές δεξιότητες για όλα τα επαγγέλματα. Η ικανότητα επίλυσης προβλημάτων, αντιμετώπισης της αποτυχίας και επανάληψης των προσπαθειών ή συνεργασίας με άλλους αποτελεί επιθυμητό στοιχείο σε πολλούς τομείς.",
        "Πριν από έναν αιώνα, δεν υπήρχαν καν γλώσσες προγραμματισμού. Σήμερα, οι κώδικες βρίσκονται παντού γύρω μας και σχεδόν τα πάντα μπορούν να προγραμματιστούν — ακόμη και παπούτσια ή κουτιά δημητριακών! Γιατί, λοιπόν, να αφήσουμε τη διαμόρφωση του μέλλοντός μας στους άλλους όταν μπορούμε να γίνουμε εμείς οι δημιουργοί και να κάνουμε πραγματικότητα τα οράματα και τις ιδέες μας; Σε τελική ανάλυση, το μόνο όριο είναι η φαντασία μας.",
        "Ο Alessandro Bogliolo, συντονιστής της ομάδας εθελοντών Πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, δήλωσε :",
        "Από την απαρχή του κόσμου, καταφέραμε πολλά πράγματα χρησιμοποιώντας την πέτρα, το σίδερο, το χαρτί και το μολύβι, που μεταμόρφωσαν τη ζωή μας. Σήμερα ζούμε σε μια διαφορετική εποχή όπου ο κόσμος μας διαμορφώνεται ψηφιακά. Σε διαφορετικές εποχές υπάρχει ζήτηση για διαφορετικές θέσεις εργασίας και διαφορετικές δεξιότητες. Κατά την Ευρωπαϊκή Εβδομάδα Προγραμματισμού θέλουμε να προσφέρουμε σε κάθε Ευρωπαίο και σε κάθε Ευρωπαία τη δυνατότητα να ανακαλύψει τον προγραμματισμό και να διασκεδάσει με αυτόν. Ας μάθουμε προγραμματισμό για να διαμορφώσουμε το μέλλον μας",
        "Τέλος, ο προγραμματισμός είναι μια περιζήτητη δεξιότητα σε όλους σχεδόν τους κλάδους —όχι μόνο στον τομέα της τεχνολογίας, αλλά και στους τομείς της οικονομίας, της υγειονομικής περίθαλψης, της επιστήμης, ακόμη και του σχεδιασμού ή της γεωργίας, και η ζήτηση αυξάνεται όλο και περισσότερο. Τα παιδιά που γνωρίζουν πώς να προγραμματίζουν, που κατανοούν πώς λειτουργεί η τεχνολογία, έχουν κάποιο πλεονέκτημα, ανεξάρτητα από την επαγγελματική πορεία που επιλέγουν τελικά.",
        "Νιώθετε να σας εμπνέει?",
        "Λάβετε μέρος στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού!",
        "Χρειάζεστε περισσότερη τροφή για σκέψη?",
        "Για περισσότερες πληροφορίες επισκεφθείτε το ιστολόγιό μας."
    ],
];

