@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>ОТНОСНО СЕДМИЦАТА НА ПРОГРАМИРАНЕТО</h1><span></span></div>

                    <hr>


                    <p>През 2019&nbsp;г. Европейската седмица на програмирането ще се проведе между <strong>5 и 20&nbsp;октомври</strong>.</p>

                    <p>Европейската седмица на програмирането е движение на равнище граждани, което популяризира креативността, решаването на проблеми и сътрудничеството чрез програмиране и други технически дейности. Идеята е да се популяризира програмирането, да се покаже на младите и старите хора как идеите оживяват с помощта на програмирането, тези умения да станат по-ясни и разбираеми и да се съберат на едно място мотивирани хора, които искат да учат.</p>

                    <h2>Организира се от доброволци</h2>

                    <p>Европейската седмица на програмирането се ръководи от доброволци. Един или няколко <a href="/ambassadors">посланици на Седмицата на програмирането</a> координират инициативата в своята страна, но всеки може да организира собствено събитие и да го добави на картата на <a href="/">codeweek.eu</a>.</p>

                    <h2>Подпомага се от Европейската комисия</h2>

                    <p>Инициативата беше стартирана през 2013 г. от експертната група на младите съветници към Програмата в областта на цифровите технологии за Европа. Европейската комисия подпомага Европейската седмица на програмирането като част от своята стратегия за <a href="http://ec.europa.eu/priorities/digital-single-market/">единен цифров пазар</a>. В <a href="https://ec.europa.eu/education/initiatives/european-education-area/digital-education-action-plan_en">Плана за действие за цифрово образование</a> Комисията насърчава специално училищата да се присъединят към инициативата. Целта е да се достигне 50&nbsp;% от всички училища в Европа до 2020&nbsp;г.</p>

                    <h2>Училища</h2>

                    <p>За участие в Европейската седмица на програмирането са поканени специално училища и учители от всички образователни степени, за да дадат възможност на своите ученици да се запознаят с цифровата креативност и с програмирането. Научете повече за инициативата и как да организирате своето събитие чрез уеб страницата, предназначена за учители: <a href="/schools">CodeWeek.eu/Schools</a></p>

                    <h2>Защо програмиране?</h2>

                    <p>Заради Пиа, която мислеше, че трябва да учи право, макар че винаги е харесвала математиката и работата с компютри. Заради Марк, който има идея за по-добра социална мрежа, но не може да я създаде сам. Заради Алис, която мечтае да създава роботи, защото нейните родители не ѝ позволяват да си има котка.</p>

                    <p>Всичко е заради онези от вас, които вече помагат тези мечти да се превърнат в реалност.</p>

                    <p>Всъщност е заради всички нас. Нашето бъдеще. Технологиите предопределят живота ни, но ние позволяваме на малка група хора да решават за какво и как да ги използваме. Можем да правим по-добри неща, не само да споделяме и харесваме разни неща. Можем да превърнем налудничавите си идеи в реалност, да създадем неща, които ще донесат радост на другите.</p>

                    <p>Никога не е било по-лесно да създадеш свое собствено приложение, да си конструираш робот или да изобретиш летящи автомобили, защо не! Пътят не е лесен, но това е път, изпълнен с творчески предизвикателства, подкрепяща общност и изобилие от забавления. Готови ли сте да приемете предизвикателството и да станете творец?</p>

                    <p>Програмирането помага също така за развиването на умения като изчислително мислене, решаване на проблеми, креативност и работа в екип &mdash; наистина добри умения за всички сфери на живота.</p>

                    <p>Алесандро Болиоло, координатор на екипа от посланици на Европейската седмица на програмирането, заяви:<blockquote>
                            <p>&bdquo;Още от древността сме правили много неща с помощта на камък, желязо, хартия и молив, които са преобразили живота ни. Сега живеем в различна епоха, в която светът ни е кодиран. Различните епохи имат различни изисквания за работните места и уменията. По време на Седмицата на програмирането искаме да дадем възможност на всеки европеец да научи за програмирането и да се забавлява с него. Нека се научим да програмираме, за да сътворим бъдещето си&ldquo;.</p>
                        </blockquote>
                    </p>

                    <h2>Седмицата на програмирането в цифри</h2>

                    <p>През 2018 г. 2,7 млн. души в над 70 държави по целия свят взеха участие в Европейската седмица на програмирането. Други 2,3 млн. младежи бяха ангажирани в <a href="http://africacodeweek.org/">Седмицата на програмирането в Африка</a>, която е производна инициатива, управлявана от SAP и от организации с нестопанска цел.</p>

                    <p>Ако вашата държава все още не се е включила, можете да организирате събития и да ги включите в <a href="/events">картата</a> или <a href="mailto:info@codeweek.eu">да станете доброволец</a> като посланик на Европейската седмица на програмирането.</p>

                    <div class="container clearfix">
                        <div class="col_half" id="PeopleChart" style="opacity: 1;width: 100%;text-align: center">
                            <h3 class="center">Участници</h3>
                            <img src="{{asset('img/participation-2018.gif')}}">
                        </div>
                    </div>


                    <h2>Присъединете се към Европейската седмица на програмирането:</h2>

                    <p>Присъединете се към Европейската седмица на програмирането, като <a href="/guide">организирате събитие за програмиране</a> във вашия град, се присъедините към <a href="/codeweek4all">предизвикателството Code Week 4 All</a> и свържете събития, пресичащи общности и граници, или като ни помогнете да разпространим визията на Седмицата на програмирането като <a href="/ambassadors">посланик на Европейската седмица на програмирането</a> за вашата страна!</p>

                    @include("static.toolkits")

                </div>
            </div>
        </div>
    </section>@endsection