@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Станете посланик на Европейската седмица на програмирането</h1><span></span></div>


                    <p><a href="http://events.codeweek.eu/ambassadors/">Посланиците на Европейската седмица на програмирането</a> са основните лица за връзка относно Седмицата на програмирането във всяка държава и помагат за популяризиране на визията на Седмицата на програмирането сред местните общности. Вярвате ли във <a href="/about">визията на Седмицата на програмирането</a> и желаете ли да популяризирате програмирането във вашата държава? Прочетете по-долу!</p>

                    <p><strong>Като посланик на Европейската седмица на програмирането вие ще трябва да можете да отделяте по няколко часа на седмица:</strong></p>
                    <ul>
                        <li>за да се свързвате с хора, дружества и общности, които имат интерес да направят нещо за Седмицата на програмирането;</li>
                        <li>за да насърчавате организатори на събития да добавят свои събития, свързани с програмиране, на уеб сайта на Седмицата на програмирането;</li>
                        <li>за да насърчавате организирането на нови събития във вашата държава чрез популяризиране на Седмицата на програмирането;</li>
                        <li>за да отговаряте на имейли за Седмицата на програмирането на вашия език;</li>
                        <li>за да одобрявате събития на уеб сайта на Седмицата на програмирането за вашата държава;</li>
                        <li>за да поддържате списък на учебни ресурси на езика на вашата държава;</li>
                        <li>за да откривате интересни истории за успех и новини, които да се представят по каналите на Седмицата на програмирането;</li>
                        <li>за да популяризирате материали за Седмицата на програмирането чрез вашата мрежа;</li>
                        <li>за да си сътрудничите с други национални посланици от цяла Европа.</li>
                    </ul>

                    <p><strong>В замяна ще можете:</strong></p>
                    <ul>
                        <li>да се срещате с много интелигентни, интересни хора от различни сфери;</li>
                        <li>да станете важна част от една от най-значимите инициативи на равнище граждани в Европа;</li>
                        <li>да ни помогнете да повишим информираността за важното значение на програмирането и на цялостното цифровизиране на Европа;</li>
                        <li>да добавите званието &bdquo;посланик на Европейската седмица на програмирането&ldquo; към вашата вече удивителна автобиография.</li>
                        <li>Научете се да програмирате! (в случай че все още не можете)</li>
                    </ul>
                    <hr/>
                    <p><strong>Ето какво означава всичко това с малко повече подробности:</strong></p>
                    <ul>
                        <li>Една от нашите цели е да свържем различни мрежи за програмиране и образователни мрежи. <strong>Ако имате информация за провеждането на събития, свързани с програмиране, информирайте организаторите за Седмицата на програмирането и им помогнете да добавят събитието към уеб сайта на Седмицата на програмирането</strong>; така ще изготвим изчерпателен списък на всички събития, свързани с програмиране, в Европа.</li>
                        <li>Освен това се надяваме повече събития да бъдат организирани за Седмицата на програмирането. Можете да помогнете, като <strong>насърчите</strong> <strong>училища, организации, общности на разработчици и ентусиасти да организират нови събития, насочени към начинаещи, във вашата държава</strong>. Не е необходимо това да стане в Седмицата на програмирането, въпреки че това ще бъде идеалното време за нашите промоционални дейности. За да ви помогнем, ние изготвяме списък с предложения за дружества, <a href="http://events.codeweek.eu/guide">ръководство за потенциални организатори на събития</a> и освен това събираме различни други <a href="https://github.com/codeeu/codeeu-resources">промоционални ресурси</a>.</li>
                        <li>Нуждаем се от помощта ви, за да <strong>отговаряме на имейли относно Седмицата на програмирането във вашата държава.</strong> Вие ще бъдете основното звено за връзка за всичко, което се случва във вашата държава, и ще можете да <strong>свързвате хора и дружества от вашата държава, които могат да имат полза от свързване помежду си</strong>, и ще давате отговори на вашия език. Не се тревожете, ако все още не знаете всички отговори, ние сме тук, за да помагаме.</li>
                        <li>Всеки може да добави своето събитие, свързано с програмиране, на <a href="http://events.codeweek.eu">http://events.codeweek.eu</a>, но вие ще сте модераторът за събитията във вашата държава. Всичко, което трябва да правите, е редовно и бързо да<strong> преглеждате подадените събития и да проверявате дали те съответстват на същността на Седмицата на програмирането</strong>.&nbsp;</li>
                        <li>Трябва да е лесно за всеки да организира събитие, свързано с програмиране. Вероятно имате информация за някои полезни материали за онлайн обучение за начинаещи програмисти на вашия език, <strong>така че можете да поддържате списък с ресурси за вашата държава на уеб сайта на Европейската седмица на програмирането</strong>.&nbsp;</li>
                        <li><strong>Предоставяйте интересни новини и съдържание за програмирането от вашата държава</strong>, което ние можем да популяризираме чрез каналите в социалните медии на Седмицата на програмирането. Ние търсим предимно съдържание на английски език;  можете да помогнете, като помолите организаторите да споделят своите истории и полезни съвети на английски език за <a href="http://blog.codeweek.eu">нашия блог</a>. Освен това можете да организирате ваши национални канали в социалните медии на Седмицата на програмирането, за да популяризирате съдържание на вашия език.&nbsp;</li>
                        <li>С ваша помощ ние ще изготвим библиотека с материали на Седмицата на програмирането, които могат да се използват за насърчаване на програмирането като умение. <strong>Нуждаем се от помощта ви, за да разпространим материалите във вашата държава и дори да насърчим различни групи да правят преводи</strong>.&nbsp;</li>
                        <li>Ние създаваме мрежа от национални посланици, които да популяризират Седмицата на програмирането, и също така ще се опитаме да планираме ежемесечни онлайн разговори, за да обсъждаме нашата работа, да обменяме добри практики и да се вдъхновяваме взаимно с идеи за бъдещи дейности. Не е необходимо да присъствате на всички срещи, но се надяваме, че ще можете да се присъединявате колкото се може по-често. Ние също така разполагаме със списък за кореспонденция за посланици на Европейската седмица на програмирането, който можете да използвате по всяко време, за да получите съвет или помощ от други посланици. <strong>Ще имате възможност да разширите собствената си мрежа и да се обогатите със свежи идеи посредством сътрудничество с други посланици от цяла Европа.</strong></li>
                    </ul>

                    <p>Все още ли се интересувате? Желаем да се присъедините към нас! Разгледайте набързо <a href="http://events.codeweek.eu/ambassadors">списъка с посланици на Европейската седмица на програмирането</a>. Ако вашата държава има посланик, не се колебайте да се свържете директно с него и да научите как можете да си сътрудничите. При всяко положение ние ще очакваме да ни пишете на: <a href='mailto:info@codeweek.eu?subject=EU Code Week Ambassador'/>info@codeweek.eu</a>.</p>



                </div>
        </div>

    </section>@endsection