@extends('layout.base') @section('content')<section>

        <div class="container">

            <div class="content-wrap nopadding">

                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Предизвикателството Code Week 4 All</h1><span></span></div>

                    <hr>

                    <p>Предизвикателството Code Week 4 All ви насърчава да свържете вашите събития с тези, организирани от приятели, колеги и познати, и заедно да спечелите сертификат за отлични постижения от Седмицата на програмирането.</p>


                    <simple-question :visible="true">
                        <template slot="title">Какво всъщност е това?</template>
                        <template slot="content">
                            <p>Освен да отбележите събитието си на картата на Европейската седмица на програмирането, можете и да ангажирате други хора в мрежата си, които да направят същото. Ако вие и вашият съюз достигнете един от следните прагове, всички вие ще спечелите сертификат за отлични постижения от Седмицата на програмирането!</p>
                            <p>Критерии за получаване на сертификат за отлични постижения:</p>
                            <ul>
                                <li><strong>да участват 500 ученици</strong></li>И/или<li><strong>10 свързани събития</strong></li>И/или<li><strong>3 включени държави</strong></li>
                            </ul>
                        </template>
                    </simple-question>

                    <simple-question :visible="true">
                        <template slot="title">Как да участвате?</template>
                        <template slot="content">
                            <ol>
                                <li>Посетете страницата <a href="/add">Добавяне на събитие</a> и попълнете необходимите данни за вашето събитие по програмиране.</li>
                            </ol><i>Ако сте първият от вашия съюз:</i><ol start="2">
                                <li>Щракнете върху &bdquo;Изпращане&ldquo;.</li>
                                <li>След като събитието ви бъде прието, ще получите имейл за потвърждение с вашия уникален код за Code Week 4 All.</li>
                                <li>Копирайте кода и го споделете с ваши колеги и други хора от вашата мрежа, които също организират събитие, свързано с програмирането. Разпространете информацията, за да насърчите и други хора да вземат участие!</li>
                                <li>След края на кампанията всички организатори на събития ще бъдат помолени да докладват броя на участниците, които са убедили да се включат в събитията. Ако сте успели да достигнете прага, вие и вашите колеги, които са били част от вашата мрежа, ще получите сертификат за отлични постижения!</li>
                            </ol><i>Ако се присъединявате към съществуващ съюз:</i><ol start="2">
                                <li>Копирайте паролата, която сте получили от инициатора (т.е. създателя на съюза), в полето КОД ЗА CODE WEEK 4 ALL.</li>
                                <li>Щракнете върху &bdquo;Изпращане&ldquo;.</li>
                                <li>Разпространете информацията (и кода!), за да приемете повече организатори във вашия съюз.</li>
                                <li>След края на кампанията всички организатори на събития ще бъдат помолени да докладват броя на участниците, които са убедили да се включат в събитията. Ако сте успели да достигнете прага, вие и вашите колеги, които са били част от вашата мрежа, ще получите сертификат за отлични постижения!</li>

                            </ol>
                        </template>
                    </simple-question>

                    <simple-question :visible="true">
                        <template slot="title">Защо да се присъедините към предизвикателството?</template>
                        <template slot="content">
                            <ul>
                                <li>За да разпространите съобщението за важността на програмирането.</li>
                                <li>За да видите как се включват голям брой ученици.</li>
                                <li>За да изградите връзки с организации и/или училища във вашата общност или в международен план.</li>
                                <li>За да намерите подкрепа от други организатори и учители.</li>
                                <li>За да спечелите <strong>сертификат за отлични постижения.</strong></li>
                            </ul>
                        </template>
                    </simple-question>


                </div>
            </div>
        </div>

    </section>@endsection @section("extra-css")<style> .tab{ position: relative; margin-bottom: 1px; width: 100%; color: #232323; overflow: hidden; } .answer { padding: 20px; background-color: #f1f1f1; } .question{ position: relative; display: block; width: 100%; padding: 0 0 0 1em; background: #2980b9; font-weight: bold; line-height: 3; cursor: pointer; color: #fff; text-align: center; font-size: 2rem; } .chevron{ display: block; margin-top: -23px; padding: 10px; } ul, ol{ margin-left: 1em; } </style>@endsection