@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Присъединете се към Европейската седмица на програмирането и организирайте събития #codeEU</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Регистрирайте събитието си тук</a></div>
                    </div>


                </div>


                <h4><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/codeeu_toolkit.pdf"
                       alt="#codeEU Toolkit"><i class="fa fa-download"></i> Изтеглете пълния набор от инструменти #codeEU в PDF формат</a></h4>
                <h2>Набор от инструменти #codeEU</h2>
                <h2>Какво представлява Европейската седмица на програмирането?</h2>
                <p>Европейската седмица на програмирането е инициатива на равнище граждани, ръководена от доброволци, които популяризират програмирането в своите държави като <a
                            href="/ambassadors">посланици на Седмицата на програмирането</a>. Всеки &mdash; училища, учители, библиотеки, клубове за програмиране, предприятия, публични органи &mdash; може да организира събитие #CodeEU и да го добави към картата <a href="/">codeweek.eu</a>.</p>
                <h2>Кой може да организира събитие за Седмицата на програмирането?</h2>
                <p>Всеки може да организира събитие за Седмицата на програмирането.</p>
                <ul>
                    <li><strong>Деца/тинейджъри/възрастни</strong> могат да организират събития, свързани с програмиране, за да покажат на другите как се твори с програмиране.</li>
                    <li><strong>Училища/следучилищни клубове/центрове за вечерни курсове за възрастни</strong> могат да организират събития за своите ученици. Програмирането онлайн или на живо е забавно и учи на изчислителни умения!</li>
                    <li><strong>Учители и библиотекари</strong>, които се занимават с програмиране, могат да водят часове по програмиране, да споделят плановете на уроците си, да организират семинари за колеги.</li>
                    <li><strong>Учители и библиотекари, които не се занимават с програмиране</strong>, могат да поканят родители или ученици да преподават програмиране на участниците.</li>
                    <li><strong>Програмисти</strong> могат да организират семинари в местни училища, хакерспейсове или общностни центрове и да поканят хора да творят чрез програмиране.</li>
                    <li><strong>Клубове по програмиране</strong> могат да организират семинари за нови участници и да им показват как да създадат игра или приложение с програма.</li>
                    <li><strong>Предприятия и организации с нестопанска цел</strong> могат да бъдат домакини на семинари по програмиране, да изпращат членове на своя персонал като обучители за различни събития, да организират забавни предизвикателства с програмиране, да предлагат спонсорство за събития за програмиране.</li>
                </ul>

                <h2>Какво ви е нужно?</h2>
                <ul>
                    <li><strong>Група хора, които желаят да учат.</strong> Например вашите приятели, деца, тинейджъри, възрастни колеги, родители или баби и дядовци. Запомнете, че двама вече са група!</li>
                    <li><strong>Обучители или преподаватели</strong>, които се занимават с програмиране, знаят как да преподават и да вдъхновяват хора. Броят зависи от вида и мащаба на събитието. За практически семинари може да ви е нужен един обучител за 5&mdash;8 участници, но всичко е относително. Освен това участниците могат да си помагат един на друг! За по-големи събития може да е добре, ако домакинът ви се грижи всички да имат това, което им е нужно, и събитието да протича безпроблемно.</li>
                    <li><strong>Място на провеждане.</strong> Класни стаи, библиотеки, конферентни зали и различни публични пространства са идеални за провеждане на подобни събития.</li>
                    <li><strong>Компютри.</strong> В зависимост от целевата ви група, може да помолите участниците да донесат собствени лаптопи, като в този случай не забравяйте да осигурите достатъчно електрически контакти.</li>
                    <li><strong>Интернет връзка</strong> &mdash; WiFi или фиксирани връзки. Уверете се, че връзките ви ще могат да поемат трафика от групата ви</li>
                    <li><strong>Програмиране на живо.</strong> Всъщност не са ви нужни компютри и интернет връзка, за да се учите на изчислително мислене. Опитайте да програмирате офлайн с нашия инструмент <a
                                href="http://codeweek.it/codyroby/">Cody-Roby</a>.</li>
                    <li><strong>Нещо, с което да работите и да учите.</strong>Покажете на участниците колко може да е забавно да създадат нещо сами. Разгледайте нашия <a href="http://codeweek.eu/resources/">списък с ресурси</a> и потърсете в мрежата съществуващи планове на уроци, програми за семинари и ги адаптирайте към нуждите на групата си. Ако разполагате с компютърно оборудване на място, уверете се, че на него е инсталиран необходимият софтуер и осигурете инструкции на участниците как инсталирането може да се извърши на техните собствени устройства.</li>
                    <li><strong>Регистриране на участници.</strong> Ако местата ви са ограничени, можете да използвате инструменти, като онлайн формуляри от рода на Wufoo, Google Forms или дори страници във Facebook или Eventbrite за събиране на регистрации. Макар ние да предпочитаме събития с безплатно участие, вие можете да удържите малка такса за покриване на разходите за събитието. Или вместо това можете да се обърнете към местни ИТ компании или стартиращи предприятия за спонсорство.</li>
                    <li><a href="/add">Поставете събитието си</a> на <a href="/">картата на Седмицата на програмирането</a>!</li>
                </ul>


                <h2>Как да организирате събитието си?</h2>
                <ul>
                    <li>Форматът на вашето събитие, свързано с програмиране, зависи от вас, но ние препоръчваме да включите <strong>практическа част</strong>, където участниците могат да творят самостоятелно и/или да се упражняват с някакъв хардуер.</li>
                    <li>Можете да използвате всякакви <strong>инструменти и технологии</strong>, каквито харесвате, но ние предпочитаме <a
                                href="http://codeweek.eu/resources/">свободно достъпен материал с отворен код</a>.</li>
                    <li><strong>Усмихвайте се!</strong> Приятелската атмосфера ще разчупи ледовете и ще мотивира ученето.</li>
                    <li><strong>Храна и напитки</strong>. Ако събитието ви продължава няколко часа, участниците ще се нуждаят от почивка. Ако не можете да осигурите храна и напитки, помолете участниците да донесат и споделят помежду си.</li>
                    <li>Помолете участниците да <strong>покажат и представят</strong> какво са създали един на друг в края на събитието. Кара всички да се гордеят!</li>
                    <li><strong>Говорете за събитието си!</strong> Говорете за събитието си в социалните медии. Използвайте #CodeEU и @CodeWeekEU. Говорете пред приятелите си, пред местната преса, направете съобщение за пресата!</li>
                    <li>Не забравяйте да <a href="/add">добавите събитието си</a> на <a href="/">картата на Седмицата на програмирането</a>!</li>
                </ul>


                <h2>Промоционален материал</h2>
                <p>Не се притеснявайте да използвате всяка част от следните съобщения за пресата за вашите собствени маркетингови цели:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/eu-code-week-celebrating-its-5th-birthday-7-22-october-get-ready-join-and-learn-how-create-code">Европейската седмица на програмирането чества 5-ти рожден ден на 7&mdash;22&nbsp;октомври, подгответе се, присъединете се и научете как да творите чрез програмиране!</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/million-coded-in-record-2016-EU-code-week">Нов рекорд на Европейската седмица на програмирането: един милион програмирания по време на изданието за 2016&nbsp;г.</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/save-date-eu-code-week-10-18-october-2015-bringing-ideas-life-codeeu">Европейска седмица на програмирането: превърнете идеите в реалност с #codeEU</a></li>
                </ul>
                <p>Можете също така да използвате <a href="https://github.com/codeeu/codeeu-resources/tree/master/Logo - generic">логото на Европейската седмица на програмирането</a>, при условие че събитието, което планирате, съответства на нашите насоки.</p>


                <h2>Въпроси?</h2>
                <p>Ако имате въпроси относно организирането и популяризирането на вашето събитие #codeEU, се свържете с един от <a href="/ambassadors">посланиците на Европейската седмица на програмирането</a> от вашата държава.</p>


            </div>
        </div>
    </section>@endsection