@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Организирайте ваше събитие с #CodeWeek</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Регистрирайте събитието си тук</a></div>
                    </div>


                </div>


                <h2>Какво представлява Европейската седмица на програмирането?</h2>
                <p>Европейската седмица на програмирането е инициатива на равнище граждани, ръководена от доброволци и подкрепяна от Европейската комисия. Всеки &mdash; училища, учители, библиотеки, клубове за програмиране, предприятия, публични органи &mdash; може да организира събитие #CodeWeek и да го добави към картата <a href="/events">codeweek.eu</a>.</p>


                <h2>Какво ви е нужно, за да организирате събитие?</h2>
                <ul>
                    <li><strong>Група хора, които желаят да учат.</strong> Например вашите приятели, деца, тинейджъри, възрастни колеги, родители или баби и дядовци. Запомнете, че двама вече са група!</li>
                    <li><strong>Учители или преподаватели</strong>, които са запознати със събитието по програмиране и знаят как да преподават и да вдъхновяват хора. Броят зависи от вида и мащаба на събитието.</li>
                    <li><strong>Място на обучението.</strong> Класни стаи, библиотеки, конферентни зали и различни публични пространства са идеални за провеждане на подобни събития.</li>
                    <li><strong>Компютри и интернет връзка.</strong> В зависимост от вашата целева група, можете да помолите участниците да донесат своите собствени лаптопи.</li>

                    <li><strong>Програмиране на живо.</strong> Всъщност не са ви нужни компютри и интернет връзка, за да се учите на изчислително мислене. Разгледайте нашия <a href="/training/coding-without-computers">Модул за обучение на живо</a>, за да започнете.</li>


                    <li><strong>Материали за обучението.</strong> Покажете на участниците колко може да е забавно да създадат нещо сами. Разгледайте нашата <a
                                href="/resources">страница с ресурси</a> и <a href="/training">учебни модули</a> с видео уроци и планове на уроци и ги приспособете към нуждите на вашата група.</li>


                    <li><strong>Регистриране на участници.</strong> Ако местата ви са ограничени, можете да използвате онлайн инструменти от рода на <a href="https://docs.google.com/forms/">Google forms</a> и <a
                                href="https://www.eventbrite.com/">Eventbrite</a> за регистриране на участници.</li>
                    <li>Не забравяйте да <a href="/add">поставите събитието си</a> на <a href="/events">картата на Седмицата на програмирането</a>!</li>
                </ul>


                <h2>Как да организирате събитието си?</h2>
                <ul>
                    <li>Форматът на вашето събитие, свързано с програмиране, зависи от вас, но ние препоръчваме да включите <strong>практическа част</strong>, по време на която участниците могат да творят самостоятелно и/или да се упражняват с някакъв хардуер.</li>
                    <li>Използвайте <strong>инструменти и технологии</strong>, които са подходящи за вашата целева група. Препоръчваме ви да използвате <a href="http://codeweek.eu/resources/">свободно достъпен материал с отворен код</a>.</li>

                    <li>Насърчете участниците да <strong>покажат и представят</strong> какво са създали един на друг в края на събитието.</li>

                    <li><strong>Разпространете новината!</strong> Популяризирайте и споделете в социалните медии това, което сте направили по време на събитието, като използвате хаштага #CodeWeek. Също така можете да споделите в <a
                                href="https://www.facebook.com/groups/774720866253044/">групата на учителите за Европейската седмица на програмирането</a> и в Twitter (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Говорете пред приятелите си, пред колеги преподаватели, пред местната преса, направете съобщение за пресата.</li>

                    <li>Не забравяйте да <a href="/add">добавите събитието си</a> на <a href="/events">картата на Седмицата на програмирането</a>!</li>


                </ul>


                <h2>Рекламни материали</h2>
                <p>Разгледайте нашия <a href="http://blog.codeweek.eu/">блог</a> за последните новини и не се колебайте да адаптирате последното прессъобщение към вашите нужди или да създадете свой собствен блог:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/gearing-celebrate-eu-code-week-2019">Подготовка за отбелязването на Европейската седмица на програмирането 2019&nbsp;г.</a> (предлага се на 29 езика)</li>

                </ul>


                <h2>Изтеглете следните набори от инструменти, които ще ви помогнат да започнете:</h2>
                <ul>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BCommunications%2BToolkit.zip">Комуникационен набор от инструменти</a></li>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BTeachers%2BToolkit.zip">Набор от инструменти за учители</a></li>
                </ul>

                <h2>Въпроси?</h2>Ако имате въпроси относно организирането и популяризирането на вашето събитие #CodeWeek, се свържете с един от <a href="/ambassadors">посланиците на Европейската седмица на програмирането</a> от вашата държава.</div>
        </div>
    </section>@endsection