@extends('layout.base') @section('content')<section>

    <div class="container clearfix">

        <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
            <h1>Политика за поверителност</h1><span>Европейска седмица на програмирането 2018&nbsp;г.</span><ol class="breadcrumb">
			    <li><a href="http://codeweek.eu">Начало</a></li>
			    <li class="active">Политика за поверителност</li>
		    </ol>
	    </div>
    </div>
</section><!-- #page-title end --> <!-- Content --><section id="content">
	<div class="content-wrap">
		<div class="container clearfix">
			<p>Настоящата Политика за поверителност определя начина, по който Европейската седмица на програмирането събира, използва, поддържа и разкрива информация, събрана от потребители (поотделно &bdquo;потребител&ldquo;) на уеб сайта <a href="http://codeweek.eu">http://codeweek.eu</a> (&bdquo;сайта&ldquo;). Настоящата политика за поверителност се прилага за сайта и за всички продукти и услуги, предлагани от Европейската седмица на програмирането.</p>

<p><strong>Лични идентификационни данни</strong></p>

<p>Можем да събираме лични идентификационни данни от потребители по различни начини, включително, но не само, когато потребителите посещават сайта ни и във връзка с други дейности, услуги, функции или ресурси, които предоставяме на сайта си. От потребителите може да бъде поискано, според случая, да посочат име, имейл адрес. Потребителите обаче могат да посещават сайта ни анонимно. Ние ще събираме лични идентификационни данни от потребителите само ако те доброволно ни предоставят тези данни. Потребителите могат винаги да откажат да предоставят лични идентификационни данни; това обаче може да им попречи да участват в някои дейности, свързани със сайта.</p>

<p><strong>Нелични идентификационни данни</strong></p>

<p>Можем да събираме нелични идентификационни данни за потребителите, винаги, когато те си взаимодействат с нашия сайт. Неличните идентификационни данни могат да включват името на браузъра, вида на компютъра и техническа информация за средствата за свързване на потребителя към нашия сайт, като например операционната система и използваните доставчици на интернет услуги, и друга подобна информация.</p>

<p><strong>Бисквитки на уеб браузър</strong></p>

<p>Сайтът ни може да използва &bdquo;бисквитки&ldquo; с цел повишаване на удовлетвореността на потребителя. Уеб браузърът на потребителя поставя бисквитки на неговия твърд диск за целите на воденето на отчетност и понякога с цел проследяване на информация за него. Потребителят може да избере да настрои браузъра си да не приема бисквитки или да го уведомява, когато се изпращат бисквитки. Имайте предвид, че в този случай някои части на сайта може да не функционират правилно.</p>

<p><strong>Как използваме събраната информация</strong></p>

<p>Европейската седмица на програмирането може да събира и използва лична информация за потребителите за следните цели:</p>
<ul>
<li><i>за подобряване на обслужването на клиентите</i>: информацията, която предоставяте, ни помага да отговаряме на исканията за услуги от клиенти и да обслужваме нуждите ви по-ефективно.</li>
<li><i>за персонализиране на опита на потребителя</i>: можем да използваме обобщена информация, за да разберем как потребителите като група използват услугите и ресурсите, предоставени на нашия сайт.</li>
<li><i>за изпращане на периодични имейли</i>: можем да използваме имейл адресите, за да отговаряме на запитвания, въпроси и/или на други искания.</li>
</ul>
<p><strong>Как защитаваме информацията ви</strong></p>

<p>Ние прилагаме подходящи практики за събиране, съхраняване и обработване на данни, както и мерки за сигурност, за защита срещу неразрешен достъп, промяна, разкриване или унищожаване на вашата лична информация, потребителско име, парола, информация за транзакция и съхранение на данни на нашия сайт.</p>

<p><strong>Споделяне на вашите лични данни</strong></p>

<p>Ние не продаваме, не търгуваме и не отдаваме под наем на други лица лични данни на потребители. Можем да споделяме обобщена демографска информация, която не е свързана с лични идентификационни данни, за посетители и потребители с нашите бизнес партньори, доверени филиали и рекламодатели за посочените по-горе цели. Можем да използваме доставчици на услуги трети страни, които да ни помагат да управляваме своята дейност и сайта, или да администрират дейности от наше име, например да изпращат бюлетини или анкети. Ние можем да споделяме вашите данни с тези трети страни за тези ограничени цели, ако вие сте дали своето съгласие за това.</p>

<p><strong>Промени на настоящата политика за поверителност</strong></p>

<p>Европейската седмица на програмирането има право да актуализира настоящата политика за поверителност по всяко време. Когато правим това, ние ще ревизираме датата на актуализация в края на тази страница. Насърчаваме потребителите често да проверяват тази страница за промени, за да се информират как ние помагаме за защитата на личните данни, които събираме. Вие приемате и се съгласявате, че носите отговорност да преглеждате периодично тази политика за поверителност и да се информирате за измененията.</p>

<p><strong>Приемане от ваша страна на тези условия</strong></p>

<p>С използването на този сайт вие давате съгласието си за приемане на настоящата политика. Ако не сте съгласни с настоящата политика, ви молим да не използвате нашия сайт. Ако продължите да използвате сайта след публикуването на промени на настоящата политика, това ще се счете за приемане от вас на тези промени.</p>

<p><strong>Свързване с нас</strong></p>

<p>Ако имате някакви въпроси относно настоящата политика за поверителност, практиките на този сайт или вашите взаимоотношения с този сайт, свържете се с нас на: <a href="mailto:info@codeweek.eu">info@codeweek.eu</a></p>
<p>Този документ беше актуализиран последно на 12&nbsp;октомври&nbsp;2014&nbsp;г.</p>

<div style="font-size:10px;color:gray;">Политика за поверителност, изготвена от <a style="font-size:10px;color:gray;text-decoration:none;cursor:default;" href="http://www.privacypolicies.com" target="_blank">Generate Privacy Policy</a></div>

		</div>
	</div>
</section>@endsection