@extends('layout.base') @section('content')<section id="codeweek-privacy-page" class="codeweek-page">

        <section class="codeweek-content-wrapper" style="margin-top: 0;">

            <h1 style="margin-bottom:10px;">ЗАЩИТА НА ВАШИТЕ ЛИЧНИ ДАННИ</h1>

            <h3><strong>1. Въведение</strong></h3>

            <p>Европейската комисия (наричана по-долу „Комисията“) е ангажирана да защитава личните ви данни и да зачита вашата поверителност. Комисията събира и допълнително обработва лични данни съгласно Регламент (ЕС) 2018/1725 на Европейския парламент и на Съвета от 23 октомври 2018 г. относно защитата на физическите лица във връзка с обработването на лични данни от институциите, органите, службите и агенциите на Съюза и относно свободното движение на такива данни (отменящ Регламент (ЕО) № 45/2001).</p>

            <p>Настоящата декларация за поверителност обяснява причината за събирането и обработването, начина, по който събираме, обработваме и гарантираме защитата на всички предоставени лични данни, как се използва тази информация и какви права можете да упражнявате във връзка с личните ви данни (правото на достъп, коригиране, блокиране и т.н.). Тя също така посочва данните за връзка на отговорния администратор на данни, с когото можете да упражните правата си, длъжностното лице по защита на данните и Европейския надзорен орган по защита на данните.</p>

            <p>Тази декларация за поверителност се отнася до събирането и публикуването на лични данни на публично достъпния уебсайт Codeweek.eu на лица, които служат като звена за контакт за дейностите в рамките на Европейската седмица на програмирането (посланици на Седмицата на програмирането, координатори на Министерството на образованието, водещи учители, както и организатори на дейности и събития).</p>



            <h3><strong>2. Защо обработваме вашите данни?</strong></h3>

            <p>Европейската комисия събира и публикува вашата лична информация, за да улесни идентифицирането на звената за контакт от заинтересовани страни или заинтересовани граждани. Предлагането на реални лица като звена за контакт е най-добрият и най-ефективният начин да се гарантира, че заинтересованите лица могат да се свържат със службите на Комисията.</p>

            <p>Вашите лични данни няма да бъдат използвани за автоматизирано вземане на решения, нито за профилиране.</p>




            <h3><strong>3. На какво(-и) правно(-и) основание(-я) обработваме личните ви данни</strong></h3>

            <p>Операциите по обработване на лични данни за публикуване на звената за контакт са законни съгласно член 5, параграф 1, буква г) от Регламент (ЕС) 2018/1725, защото сте дали съгласието си за обработването на личните ви данни чрез онлайн формуляр или когато сте се съгласили да използваме имейла и потребителското ви име, в случай че сте се регистрирали в социална мрежа.</p>



            <h3><strong>4. Какви лични данни събираме и обработваме допълнително?</strong></h3>

            <p>Събраните лични данни представляват информация, която улеснява вашето идентифициране като звено за контакт и увеличава видимостта ви за обществеността, а именно: официално обръщение, име, фамилия, длъжност, служебен пощенски адрес и имейл, телефонен номер, снимка, акаунт в социалните медии, биография.</p>

            <p>Вие предоставихте тези лични данни доброволно, като попълнихте формуляра за кандидатстване.</p>

            <p>Предоставянето на определени лични данни е задължително за публикуване на дейности и/или информация за връзка на уебсайта codeweek.eu. В случай че не предоставите личните си данни, вашата дейност няма да бъде публикувана и/или няма да имате възможност да участвате в гореспоменатите мрежи.</p>

            <p>Всички други лични данни предоставяте доброволно.</p>



            <h3><strong>5. Колко дълго съхраняваме личните ви данни?</strong></h3>

            <p>Комисията съхранява личните ви данни само за периода, който е необходим за изпълнение на целта на събиране или по-нататъшно обработване, описана в точка 2, а именно дотогава, докато вие служите като звено за контакт.</p>

            <p>Личните ви данни ще бъдат премахнати от публично достъпния уебсайт веднага щом прекратите функцията си на звено за контакт, освен ако не сте дали съгласието си за включване в базата данни за бъдещи дейности.</p>



            <h3><strong>6. Как защитаваме и гарантираме неприкосновеността на личните ви данни?</strong></h3>

            <p>Всички лични данни в електронен формат (имейли, документи, бази данни, качени партиди данни и т.н.) се съхраняват или на сървърите на Европейската комисия, или на нейния изпълнител. Всички операции по обработване се извършват в съответствие с Решение (ЕС, Евратом) 2017/46 на Комисията от 10 януари 2017 г. относно сигурността на комуникационните и информационните системи в Европейската комисия.</p>

            <p>Изпълнителите на Комисията са обвързани със специална договорна клауза относно операциите по обработване на вашите данни от името на Комисията и със задълженията за поверителност, произтичащи от транспонирането на Общия регламент за защита на данните в държавите – членки на ЕС (Регламент (ЕС) 2016/679, „ОРЗД“).</p>

            <p>За да защити личните ви данни, Комисията е разработила и въвела редица технически и организационни мерки. Техническите мерки включват подходящи действия за справяне със сигурността онлайн, риска от загуба на данни, промяната на данни или непозволения достъп, като се вземат предвид рискът, свързан с обработването, и естеството на обработваните лични данни. Организационните мерки включват ограничаване на достъпа до личните данни единствено до упълномощени лица, които имат основателна необходимост да са запознати с целите на операцията по обработване.</p>




            <h3><strong>7. Кой има достъп до вашите данни и на кого се разкриват?</strong></h3>

            <p>Достъп до личните ви данни се предоставя на служителите на Комисията, отговорни за извършването на тази операция по обработване, и на упълномощени служители съгласно принципа „необходимост да се знае“. Такива служители спазват законовите и при необходимост допълнителните споразумения за поверителност.</p>

            <p>По-конкретно, достъп до всички лични данни, които сте предоставили, могат да имат администраторите на уебсайтове (служители на Комисията), както и други служители на Комисията съгласно принципа „необходимост да се знае“. . Освен това личната ви информация и информацията за събитията ще бъдат споделяни с членове на мрежите на посланиците на Европейската седмица на програмирането и на образователните координатори за организиране на дейности на местно ниво или за последващи действия.</p>

            <p>За да се увеличи видимостта на звената за контакт, вашите лични данни се публикуват на публичния уебсайт: https://codeweek.eu без ограничения за достъп.</p>

            <p><i>Относно предаването на данни на трети страни</i></p>

            <p>Информацията, която събираме, няма да бъде предоставяна на трета страна, освен до степента и за целта, която може да бъде изискана от нас по закон.</p>




            <h3><strong>8. Какви са вашите права и как можете да ги упражните?</strong></h3>

            <p>Имате конкретни права в качеството си на „субект на данни“, съгласно глава III (членове 14–25) от Регламент (ЕС) 2018/1725, по-специално правото на достъп, коригиране или изтриване на личните ви данни и правото да ограничите обработването на личните ви данни. Когато е приложимо, вие също имате право да възразите срещу обработването или право на преносимост на данните.</p>
            <p>Вие се съгласихте да ни предоставите личните си данни за настоящата операция по обработване и можете да оттеглите съгласието си по всяко време, като уведомите администратора на данни. Оттеглянето няма да окаже влияние върху законността на обработването, извършено преди да сте оттеглили съгласието.</p>
            <p>Можете да упражните правата си, като се свържете с администратора на данни, а в случай на конфликт – с длъжностното лице по защита на данните. Ако е необходимо, можете да се обърнете и към Европейския надзорен орган по защита на данните. Техните данни за връзка са дадени в раздел 9 по-долу.</p>



            <h3 style="margin-bottom: 10px;"><strong>9. Информация за връзка</strong></h3>

            <h4><strong>– Администратор на данни</strong></h4>

            <p>В случай че желаете да упражните правата си съгласно Регламент (ЕС) 2018/1725 или ако имате коментари, въпроси или притеснения, или ако желаете да подадете жалба относно събирането и използването на личните ви данни, моля, не се колебайте да се свържете с администратора на данни,</p>

            <address style="margin-bottom: 10px;">ГД „Съобщителни мрежи, съдържание и технологии“, Отдел F4<br> Сграда BU25<br> B-1049 Брюксел<br> Имейл <a href="mailto:info@codeweek.eu">info@codeweek.eu</a></address>

            <h4><strong>– Длъжностно лице от Комисията по защита на данните</strong></h4>

            <p>Можете да се свържете с длъжностното лице по защита на данните (<a href="mailto:DATA-PROTECTION-OFFICER@ec.europa.eu">DATA-PROTECTION-OFFICER@ec.europa.eu</a>) по отношение на въпроси, свързани с обработването на личните ви данни съгласно Регламент (ЕС) 2018/1725.</p>

            <h4><strong>– Европейски надзорен орган по защита на данните</strong></h4>

            <p>Имате право да се обръщате (т.е. можете да подадете жалба) към Европейския надзорен орган по защита на данните (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>), ако смятате, че правата ви съгласно Регламент (ЕС) 2018/1725 са нарушени при обработването на личните ви данни от страна на администратора на данни.</p>



        </section>

    </section>@endsection
