<?php

return [
    'remote-teaching' => 'предавање на далечина',
    'intro' => [
        'title' => 'Недела на кодирање и предавање на далечина',
        'text' => 'Образованието на далечина може да биде голем предизвик за наставниците и учениците и постојат многу пречки кои треба да се надминат. Сепак, предавањето на кодирање, компјутерското размислување – дури и роботика – не мора да запре бидејќи вашите ученици се дома. Еве неколку совети и ресурси за кои се надеваме дека можат да ви помогнат.',
        'points' => [
            1 => 'ова е збирка кратки видеа со материјали за самостојна работа, сложувалки, игри и предизвици за кодирање за секојдневна употреба во семејството и на училиште.',
            2 => ['Кодирање без компјутер', 'тука ќе најдете различни активности кои можете лесно да ги направите дома за да научите или да предавате кодирање со секојдневни материјали.'],
            3 => [
                'Делчиња за учење',
                'тука ќе најдете „Делчиња за учење“ или туторијали на Одржлив развој и  Вештачка интелигенција кои во нивните наставни планови вклучуваат делови за настава на далечина.',
            ],
            4 => [
                'Репозиториум на ресурси',
                'многу од ресурсите во репозиториумот исто така можат да се користат и во сценаријата за настава на далечина. Можете да најдете ресурси за да предавате кодирање или да научите кодирање.',
            ],
            5 => [
                'Вебинари за кодирање од дома',
                'дали знаевте дека Неделата на кодирање организираше неколку вебинари за тоа како да научите и да предавате кодирање од дома? Погледнете ги!',
            ],

        ],
    ],
    'tips' => [
        'title' => '7 совети за да научите кодирање на далечина',
        'points' => [
            1 => [
                'Запознајте се со концептите, програмскиот јазик и софтверот',
                'додека учениците можат да учат кодирање и програмирање полу-самостојно по пат на обиди и грешки, ќе треба да ги водите и да им помогнете да ги пронајдат грешките во нивната синтакса. Бидете подготвени за промена и прилагодување доколку дигиталната алатка или програмскиот јазик не ги носи резултатите од учењето што ги очекувавте.',
            ],
            2 => [
                'Охрабрете ги учениците',
                'помогнете им на вашите ученици да го достигнат својот полн потенцијал така што ќе им пружите мотивирачки и значајни лекции. Овозможете им да ги истражат своите вештини и креативност така што ќе им дозволите да ги бираат своите проекти и резултати. Покрај тоа, ви препорачуваме да бидете реални и да поставите цели коишто вашите ученици можат да ги постигнат.',
            ],
            3 => [
                'Охрабрете ги учениците да работат во групи',
                'кодирањето во групи не само што е позабавно, туку исто така ќе им помогне на учениците да постигнат покомплексни и покреативни проекти. Освен тоа, учењето на далечина може да создаде чувство на изолираност кај некои ученици, а работењето во групи ова може да го спречи. На пример, би можеле да создадете онлајн простории за состаноци за вашите ученици да се собираат во групи или би можеле да воспоставите оценување од страна на врсници, поканувајќи ги учениците да даваат и да примаат конструктивни повратни информации за меѓусебните проекти.
', ],
            4 => [
                'Истражете отворен софтвер и бесплатни онлајн платформи за учење за тоа како да се кодира',
                'има многу квалитетни ресурси за учење и предавање на кодирање, кои се напредни, а сепак лесни за користење. Тоа се бесплатни алатки кои можете да им ги дадете на вашите ученици да ги користат без да купуваат лиценци или да преземаат софтвер. Повеќето од нив можете да ги најдете на Репозиториум на Неделата на кодирање, на пр. Scratch, App Inventor, Code.org, EarSketch, Sonic Pi, итн. Како што видовме во Неделата на кодирање Делчиња за учење, можете да ги примените овие алатки на кој било предмет!',

            ],
            5 => [
                'Нека биде забавно',
                'вашите први чекори во кодирањето треба да бидат интересни и забавни, и иако можеби овојпат немате шанса да го споделите уживањето лично, постојат начини да играте и да се забавувате заедно! На пример, можете да им предложите на вашите ученици да се одморат од лекцијата за да се поврзат и да се играат заедно CodyColor, едукативна игра со повеќе играчи дизајнирана да научат компјутерско размислување додека се играат.',

            ],
            6 => [
                'Симулирајте вистинска интеракција во училницата',
                'технологијата ни овозможува да го реплицираме барем делумно, видот на интеракција којшто би се одвивал во училницата. Можете да ги охрабрите вашите ученици да ги вклучуваат своите камери во одредено време, да ги креваат рацете виртуелно, да поставуваат прашања лично или во чет, да одговараат на дигитални анкети и квизови, итн. Некои бесплатни дигитални алатки што можете да ги користите за оваа цел се Zoom, Microsoft Teams, GoToMeeting или Jitsi за сесии во училница во живо, и Kahoot, Mentimeter или Google Forms за квизови и интеракција во училницата. Ова ќе им помогне на учениците да се чувствуваат како да се на час и да се чувствуваат поврзано со своите врсници.',
            ],
            7 => [
                'Обезбедете материјалите да бидат достапни и поволни',
                'проверете дали лекциите за кодирање се реални и инклузивни, така што ќе се осигурите дека материјалите кои се потребни можат лесно да се најдат во секое домаќинство и дека сите ученици можат да дојдат до нив или да овозможите адаптации на оние што не можат. На пример, за активностите за кодирање без дигитална технологија се потребни ефтини материјали, како што се ножици, хартија или маркери. Кога работите со онлајн вежби за кодирање, проверете дали сите ученици имаат пристап дома до таблет или компјутер и до сигурна интернет врска.',

            ],

        ],
        'conclusion' => 'Како учите и предавате кодирање и програмирање во средини за настава на далечина? Дали имате совети за други професионалци во образованието? Додадете коментар во форумот подолу!',
    ],

];
