<?php

return [
    'when-title' => 'Креативність, код і співпраця без обмежень',
    'when-text' => '<p>EU Code Week – це динамічний рух, що надає можливість людям будь-якого віку досліджувати програмування, креативність і розв’язання проблем. Він долає бар’єри у здобутті цифрових навичок, роблячи програмування доступнішим, помітнішим і відкритим для всіх. Від класних кімнат до громадських просторів – ця ініціатива об’єднує освітян, здобувачів освіти та ентузіастів технологій, допомагаючи втілювати ідеї в життя завдяки цифровим інноваціям і зміцнюючи співпрацю по всій Європі.</p>',
    'codeweek_in_numbers-title' => 'Від іскри до руху',
    'codeweek_in_numbers-text' => '<p>Те, що розпочалося у 2013 році як невелика ініціатива на рівні громад, переросло у постійний рух, який охоплює мільйони людей. EU Code Week  тепер є безперервною ініціативою, в межах якої відбуваються тисячі заходів протягом усього року в Європі та за її межами. Двотижнева подія у жовтні стає кульмінацією цих зусиль — святкуванням спільноти, що об’єдналася задля того, щоб зробити програмування, цифрову творчість і STEM-освіту доступними для всіх.</p>
                    <p>Завдяки десяткам тисяч заходів та постійно зростаючій мережі освітян, здобувачів освіти та партнерів, Code Week продовжує надихати на інновації та надавати наступному поколінню навички для формування майбутнього.</p>',
    'run_by_volunteers-title' => 'Підтримується міжнародною спільнотою',
    'run_by_volunteers-text' =>  '<p>EU Code Week реалізується завдяки відданій спільноті освітян, амбасадорів та партнерів, які популяризують програмування по всій Європі. Амбасадори Code Week координують заходи у своїх країнах, а спільнота Провідних викладачів,  що налічує понад 450 педагогів з усієї Європи, заохочує заклади освіти, викладачів і здобувачів освіти організовувати заходи та реєструвати їх на карті <a href="/community?country_iso=ie">Code Week map</a>.
                                </p>
                                <p>Кожен може долучитися, додавши власний захід на карту. Разом ми зробимо програмування доступним для всіх!
                                </p>',
    'supported_by_commission-title' => 'Soutien de la Commission européenne',
    'supported_by_commission-text' => '<p> EU Code Week  був започаткований у 2013 році Молодими радниками з питань цифрового порядку денного Європи. Європейська Комісія підтримує EU Code Week у рамках своєї стратегії для <a href="http://ec.europa.eu/priorities/digital-single-market/">Єдиного цифрового ринку</a>. У <a href="https://education.ec.europa.eu/focus-topics/digital-education/action-plan">Плані дій щодо цифрової освіти</a>Комісія особливо заохочує заклади освіти приєднуватися до цієї ініціативи.
                                        </p>',
    'schools-title' => 'Розширюйте можливості вашого класу!',
    'schools-text' =>  '<p>Педагоги всіх предметів та рівнів освіти відіграють ключову роль у EU Code Week. Долучившись, ви зможете надихнути здобувачів освіти досліджувати програмування та цифрову творчість у захопливий і практичний спосіб. Приєднуйтеся та дізнайтеся, як організувати власний захід на  <a href="/schools">CodeWeek.eu/Schools</a>.
                        </p>',

    'why_coding-title' => 'Чому програмування? Тому що майбутнє — за тобою.',
    'why_coding-text' => '<p>Програмування — це не просто написання коду, а втілення ідей, розв’язання проблем і створення світу, який ти хочеш бачити.
                        </p>
                        <p>Технології оточують нас всюди, і програмування дає кожному змогу перетворювати уяву на реальність — чи то розробка додатків, створення роботів, чи вирішення реальних викликів. Воно розвиває креативність, навички вирішення проблем і співпрацю — компетентності, що відкривають двері у будь-якій сфері.
                        </p>
                        <p>EU Code Week — це ваша можливість досліджувати, творити та стати частиною цифрової трансформації, яка змінює освіту, стимулює інновації та зміцнює спільноти!
                        </p>
                        <p>Віцепрезидент Європейської Комісії Viktor Negrescu говорить про вплив EU Code Week:«Я рішуче підтримую демократизацію доступу до технологій… Якщо ми хочемо, щоб Європа залишалася конкурентоспроможною, нам потрібно інвестувати в цифрові навички. Я впевнений, що консорціум Code4Europe виконає чудову роботу, тож бажаю вам успіхів — і продовжуйте програмувати!»
                        </p>',
    'why_coding-quote' => '<p>Alessandro Bogliolo, coordinateur de l’équipe d’ambassadeurs bénévoles de la Semaine européenne du code, a déclaré:<blockquote>
                            <p>«Depuis la nuit des temps, nous avons mis au point de nombreuses innovations en utilisant la pierre, le fer, le papier et le crayon. Aujourd’hui, nous vivons à une époque différente, régie par la programmation. Une époque différente où les emplois sont différents et exigent de nouvelles compétences. Au cours de la Semaine du code, nous voulons donner à chaque Européen l’occasion de découvrir la programmation et de s’amuser en l’utilisant. Apprenons la programmation pour bâtir notre avenir.»</p>
                        </blockquote>
                    </p>',
    'join_codeweek-title' => 'Стань частиною руху!',
    'join_codeweek-text' => "<p>EU Code Week — це більше, ніж подія, це революція, що рухається спільнотою!  <a href='/guide'>Проведи активність із програмування у своєму місті</a>, прийми челендж  <a href='/codeweek4all'>Code Week 4 All</a>, і об'єднайся з однодумцями з різних країн.
                            </p>
                            <p>Хочете зробити ще більший внесок? Зв'яжіться з локальним хабом<a href='/community?country_iso=ie'>щоб знайти свою спільноту</a> та допомогти формувати майбутнє програмування у своїй країні!
                            </p>
                            <p>Стежте за місцевими ініціативами та міжнародними подіями у нашому  <a href='/blog/'>блозі</a>.
                            </p>",
    'partners_and_sponsors' => 'познайомтеся з нашими партнерами та спонсорами',

    'about_banner_title'=>'Розширення можливостей Європи за допомогою цифрових навичок',
    'about_banner_content'=>'EU Code Week стимулює креативність, вирішення проблем і співпрацю, роблячи програмування та цифрові навички доступними для всіх протягом усього року',
    'partners_and_sponsors-title' => 'Консорціум Code4Europe: Формуємо майбутнє Code Week',
    'partners_and_sponsors-content'=>
                                        '<p>EU Code Week тепер координується консорціумом Code4Europe, до якого входять понад 40 освітніх і технологічних партнерів із 20 країн. Разом ми забезпечуємо подальший розвиток Code Week, розширюючи цифрову освіту та сприяючи співпраці по всій Європі.
                                        </p>
                                        <p>Завдяки потужній спільноті освітян, амбасадорів і лідерів індустрії ми формуємо майбутнє програмування — роблячи його більш доступним, інклюзивним та ефективним.
                                        </p>',
];
