<?php

/*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [
    'languages' => [
        'en' => 'англійська',
        'fr' => 'французька',
        'bg' => 'Болгарська',
        'hr' => 'Хорватська',
        'de' => 'Німецький',
        'pl' => 'польський',
        'cs' => 'чеська',
        'el' => 'грецька',
        'pt' => 'португальська',
        'da' => 'датська',
        'hu' => 'угорська',
        'ro' => 'румунська',
        'nl' => 'голландська',
        'ga' => 'ірландський',
        'sk' => 'словацький',
        'it' => 'італійська',
        'sl' => 'словенська',
        'et' => 'Естонська',
        'lv' => 'латиська',
        'es' => 'Іспанська',
        'fi' => 'фінська',
        'lt' => 'литовський',
        'se' => 'шведська',
        'sv' => 'шведська',
        'al' => 'албанець',
        'ba' => 'боснійський',
        'mk' => 'македонська',
        'me' => 'чорногорський',
        'rs' => 'сербська',
        'mt' => 'мальтійська',
        'tr' => 'турецька',
        'lu' => 'люксембурзький',
        'ua'=> 'Український'
    ],

    'resources_local_title' => 'Ресурси щодо кодування від',
    'days' => 'Дні',
    'hours' => 'Години',
    'minutes' => 'Хвилини',
    'seconds' => 'Секунди',

    'day' => 'День',
    'hour' => 'Година',
    'minute' => 'Хвилина',
    'second' => 'Секунда',

    'still_have_question' => 'Є інше запитання?',
    'drop_us_a_line' => 'Напишіть нам!',
    'get_in_touch' => 'ЗВ’ЯЗАТИСЯ',
    'footer_msg' =>
        'Масові ініціативи, втілені волонтерами за підтримки Європейської комісії.',

    'email' => 'Електронна адреса',
    'display_email' => 'Показати елекстронну адресу',
    'first_name' => 'Ім’я',
    'last_name' => 'Прізвище',
    'your_website' => 'Ваш вебсайт',
    'biography' => 'Біографія',
    'update' => 'Оновити',
    'delete' => 'Видалити',
    'choose a file' => 'Вибрати файл',

    'learning_bits' => 'Навчальні біти',
    'codeweek' => 'Тиждень кодування',
    'bring_codeweek_to_your_students' => 'Розповісти про Тиждень кодування своїм учням',

    'or' => 'або',

    'receive emails' => 'Отримувати електронні листи від нас',
    'newsletter' => 'Бюлетень'

];
