<?php

return [
    'build-calliope' => [
        'title' => 'Сконструюйте свій власний Calliope mini фітнес тренер',
        'author' => 'Amazon Future Engineer | Meet and Code feat. Calliope gGmbH',
        'purposes' => [
            'Для знайомства в ігровій формі з послідовностями, анімацією, повторами та змінними . ',
            'Для розробки структурної схеми . ',
            'Для перевірки та налаштування коду . ',
            'Для оптимізації програми методом проб і помилок, перевірки та налагодження зручності . '
        ],
        'duration' => '20 - 30 хвилин',
        'description' =>
            ' Учасники розроблять прототип цифрового керування, що застосовує різнокольоровий світлодіод для відтворення наперед розроблених 10 фітнес - вправ . ',
        'materials' => [
            'Calliope mini StarterBox(за наявності)',
            'Ноутбук або планшет для того, щоб відвідати сторінки < a href = "https://makecode.calliope.cc" > https://makecode.calliope.cc</a> або <a href="https://calliope.cc">https://calliope.cc</a> , а також YouTube з доступом до навчальних ресурсів.'
        ],
        'instructions' => [
            'Для початку потрібно скласти план вправ і визначити порядок їх виконання. Використовуючи цей розклад, запрограмуйте RGB світлодіод Calliope mini на активацію одного з 5 кольорів із попередньо визначеним темпом. Потім потрібно створити змінну темпу та запрограмувати повтори за допомогою циклів.',
            "Пам’ятайте, якщо ви розробите програму на свій смак, то можете надіслати її нам на адресу info@calliope.cc — ми із задоволенням подивимось, що у вас вийшло! До речі, ми плануємо розіграти 30 Calliope mini серед розробників надісланих програм!",
            "Поділіться QR кодом свого проєкту в Instagram, додайте хештеґ #CodeWeekChallenge і теґніть @CodeWeekEU.",
        ],
        'example' => [
            'Сидячи за комп’ютером ви можете долучитись і до спорту.',
            'Створіть фітнес прототип за допомогою Calliope mini, який також можна перевірити на симуляторі. Завдання виконується в редакторі MakeCode шляхом програмування простої послідовності коду (див. скріншот).',
            'Виберіть 5 різних кольорів і призначте кожному з них фітнес вправу, наприклад, присідання або стрибки. Потім кольори можна налаштувати в будь-якому порядку і потренуватись.'
        ],

    ]

];
