<?php

return [
    'chatbot' => [
        'title' => 'Створіть чат-бот',
        'author' => 'Команда тижня кодування ЄС',
        'purposes' => [
            'Закодувати інтерактивні загадки',
            'Розробити за допомогою коду діалоги між чат-ботом і користувачем'
        ],
        'description' =>
            'Закодуйте розмову між чат-ботом і користувачем, який намагається відгадати загадку. Намагайтеся створити чат-бот, який може спілкуватися як людина. Замість загадки можна створити діалог між чат-ботом і користувачем.',
        'instructions' => [
            'Придумайте загадку',
            'Увійдіть',
            'або створіть новий обліковий запис. (Створюючи новий обліковий запис, пам’ятайте, що використовувати справжні імена в Pencil Code заборонено з причин збереження конфіденційності.)',
            'Натисніть на Imagine («Уявити») та Make your own («Створити своє»)',
            'Для написання загадки використовуйте блоки або текстовий режим',
            'Як варіант, можна використати',
            'цей код',
            'та адаптувати його до своєї загадки або вибрати Answering the Riddle («Відгадати загадку») у меню та відредагувати його'
        ],
        'example' => 'Прогляньте цей приклад загадки.',
        'more' => [
            'Цей код створено на основі вправи Pencil Code',
            'Answering the Riddle'
        ]
    ],

    'paper-circuit' => [
        'title' => 'Кодуйте без ґаджетів: створення електросхеми на папері',
        'author' => 'Команда тижня кодування ЄС',
        'purposes' => ['Поліпшити креативне мислення', 'Розвинути навички вирішення проблем'],
        'description' => [
            'Намалюйте будь-який об’єкт на вибір. Це може бути нічне небо, сонечко, робот, ялинка чи будь-що інше, що спаде вам на думку. Не вагайтеся і персоналізуйте свій проект за допомогою візуальних інструментів Тижня кодування ЄС: ви можете проглянути',
            'набір інструментів Тижня кодування ЄС для вчителя',
            'та звантажити будь-який логотип або візуальний елемент, який забажаєте. Можна навіть створити паперове запрошення на Тиждень кодування ЄС. Додайте до електросхеми мотиваційне повідомлення, яке заохотить інших учителів долучитися до Тижня кодування та/або проглянути сайт, розроблений для шкіл.'
        ],
        'instructions' => [
            'Намалюйте об’єкт та вирішить, які його елементи підсвічуватимуться (напр., зірки).',
            'Проткніть олівцем дірку в аркуші та прикріпіть світлодіодну наліпку в кожному підсвіченому місці.  ',
            'Намалюйте коло, де помістите батарейку-таблетку.',
            'Накресліть напрямки + і-на іншому боці аркуша. Переконайтеся, що довший кінець світлодіодної наліпки буде з’єднано з позитивним полюсом (+) батарейки, а коротший — із негативним (-).',
            'Прокладіть мідну стрічку за напрямками.',
            'Зігніть аркуш паперу так, щоб світлодіод підсвічувався, коли папір вступатиме в контакт із батарейкою. Можна скористатися скріпкою, щоб забезпечити належний контакт із мідною стрічкою.',
            'Сфотографуйте свою електросхему на папері та поділіться нею в Instagram, пояснивши, чому варто взяти участь у цій ініціативі.  '
        ],
        'example' => 'Прогляньте більше прикладів електросхем на папері',
        'materials' => [
            'аркуш паперу або картон',
            'крейда або маркер',
            'батарейка-таблетка',
            'мідна стрічка',
            'світлодіодні наліпки',
            'скріпка'
        ]
    ],

    'dance' => [
        'title' => 'Створіть танець',
        'author' => 'Команда тижня кодування ЄС',
        'purposes' => [
            'Вивчити основні концепції кодування',
            'Навчитися анімувати персонажів'
        ],
        'description' =>
            'У рамках цього виклику ви створите декілька персонажів, які танцюватимуть разом. Ви можете скористатися вбудованою медіатекою (Media Library), щоб вибрати персонажів та музичний супровід, або створити власних. Ваші персонажі оживуть: танцюватимуть і розмовлятимуть один з одним.',
        'instructions' => [
            'Увійдіть',
            'як учитель. Створіть облікові записи для учнів та поділіться ними з учнями. Або поділіться кодом для класу, щоб учні зареєструвалися, використовуючи свою шкільну електронну адресу. Якщо ви учень, то ви можете зареєструватися як учень, але потім вам потрібно буде надати електронну адресу батьків, щоб вони схвалили ваш обліковий запис.',
            'Натисніть',
            'і назвіть проект',
            'Перейдіть до',
            ', щоб додати тло, натиснувши на значок коліщатка. Виберіть тло із Media Library, завантажте своє зображення або зробіть та завантажте власну світлину. Виберіть аудіозапис і додайте його до сцени:',
            'Натисніть на кнопку',
            'та додайте персонажів або об’єкти, яких ви хочете оживити так, щоб вони могли рухатися, розмовляти та взаємодіяти один з одним. Додайте двох або трьох персонажів на вибір. Ви можете намалювати власних персонажів або змінити тих, що є в наявності. Додайте різні вбрання для свого персонажа, натиснувши на значок олівця.',
            'Натисніть на кожного персонажа та оживіть його, додавши такі блоки:',
            'Додайте',
            'блок «говорити» («say»),',
            ', щоб ваші персонажі розмовляли один з одним. Змінюйте форму текстових хмаринок, а також стиль і розмір шрифту'
        ],
        'example' => [
            'Прогляньте',
            'цей приклад',
            'роботів, що танцюють. Можете скористатися ним і переробити його.'
        ]
    ],

    'compose-song' => [
        'title' => 'Створіть музичну композицію',
        'author' => 'Команда тижня кодування ЄС',
        'purposes' => [
            'Навчитися кодувати за допомогою музики',
            'Розрізняти жанри в музиці та музичні інструменти',
            'Створити пісню, змішавши аудіокліпи'
        ],
        'description' =>
            'У рамках цього виклику ви створите музичну композицію, використовуючи мову програмування. Ви можете використовувати готові аудіокліпи, записувати власні та міксувати їх для створення музичної композиції. Запустіть свій код на Цифровій робочій аудіостанції та прослухайте музику, яку ви закодували. Випробуйте різні звуки та ефекти, щоб змінити свою композицію.',
        'instructions' => [
            'Увійдіть',
            'Натисніть тут, щоб створити сценарій',
            'Назвіть свій сценаріїв та виберіть',
            'як мову програмування',
            'Почніть писати код між рядками',
            'та',
            '',
            'Перегляньте музичні кліпи в',
            'Sound Library',
            '(фонотека) і виберіть улюблені музичні жанри, виконавців та інструменти',
            'Щоб додати аудіокліп до пісні, введіть',
            'У круглих дужках повинні бути такі чотири параметри, розділені комами',
            'Аудіокліп',
            'Помістіть курсор між дужками, перейдіть до Sound Library, виберіть кліп і вставте його, натиснувши на синій значок вставлення',
            'Номер треку',
            'позначення треків допомагає організувати звуки за типом інструмента (вокал, бас, ударні, клавішні тощо). Додайте скільки завгодно треків (інструментів). Треки відображаються як рядки в Цифровій робочій аудіостанції',
            'Такт на початку',
            'вказує, коли почати відтворення вашого звуку. Такти — це метричні музичні одиниці. Один такт містить чотири удари',
            'Такт у кінці',
            'вказує, коли завершиться відтворення звуку',
            'Такий рядок коду виглядатиме так',
            'Ви можете додавати різні ефекти, наприклад, гучність, щоб поліпшити звучання своєї композиції. Діапазон гучності становить від -60,0 децибелів до 12,0 децибелів, де 0,0 — вихідна гучність.',
            'Напишіть',
            'У дужках зазначте номер треку, VOLUME, GAIN, рівень гучності, такт на початку, рівень і такт у кінці',
            'Ось приклад ефекту поступового посилення звуку',
            'та ефекту згасання звуку'
        ],
        'example' => [
            'Прослухайте',
            'приклад пісні, закодованої в Earsketch',
            'Ви можете імпортувати код і змінити його'
        ],
        'materials' => [''],
        'more' => ['']
    ],
    'sensing-game' => [
        'title' => 'Створіть гру з відеосенсорами',
        'author' => 'Команда тижня кодування ЄС',
        'purposes' => [
            'Закодувати рухомі об’єкти',
            'Зрозуміти, як контролювати цифрову анімацію за допомогою фізичних рухів',
            'Створити пісню, змішавши аудіокліпи'
        ],
        'description' =>
            'У межах цього виклику ви створите просту гру, яка використовує відеокамеру як датчик для виявлення руху, тобто ви зможете контролювати свою анімацію за допомогою фізичних рухів. Завдання цієї гри — зібрати якомога більше бульок Тижня програмування ЄС за 30 секунд. Замість того, щоб ловити бульки, ви можете створити гру, де ви будете ганятися за персонажем або лопатимете повітряні кульки руками.',
        'instructions' => [
            'Увійдіть у',
            'Натисніть',
            'Add an extension («Додати розширення»)',
            'та виберіть',
            'Video Sensing («Відеосенсор»)',
            'Він визначатиме швидкість руху об’єкта. Що нижчим буде показник, то вищою буде чутливість до руху.',
            'Додайте спрайт. Оберіть звук та додайте його до свого спрайту. За бажанням можна додати',
            'Create a clone («Клонувати»)',
            ', щоб створити дублікат свого спрайту.',
            'Створіть дві змінні: одну для',
            'Score («Результат»)',
            'і одну для',
            'Timer («Таймер»)',
            '— і додайте їх до спрайта. Установіть таймер на 30 і додайте',
            'Change Timer by -1 («Змінити таймер на -1»)',
            'Створіть новий спрайт',
            'Game Over («Гру завершено»)',
            ', щоб завершити гру. Ви також можете створити спрайт із назвою вашої гри, наприклад, «Збери всі бульки Тижня кодування ЄС».'
        ],
        'example' => [
            'Зіграйте гру з відеосенсором «Збери всі бульки Тижня кодування ЄС». Ви можете змінювати',
            'цей проект'
        ]
    ],

    'calming-leds' => [
        'title' => 'Заспокійливі світлодіоди: створення простого пристрою за допомогою micro:bit',
        'author' => 'Micro:bit Educational Foundation',
        'duration' => '20 хвилин',
        'materials' => [
            'пристрій micro:bit та акумулятор (за наявності)',
            'ноутбук або планшет із доступом до Microsoft MakeCode і Youtube',
            'microbit.org із доступом до матеріалів завдання'
        ],
        'description' =>
            'Учні створюють за допомогою світлодіодів цифровий пристрій, який може допомогти їм регулювати дихання та стати спокійнішими. Їм необхідно буде написати простий код, вивчаючи анімацію і послідовності.',
        'instructions' => [
            'Ціль — створити робочий заспокійливий світлодіодний пристрій, який можна використовувати для регулювання дихання. Такий пристрій можна створити на реальній платі micro:bit або в симуляторі редактора MakeCode.',
            'Виклик можна реалізувати за допомогою редактора MakeCode та написання простої послідовності коду, як показано у відеоматеріалі/на скріншоті.',
            'Завдання виклику можна розширити, щоб учні вивчили різні види анімації та проявляли свою креативність у створенні анімації, яка їм допомагатиме заспокоїтися або почуватися щасливими.',
            'Детальніша інформація та відеоінструкції за',
            'цим посиланням'
        ],
        'example' =>
            'На цій сторінці доступні інструкції і відео завершеного виклику та рекомендації щодо кодування',
        'purposes' => [
            'Створити простий цифровий артефакт з корисним призначенням',
            'Вивчити послідовності, анімацію та принципи їхньої роботи',
            'Протестувати та відкоригувати простий код',
            'Поліпшити дизайн, пришвидшуючи або сповільнюючи швидкість анімації'
        ]
    ],
    'computational-thinking-and-computational-fluency' => [
        'title' =>
            'Обчислювальне мислення та обчислювальна грамотність зі ScratchJr',
        'author' => 'Посол Тижня кодування ЄС від Греції Стаматіс Пападакіс',
        'purposes' => [
            'Познайомитися з новими командами та інтерфейсом.',
            'Створювати прості програми з простими причинно-наслідковими командами.',
            'Усувати прості помилки методом спроб і помилок.'
        ],
        'description' =>
            'У рамках цього виклику діти реалізовуватимуть концепції обчислювального мислення у своїх проектах за допомогою застосунку ScratchJr та створюватимуть захопливіші, чарівніші й емоційніші історії.',
        'instructions' => [
            'ScratchJr можуть використовувати діти, які ще не вміють читати. Усі інструкції та пункти меню супроводжують символи і кольори. Виклик можна реалізувати в класі, лабораторії або на відкритому повітрі, оскільки під’єднання до Інтернету не потрібне.',
            'Діти використовують місто як тло, а блоки коду — для переміщення автівки містом.'
        ],
        'example' => [
            'Діти можуть використовувати блоки звуку, блоки руху і блоки перезапуску, аби їхні персонажі танцювали.',
            'Діти можуть вибрати тло і персонажа та скористатися блоком руху, щоб автівка їздила містом. Діти можуть використовувати блок швидкості, щоб сповільнити або пришвидшити рухи персонажа.'
        ],
        'materials' => [
            'Безоплатний застосунок',
            'працює з різними операційними системами і типами розумних пристроїв',
            'На сайті',
            'багато безоплатних навчальних матеріалів'
        ],
        'duration' => '90 хвилин'
    ],
    'ai-hour-of-code' => [
        'title' => 'Година кодування зі ШІ',
        'author' => 'Minecraft Education Edition',
        'purposes' => [
            'Розробити рішення для кодування, що охоплюють послідовності, події, цикли й умови',
            'Перетворити кроки, необхідні для вирішення проблеми, на точну послідовність інструкцій',
            'Вивчити концепції кодування'
        ],
        'description' =>
            'Селу загрожує пожежа, тому вам необхідно закодувати рішення! Познайомтеся зі своїм помічником із кодування агентом Minecraft і запрограмуйте його так, аби він понишпорив у лісі і зібрав дані. Ці дані допоможуть агенту передбачати місця виникнення пожеж. Потім закодуйте агента так, щоб він допоміг запобігти поширенню пожежі, врятував село та повернув ліс до життя. Вивчіть основи кодування та перегляньте приклад роботи штучного інтелекту в реальному світі.',
        'instructions' => 'Звантажте план уроку тут',
        'materials' => [
            'Установіть Minecraft: Education Edition',
            'Після встановлення Minecraft Education Edition виклик буде доступний на',
            'цьому сайті'
        ]
    ],
    'create-a-dance' => [
        'title' => 'Створіть танець під «Оду кодуванню» з Dance Party',
        'purposes' =>
            'Весело попрактикувати кодування та відчути зв’язок зі спільнотою Тижня кодування ЄС.',
        'description' => [
            'Створити танець під «Оду кодуванню»! Скористайтеся',
            'навчальними матеріалами Dance Party',
            'для кодування танцю під «Оду кодуванню». Офіційний гімн Тижня кодування ЄС є в добірці Dance Party.'
        ],
        'instructions' => [
            'Інструкції викладено у формі відео в',
            'навчальних матеріалах',
            'та прописано на початку кожного рівня'
        ],
        'example' =>
            'Вибрані роботи учнів доступні на сторінці',
        'materials' => 'Навчальні матеріали на code.org'
    ],
    'create-a-simulation' => [
        'title' => 'Створіть симуляцію!',
        'purposes' => [
            'Дізнатися про симуляції, застосовуючи такі змінні: створення натовпу, темпи одужання, носіння маски та вакцинація.',
            'Задіяти раніше здобуті знання про спалахи вірусу в реальному світі, застосовуючи їх до вигаданого сценарію.'
        ],
        'description' =>
            'Написати код для створення власної симуляції спалаху вірусу в Місті чудовиськ і управління нею. Навчитися кодувати та прогнозувати події, що трапляться із сусідами Міста чудовиськ.',
        'instructions' => [
            'Інструкції викладено у формі відео в',
            'навчальних матеріалах',
            'та прописано на початку кожного рівня'
        ],
        'example' =>
            'Після виконання завдання можна поділитися своєю симуляцією з іншими . Поділіться своєю думкою про те, що ми можемо зробити, аби допомогти іншим не підхопити вірус, коли він охопить місто . ',
        'materials' => 'Навчальні матеріали на code . org',
        'more' => ['']
    ],
    'create-your-own-masterpiece' => [
        'title' => 'Створіть власний шедевр!',
        'audience' => 'Для всіх вікових груп',
        'purpose' =>
            'Візуально познайомитися з концепціями комп\'ютерних наук та отримати натхнення творити',
        'description' =>
            'Створіть власний шедевр з художником! Використовуйте блоки коду, аби художник міг створити унікальний витвір мистецтва.',
        'instructions' => 'Інструкції викладено на початку кожного рівня',
        'example' => 'Приклади художника доступні на цій сторінці',
        'materials' => ['Перший рівень навчальних матеріалів доступний', 'ТУТ']
    ],
    'cs-first-unplugged-activities' => [
        'title' => 'Завдання CS First без ґаджетів',
        'purposes' => [
            'Підтримати учнів, які навчаються вдома',
            'Перепочити від ґаджетів'
        ],
        'description' =>
            'CS First без ґаджетів — набір завдань, у рамках яких учні знайомляться з концепціями комп’ютерних наук без комп’ютера. Ми розробили цей урок, аби показати: комп’ютерні науки — це значно більше, ніж просто кодування.',
        'instructions' => [
            'Пам’ятка для виконання всіх завдань англійською мовою доступна за цим',
            'посиланням',
            ', а план уроку англійською мовою — за цим',
            'Завдання цього уроку можна виконувати самостійно та в будь-якому порядку',
            'Учитель може фотографувати навчальний процес та поділитися світлинами в Instagram, використовуючи #CodeWeekChallengeGoogle'
        ],
        'materials' => [
            'Щоб завершити деякі завдання, необхідно або рекомендують використовувати, окрім пам’ятки для виконання завдання, додаткові матеріали.',
            'Невеликі фішки (наприклад, сушена квасоля) для карти «З’єднай місця по сусідству».',
            'Ножиці, щоб вирізати шифрувальне колесо для надіслання таємного повідомлення',
            'Картон та клей, щоб додати міцності шифрувальному колесу для надіслання таємного повідомлення.',
            'Канцелярська кнопка, зубочистка або випрямлена скріпка для з’єднання шифрувального колеса для надсилання таємного повідомлення.'
        ]
    ],
    'family-care' => [
        'title' => 'Турбота сім’ї',
        'experience' => 'Доступно для всіх',
        'duration' => '5–10 годин',
        'author' => '',
        'purposes' => [
            'Дослідити питання турботи сім’ї, з яким ми стикаємося щодня;',
            'Поглянути на проблеми як на можливості і знайти креативні рішення;',
            'Застосувати код, щоб реалізувати свої рішення по-новому;',
            'Підготувати плакати та представити свої рішення іншим;',
            'Зчинити своїми проектами вплив, використовуючи соціальні мережі.'
        ],
        'description' => [
            'Що спадає вам на думку, коли ми розмовляємо про дім? Гарний будинок? Багата вечеря, що її приготували батьки? Своя таємна місцина? Теплота дому дозаправляє наші тіло і дух, як паливо — автомобіль. У веремії сьогодення батьки постійно працюють. Не можна залишити своїх дітей на самоті, щоб відпочити з друзями. Та як наглядати за ними, коли ви не разом? Тема виклику — ',
            '«Турбота сім’ї»',
            'Цією темою учнів заохочують придумати, як виразити любов і турботу за допомогою кодування та апаратного забезпечення. Ось декілька питань для роздумів',
            'Скільки членів у вашій сім’ї? Хто вони? Чи виникали у вас проблеми під час спільного проживання з ними? Якої турботи вони потребують?',
            'Ви знаєте когось, хто потребує турботи сім’ї понад усе у вашій спільноті? Як ви можете їм допомогти?'
        ],
        'instructions' => [
            'Обмізкувати і дослідити тему турботи сім’ї',
            'Скласти перелік будь-яких проблем',
            'Розробити можливі рішення',
            'Вибрати рішення',
            'Створити і запрограмувати структуру',
            'Підготувати плакат зі схемою свого проекту',
            'Представити його своїм учителям і членам сім’ї'
        ],
        'example' => ['Приклади доступні тут', 'і'],
        'materials' => [
            'Інструмент кодування:',
            'або звантажте',
            'версію для ПК',
            'mBlock — мова програмування на основі Scratch',
            'Цей виклик також базується на MakeX Global Spark Competition, проектній програмі креативного дизайну для дітей віком від 6 до 13 років.',
            'Команда-учасниця повинна зосередитися на конкретній темі та розробити рішення шляхом програмування програмного забезпечення і конструювання апаратного забезпечення.',
            'Учні можуть реалізувати виклик протягом Тижня кодування, представити його на міжнародному рівні, де поспілкуються з іншими студентами, та виграти призи.',
            'Для отримання детальнішої інформації перейдіть за посиланням:',
            'або напишіть нам за'
        ],
        'more' => ['']
    ],
    'virtual-flower-field' => [
        'title' => 'Виростіть власне віртуальне поле квітів',
        'author' =>
            'Тренерка Meet and Code та учасниця команди SAP Snap! Ядґа Хюґлє',
        'duration' => '30–60 хвилин',
        'purposes' => [
            'Познайомитися з програмуванням через простий, але виразний проект.',
            'Дізнатися, що кодування може бути естетичним та давати красиві результати.',
            'Зробити осінь яскравішою за допомогою кольорових квітів та Тижня кодування ЄС.',
            'Показати розмаїття квітів на Землі.',
            'Зробити свій внесок у реалізацію Цілей сталого розвитку, зокрема цілі 13 «Боротьба зі зміною клімату», створюючи заходи з кодування для підвищення рівня просвіти щодо зміни клімату шляхом підвищення рівня обізнаності в цій темі.'
        ],
        'description' =>
            'Розробити програму в Snap!, , у якій можна виростити віртуальне поле квітів різних сортів та з різною кількістю пелюсток.',
        'instructions' => [
            'Якщо не знаєте, із чого розпочати реалізацію виклику, то перегляньте ',
            'це відео',
            'або',
            'цей документ',
            'і повторіть',
            'Виклик можна реалізувати, запрограмувавши віртуальне поле квітів у Snap! (або Scratch) та поділившись скріншотом або світлиною з результатом онлайн.',
            'На полі квітів повинні рости різні сорти квітів із різною кількістю пелюсток. Ідеально, щоб квіти запрограмували, тобто створили, багаторазово проставляючи відбитки пелюсток та повертаючи (або малюючи та повертаючи) їх.',
            'Опублікуйте зображення свого віртуального квіткового саду з #MeetandCode.'
        ],
        'materials' => [
            'Ми рекомендуємо використовувати',
            ', але проект також працює в'
        ]
    ],
    'haunted-house' => [
        'title' => 'Будинок із привидами в Геді',
        'author' =>
            'Феліне Германс, Лейденський університет; Рамон Мурлеґ I&I; Тиждень кодування в Нідерландах',
        'audience' => 'Педагоги',
        'duration' => '1 або 2 години залежно від рівня наявних знань',
        'purposes' => [
            'Створити інтерактивну історію про будинок із привидами.',
            'Навчитися програмуванню з Геді.'
        ],
        'description' =>
            'Із Геді ви створите історію про будинок із привидами з інтерактивними елементами. Щоразу коли запускається код, створюватиметься нова історія. Ваш комп’ютер може також прочитати історію вголос, нею можна поділитися онлайн.',
        'instructions' => [
            'Відкрийте браузер та перейдіть на hedycode.com.',
            'Дотримуйтесь інструкцій для рівнів 1‒4. Скористайтеся вкладками Level («Рівень») та Haunted house («Будинок із привидами»).',
            'За допомогою цих рівнів ми напишемо інтерактивну історію про будинок із привидами.',
            'План уроку для вчителів доступний',
            'тут,',
            'Запис презентації Геді від Феліне Германс доступний за',
            'цим посиланням'
        ],
        'example' => 'Приклад будинку з привидами на рівні',
        'materials' => ['Про Геді на', 'рівні 1‒4'],
        'more' => ['']
    ],
    'inclusive-app-design' => [
        'title' => 'Інклюзивний дизайн застосунку',
        'author' => 'Apple Education',
        'duration' => '60 хвилин + додаткові завдання за бажанням',
        'purposes' => [
            'Обмізкувати ідею із застосунком, який би був доступний та зрозумілий для всіх, розробити його, створити прототип та поділитися ним . '
        ],
        'description' =>
            'Великі застосунки народжуються з великих ідей . У рамках цього заходу учні вигадають ідею застосунку на тему, яка їх цікавить, та дізнаються, як розробити застосунок, який би був інклюзимним і доступним . ',
        'instructions' => [
            'Усі інструкції доступні за цим посиланням',
            'За цим планом уроку тривалістю 1 година педагоги розкажуть учням, як',
            'Навчитися створювати інклюзивний дизайн застосунків',
            'Обмізкувати теми, які їх цікавлять, і роздобути ідею застосунку',
            'Окреслити свої ідеї застосунку та спланувати завдання для користувачів',
            'Створити прототип однієї частини свого застосунку в Keynote',
            'Поділитися демоверсіями своїх прототипів та описати, як вони підтримують користувачів різного рівня підготовки і з різними можливостями'
        ],
        'materials' => [
            'Ознайомтеся із заходом з інклюзивного дизайну застосунків у Apple Teacher Learning Center',
            'Рекомендуємо встановити Keynote на iPad або Mac, але це не обов’язково . '
        ]
    ],
    'silly-eyes' => [
        'title' => 'Смішні очі',
        'author' => 'Raspberry Pi Foundation',
        'duration' => '25 хвилин',
        'purposes' => [
            'Створити проект, взаємодіючи з користувачем . ',
            'Персоналізувати проект за допомогою кольорів і графічних ефектів . ',
            'Дізнатися про дизайн у середовищі цифрового творення . '
        ],
        'description' =>
            'У межах цього проекту ви розробите і створите персонажа зі смішними очима . Великі смішні очі вашого персонажа слідкуватимуть за курсором мишки, оживляючи його . ',
        'instructions' => 'Повний опис проекту доступний тут',
        'example' => 'Перегляньте проекти Gobo, Under the sea та Don\'t eat donut'
    ],
    'train-ai-bot' => [
        'title' => 'Навчіть бота зі ШІ!',
        'author' => '',
        'purposes' =>
            'Дізнатися про штучний інтелект (ШІ), машинне навчання, навчальні дані та упередження, досліджуючи питання етики та способи використання ШІ для вирішення глобальних проблем.',
        'description' =>
            'Навчіть бота зі ШІ разом зі «ШІ для океанів». У рамках цього заходу ви запрограмуєте або навчите ШІ (штучний інтелект) ідентифікувати рибу та сміття. Очистьмо океан!',
        'instructions' => [
            'Інструкції викладено у формі відео в навчальних матеріалах',
            'та прописано на початку кожного рівня'
        ],
        'example' => '',
        'materials' => [
            'Навчальні матеріали доступні тут',
            'Ці навчальні матеріали доступні 25 мовами'
        ],
        'more' => ['']
    ],
    'build-calliope' => [
        'title' => 'Сконструюйте свій власний Calliope mini фітнес тренер',
        'author' => 'Amazon Future Engineer | Meet and Code feat. Calliope gGmbH',
        'purposes' => [
            'Для знайомства в ігровій формі з послідовностями, анімацією, повторами та змінними . ',
            'Для розробки структурної схеми . ',
            'Для перевірки та налаштування коду . ',
            'Для оптимізації програми методом проб і помилок, перевірки та налагодження зручності . '
        ],
        'duration' => '20-30 хвилин',
        'description' =>
            ' Учасники розроблять прототип цифрового керування, що застосовує різнокольоровий світлодіод для відтворення наперед розроблених 10 фітнес-вправ . ',
        'materials' => [
            'Calliope mini StarterBox(за наявності)',
            'Ноутбук або планшет для того, щоб відвідати сторінки <a href="https://makecode.calliope.cc">https://makecode.calliope.cc</a> або <a href="https://calliope.cc">https://calliope.cc</a> , а також YouTube з доступом до навчальних ресурсів.'
        ],
        'instructions' => [
            'Для початку потрібно скласти план вправ і визначити порядок їх виконання. Використовуючи цей розклад, запрограмуйте RGB світлодіод Calliope mini на активацію одного з 5 кольорів із попередньо визначеним темпом. Потім потрібно створити змінну темпу та запрограмувати повтори за допомогою циклів.',
            "Пам’ятайте, якщо ви розробите програму на свій смак, то можете надіслати її нам на адресу info@calliope.cc — ми із задоволенням подивимось, що у вас вийшло! До речі, ми плануємо розіграти 30 Calliope mini серед розробників надісланих програм!",
            "Поділіться QR кодом свого проєкту в Instagram, додайте хештеґ #CodeWeekChallenge і теґніть @CodeWeekEU.",
        ],
        'example' => [
            'Сидячи за комп’ютером ви можете долучитись і до спорту.',
            'Створіть фітнес прототип за допомогою Calliope mini, який також можна перевірити на симуляторі. Завдання виконується в редакторі MakeCode шляхом програмування простої послідовності коду (див. скріншот).',
            'Виберіть 5 різних кольорів і призначте кожному з них фітнес вправу, наприклад, присідання або стрибки. Потім кольори можна налаштувати в будь-якому порядку і потренуватись.'
        ],

    ]
];