<?php

return [

    'title' => 'Задача «Code Week 4 All»',
    'text' => 'Задача «Code Week 4 All» («Тиждень кодування для всіх») заохочує вас об’єднувати свої заходи із заходами, що їх організували друзі, колеги та знайомі, і  здобути разом сертифікат про досконалість.',
    'what' => [
        'title' => 'Що це?',
        'content' => '<p>
 Окрім додання свого заходу на карту Тижня кодування ЄС, Ви також можете залучити інших до своєї мережі, аби вони зробили так само. Якщо ви зі своїм об’єднанням досягнете одного із зазначених нижче порогів, то всі учасники об’єднання отримають сертифікат про досконалість від Тижня кодування !
                    </p>
                    <p>
Критерії для отримання сертифіката про досконалість:
                    </p>',
        'criteria2' => 'об’єднано 10 заходів (від 10 різних організаторів)',
        'criteria3' => 'залучено 3 країни',
 'or' => 'або',
    ],
    'howto' => [
        'title' => 'Як взяти участь?',
 'content' => 'Перейдіть на сторінку <a href="/add">Додати захід</a> та внесіть необхідні дані про свій захід із кодування.',
        'first_alliance' => [
            'title' => 'Якщо Ви перший учасник об’єднання:',
            '1' => 'Натисніть «Надіслати».',
            '2' => 'Щойно Ваш захід буде схвалено, Ви отримаєте електронний лист-підтвердження з унікальним кодом від «Code Week 4 All».',
            '3' => 'Скопіюйте код та поділіться ним зі своїми колегами та іншими людьми з Вашої мережі, які також організовують захід із кодування. Поширюйте інформацію, щоб заохотити інших до участі!',
            '4' => 'Після завершення кампанії всі організатори заходів повинні відзвітувати про кількість залучених ними учасників. Якщо Вам вдалося досягти порогу, то Ви з колегами, які є частиною Вашої мережі, отримаєте Сертифікат про досконалість!'
        ],
        'existing_alliance' => [
            'title' => 'Якщо Ви долучаєтеся до вже створеного об’єднання:',
            '1' => 'Вставте код, який Ви отримали від ініціатора — особи, яка створила об’єднання — у поле «КОД ДЛЯ „CODE WEEK 4 ALL“».',
            '2' => 'Натисніть «Надіслати».',
            '3' => 'Поширюйте інформацію (і код!),  аби більше організаторів долучилося до вашого об’єднання.',
            '4' => 'Після завершення кампанії всі організатори заходів повинні відзвітувати про кількість залучених ними учасників. Якщо Вам вдалося досягти порогу, то Ви з колегами, які є частиною Вашої мережі, отримаєте сертифікат про досконалість!'
        ]
    ],
    'why' => [
        'title' => 'Навіщо долучатися до задачі?',
        '1' => 'Щоб розповісти про важливість  кодування.',
        '2' => 'Щоб залучити велику кількість учнів.',
        '3' => 'Щоб налагодити зв’язки з організаціями та/або школами у своїй громаді і на міжнародному рівні.',
        '4' => 'Щоб отримати допомогу від інших організаторів та вчителів.',
        '5' => 'Щоб отримати <strong>сертифікат про досконалість.</strong>'
    ],

];
