<?php

return [
    'titles' => [
        'Спільнота',
        'Посли',
        'Провідні вчителі',
        'Освітні координатори',
        'Волонтер Тижня кодування ЄС',
    ],
    'intro' => [
        'Тиждень кодування ЄС висловлює подяку широкій міжнародній спільноті волонтерів. На цій сторінці Ви можете знайти членів спільноти, які працюють у Вашій країні',
        'Головною опорою Тижня кодування ЄС є посли, провідні вчителі та представники міністерств освіти країн ЄС та Західних Балкан — освітні координатори.',
        'Дізнайтеся більше про місцеву спільноту, вибравши свою країну:',
    ],
    'ambassadors' => 'Посли Тижня кодування ЄС — основні контактні особи Тижня кодування в кожній країні, що допомагають поширювати бачення Тижня кодування на місцевому рівні. Посли об’єднують людей, компанії та спільноти, які зацікавлені в підтримці Тижня кодування ЄС. Вони заохочують організаторів реєструвати заходи з кодування на карті Тижня кодування та сприяють всеосяжній участі у Тижні кодування ЄС. Посли перевіряють та затверджують заходи у своїй країні. Посли також працюють зі своїми колегами в інших країнах та проводять регулярні зустрічі для обговорення шляхів подальшого розвитку ініціативи.',
    'leading-teachers' => 'Провідні вчителі — активна спільнота , що охоплює понад 450 освітян повсюди у Європі. Вони допомагають об’єднувати школи, вчителів та учнів, які зацікавлені в участі у Тижні кодування, та заохочують  організовувати заходи і реєструвати їх на карті Тижня кодування. Провідні вчителі проводять вебінари на тему професійного розвитку своєю рідною мовою та є орієнтиром для інших вчителів у своїй країні та в Європі. Вони також підтримують ініціативу на місцевому рівні.',
    'cta' => 'Якщо Ви учитель, то можете знайти на карті провідних учителів поруч з Вами і зв’язатися з ними.',
    'edu' => 'Освітні координатори Тижня кодування ЄС — це співробітники міністерств освіти або інших органів освіти та освітніх організацій, які беруть участь у Тижні кодування ЄС. Освітні координатори зміцнюють підвалини ініціативи, підтримуючи вчителів та школи по всій країні. Це передбачає спілкування зі школами, які вже беруть участь у Тижні кодування ЄС, щоб дізнатися про їхні передові практики та обмінятися досвідом. Освітні координатори також підтримують школи, які хочуть взяти участь в ініціативі, надаючи наявні ресурси, навчальні матеріали та можливості у межах спільноти.',
    'volunteer' => [
        'Вам не потрібно мати офіційну роль у Тижні кодування ЄС, щоб стати частиною руху. Кожний може організувати заходи, щоб навчати людей кодуванню, робототехніці, ремонту апаратного забезпечення, 3D-друку тощо, надихати на таке, а також може запропонувати свій захід ',
        'на карті',
        'Але якщо Ви бажаєте пожертвувати свій час для сприяння кодуванню і поділяєте',
        'бачення',
        'та',
        'цінності',
        'Тижня кодування ЄС, то потенційно Ви можете стати провідним учителем або послом.',
        'Якщо Ви освітянин, який любить навчати та навчатися кодуванню так палко, як і ми, то Ви можете отримати детальнішу інформацію про роль та переваги провідних вчителів',
        'тут',
        'Ви можете подати заявку, щоб стати провідним учителем, заповнивши цю',
        'онлайн-форму.',
        'Візьміть до уваги, що кількість провідних вчителів фіксована для кожної країни, тому наразі заявки відкрито лише для окремих країн.',
        'Якщо Ви хочете сприяти кодуванню в своїй країні, то ознайомтеся з',
        'обов’язками послів',
        'і перегляньте список послів Тижня кодування ЄС.',
        'Якщо у Вашій країні є посли, зв’яжіться безпосередньо з ними та дізнайтеся, як найкраще Ви можете підтримати ініціативу. Якщо у Вашій країні нема послів,  напишіть на адресу info@codeweek.eu.',
    ],
    
    'hub_UA' => 'NGO Junior Achievement Ukraine',
    'hub_level_UA' => 'National Hub',
    'hub_desc_UA' => 'це неурядова організація, яка сприяє розвитку підприємництва, фінансової грамотності та цифрових навичок серед молоді. В рамках консорціуму Code4Europe ми реалізуємо ініціативи, спрямовані на покращення цифрової грамотності та розвиток ІТ-талантів в Україні. Наша діяльність зосереджена на організації освітніх заходів, хакатонів, тренінгів для викладачів та створенні можливостей для молоді через партнерство з провідними ІТ-компаніями.',
    'slider_info' => 'Жвава мережа педагогів, волонтерів та амбасадорів, яка рухає EU Code Week уперед. Об’єднуйтесь, співпрацюйте й надихайте наступне покоління цифрових новаторів у вашій країні — і за її межами.',
];
