<?php

return [
    'title' => 'Повідомлення про авторське право',
    'training' => [
        0 => 'Сайт Тижня кодування ЄС для шкіл',
        1 => '— це сервіс, підтримуваний Європейською комісією',
    ],
    'licence' => [
        0 => 'Якщо інше не зазначено, то контент, викладений на цьому сайті, ліцензовано за',
        1 => 'https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en',
        2 => 'ліцензією Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)',
    ],
    'creative-commons' => 'Ліцензування за ліцензіями від Creative Commons саме по собі не впливає на право власності на авторське право',
    'third-party' => 'На контент із сайтів третіх сторін розповсюджуються обмеження авторського права таких третіх сторін; перейдіть на сайт походження контенту, щоб отримати детальнішу інформацію',

];
