<?php

return [
    'common' => [
        'resources' => 'Ресурси, що знадобляться вам',
        'soundtrack' => 'Саундтрек Тижня кодування',
        'moves' => 'Рухи',
        'dance-example' => 'Приклад танцю Тижня кодування',
        'organizer-guide' => 'інструкція організатора',
        'scratch-tutorial' => 'Посібник #EUCodeWeekDance Scratch',
    ],

    'dance' => [
        'title' => 'Танець Тижня кодування',
        'subtitle' => 'Хто сказав, що програмісти не вміють танцювати? ',
        'section1' => [
            'title' => 'Хто може долучитися?',
            'content' => [
                'Усі школи, усіх вчителів, усі бібліотеки, клуби кодування, бізнес та публічні органи запрошують відзначити Тиждень кодування ЄС 2020, організувавши захід #EUCodeWeekDance та додавши його на',
                'карту Тижня кодування',
            ],
        ],
        'section2' => [
            'title' => 'Як взяти участь?',
            'content' => "Виберіть щось із п'яти видів заходів або приходьте зі своїм. Який захід ви б не вибрали, не забудьте додати його на нашу карту",
        ],
        'activity1' => [
            'title' => 'Запрограмуйте друга або батьків без комп’ютера',
            'subtitle' => 'Кодування дозволяє вам віддавати команди електронному пристрою. Та технічно вам не потрібен комп’ютер для кодування. Долучайте близьку людину — однокласника, друга, батьків або навіть вчителя — та ознайомте її з інструкціями з виконання #EUCodeWeekDance, яких необхідно суворо дотримуватися',
            'resources' => [
                'Посібник від Code.org для організування своєї танцювальної вечірки без ґаджетів',
                'Навчальний біт про програмування власного робота-людини',

            ],
        ],

        'activity2' => [
            'title' => 'Візуальне програмування',
            'subtitle' => 'Закодуй власний танець Тижня кодування в Scratch. Використовуйте персонажів Тижня кодування або створіть власних персонажів в Scratch та запрограмуйте на виконання #EUCodeWeekDance',
            'resources' => [
                'Приклад проекту #EUCodeWeekDance в Scratch',
                'Персонажі Тижня кодування',
                'Посібник від Code.org про анімування персонажа',
                'Посібник від  Code.org для організування своєї танцювальної вечірки',
                'Поділіться своїм проектом з нами в Scratch Studio.',
            ],
        ], 'activity3' => [
            'title' => 'Текстове програмування',
            'subtitle' => 'Створіть тему #EUCodeWeekDance на Python або JavaScript, використовуючи платформи для створення музики на основі коду, наприклад, EarSketch або Sonic Pi',
            'resources' => [
                'Посібник про створення музики з EarSketch',
                'Посібник про створення музики з Sonic Pi',

            ],
        ],
        'activity4' => [
            'title' => 'Робототехніка',
            'subtitle' => 'Запрограмуйте свого робота на дотримання ваших інструкцій та виконання танцю Тижня кодування',
            'resources' => [
                'Посібник про програмування роботів',
            ],
        ], 'activity5' => [
            'title' => 'Виклик «Танцюй на живо»',
            'subtitle' => 'Запишіть відео, як ви, ваша команда або ваш робот виконують #EUCodeWeekDance, поділіться ним в Instagram і спробуйте виграти призи від Тижня кодування! Цікаво? Дотримуйтеся таких інструкцій:',
            'resources' => [
                'Запишіть відео в Instagram Stories',
                'Стежте за',
                '@CodeWeekEU в Instagram',
                'Згадайте @CodeWeekEU у своїй історії з танцем та не забудьте поставити гештеґ #EUCodeWeekDance',
            ],
        ],
        'outro' => [
            'Переможців обиратимуть щодня та оголошуватимуть на нашому каналі Instagram через Stories. Тож не забувайте регулярно перевіряти свої повідомлення, можливо, сьогодні вам пощастить',
            'Подію #EUCodeWeekDance створено на основі',
            '«Оди коду»',
            ', яку написав Брендан Паоліні, і танцю, який придумала Б’янка Марія Берарді в 2015 році, за ідеєю професора в галузі комп’ютерних систем Урбінського університету Алессандро Больйоло',
        ],

    ],
    'treasure-hunt' => [
        'title' => 'Полювання на скарби Тижня кодування',
        'subtitle' => [
            'Ця гра в Telegram є достатньо простою для початківців, але разом із тим не дає розслабитися досвідченим учасникам',
            'Полювання на скарби Тижня кодування',
            '— гра, яку найкраще грати на комп’ютері і з мобільним телефоном в руках. Завдання гри — здолати виклики кодування та дізнатися історію кодування, комп’ютерних наук і технологій у Європі',
        ],
        'section' => [
            'title' => 'Щоб розпочати гру, вам необхідно',
            'content' => [
                'Звантажити застосунок Telegram. Він доступний для',
                'настільних комп’ютерів',
                'Гру можна грати на комп’ютері, ноутбуку або в смартфоні. Ми рекомендуємо грати гру на комп’ютері, а в застосунку Telegram у телефоні отримувати інструкції та долати виклики кодування',
                'Щоб грати,',
                'відкрийте гру',
                'і відскануйте QR-код, за допомогою якого ви потрапите в Telegram і отримаєте перші інструкції',
                'Щоб отримати перемогу, вам необхідно здолати 10 викликів кодування та знайти 10 місць на карті Європи, пов’язаних із виникненням кодування і технологій',
                'Після завершення гри поділіться своїм результатом із друзями, використовуючи #EUCodeWeek, та запросіть їх зіграти і дізнатися історію кодування. Цікаво, хто отримає кращий результат',
                '«Полювання на скарби Тижня кодування» — це віртуальна версія гри «Полювання на скарби Тижня кодування ЄС», що її розробив професор у галузі комп’ютерних систем Урбінського університету Алессандро Больйоло. Щоб дізнатися більше про гру-першоджерело, перейдіть у наш',
                'блог',

            ],
        ],
    ],

    'get-involved' => [
        'title' => 'Як долучитися',
        'subtitle' => 'Не можете дочекатися, щоб приступити до кодування? Якщо у вас є бажання долучитися до спільноти Тижня кодування ЄС, але ви не знаєте, із чого почати, то прогляньте ці ресурси. Вони допоможуть вам розпочати — саме вчасно, аби встигнути взяти участь у щорічному святкуванні в жовтні',
        'content' => [
            'Знайомство з Тижнем кодування',
            'Як додати захід Тижня кодування',
            'Навчальні біти',
            'Масовий відкритий онлайн-курс Deep Dive',
            'Серія Coding@Home',
        ],
    ],

];
