<?php

return [
    'educational_resources_text' => "Запрошуємо ! Тут ви знайдете добірку безкоштовних ресурсів, розроблених для підтримки вашої навчальної подорожі!",
    'share_your_resources_button' => "Поділіться своїми ресурсами",
    'share_your_resources_title' => "Маєте безкоштовні та відкриті освітні ресурси?",
    'share_your_resources_text' => "Поділіться ними зі спільнотою EU Code Week! Надішліть свої безкоштовні ресурси за допомогою форми нижче, і ми представимо їх на цій сторінці, щоб допомогти іншим вчитися, творити та розвиватися.",
    'share_your_feedback_button' => "Поділіться своїм відгуком",
    'share_your_feedback_text' => "Розкажіть нам, що ви думаєте! Поділіться своїми відгуками про існуючі ресурси – незалежно від того, чи є у вас пропозиції щодо вдосконалення, коментарі чи нові ідеї, ми будемо раді почути від вас!",  
];
