<?php


return [

    'title' => 'Інструкція',
    'organise_activity' => 'Організуй власний захід з #EUCodeWeek',
    'register_activity' => 'Зареєструй свій захід тут',
    'what' => [
        'title' => 'Що таке Тиждень кодування ЄС?',
        'content' => '<p>
 Тиждень кодування ЄС — це масовий рух, утілюваний волонтерами та підтримуваний Європейською комісією. Будь-хто — школи, вчителі, бібліотеки, клуби кодування, бізнес, публічні органи — можуть організувати захід #EUCodeWeek та додати його на <a href="/events">codeweek.eu</a> карту.
                </p>'
    ],
    'what_you_need_organise' => [
        'title' => 'Що потрібно, щоб організувати захід?',
        'items' => [
            '1' => '<strong>Група людей, які прагнуть навчатися.</strong> Наприклад, ваші друзі, діти, підлітки, дорослі колеги, батьки, бабусі та дідусі.  Пам’ятайте: двоє —це вже група!',
            '2' => '<strong>Учителі або тренери,</strong> які знайомі із заходом із кодування та мають досвід навчати і надихати інших. Їх кількість залежить від типу і масштабу заходу.',
            '3' => '<strong>Місце для навчання.</strong> Класи, бібліотеки, конференц-зали та різні публічні приміщення будуть чудовим місцем для проведення заходу',
            '4' => '<strong>Інтернет і комп’ютери.</strong> Зважаючи на свою цільову групу, ви можете попросити учасників прийти зі своїми ноутбуками.',
            '5' => '<strong>Кодування без ґаджетів.</strong> Загалом вам не потрібні комп’ютери та Інтернет, щоб опанувати обчислювальне мислення. Прогляньте для початку наш <a href="/training/coding-without-computers">Навчальний біт без ґаджетів</a>.',
            '6' => '<strong>Навчальні матеріали.</strong>

 Покажіть учасникам, наскільки весело створювати щось самому. Прогляньте нашу <a
 href="/resources">сторінку з ресурсами</a>
                        і <a href="/training">навчальні біти</a> з відеоінструкціями та планами уроків і адаптуйте їх до потреб своєї групи.',
            '7' => '<strong>Реєстрація учасників.</strong> Якщо у вас обмаль місця, то ви можете скористатися онлайн-інструментами, як <a href="https://docs.google.com/forms/">форми Google</a> та <a
 href="https://www.eventbrite.com/">Eventbrite,</a> для реєстрації учасників.',
            '8' => 'Не забудьте <a href="/add">закріпити свій захід</a> на <a href="/events">карті Тижня кодування</a>!'
        ]
    ],
    'how_to' => [
        'title' => 'Як організувати свій захід?',
        'items' => [
            '1' => 'Ви самі вибираєте формат для свого заходу з кодування, але ми рекомендуємо включити <strong>практичну частину,</strong>, де учасники зможуть творити самостійно та/або попрацювати з апаратним забезпеченням.',
            '2' => 'Скористайтеся <strong>інструментами і технологіями</strong>, що підходять для вашої цільової групи. Ми рекомендуємо використовувати <a href="http://codeweek.eu/resources/">загальнодоступні відкриті матеріали</a>.',
            '3' => 'Заохочуйте учасників to <strong>показувати та презентувати</strong> свої витвори один одному в кінці заходу.',
            '4' => '<strong>Поширюйте новини!</strong> Рекламуйте те, що ви створили під час заходу, та діліться цим у соціальних мережах, використовуючи гештеґ  #EUCodeWeek. Також діліться в <a
 href="https://www.facebook.com/groups/774720866253044/">групі вчителів Тижня кодування ЄС </a>
 і в Twitter
                        (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Розмовляйте зі своїми друзями, педагогами-колегами, місцевою пресою та випускайте пресрелізи.',
            '5' => 'Не забувайте <a href="/add">додавати свої заходи</a> на <a href="/events">карту Тижня кодування</a>!'
        ]
    ],
    'material' => [
        'title' => 'Рекламні матеріали',
        'text' => '<p>Прогляньте наш <a href="http://blog.codeweek.eu/">блог,</a> щоб дізнатися свіжу інформацію, та без вагань адаптовуйте свіжі пресрелізи до своїх потреб або створюйте нові.</p>',
    ],

    'toolkits' => [
    'title' => 'Звантажуйте такі набори інструментів, що допоможуть вам розпочати роботу:',
    'communication_toolkit' => 'Набір комунікаційних інструментів',
    'teachers_toolkit' => 'Набір інструментів учителя',
],
    'questions' => [
    'title' => 'Питання?',
    'content' => '<p>Якщо у вас є запитання щодо організації та реклами заходу #EUCodeWeek,  зв’яжіться з одним із <a href="/ambassadors">послів Тижня кодування ЄС</a> вашої країни.</p>'
]

];