<?php

return [
    'about' => 'Тиждень кодування ЄС — це масова ініціатива, мета якої — донести кодування та цифрову грамотність до <span class="blue-color">кожного</span> весело та захоплююче…',
    'when' => '14-27 жовтня 2024 року',
    'when_text' => 'Вивчення кодування допомагає нам зрозуміти довколишній світ, що швидко змінюється. Долучайтеся до мільйонів однодумців - організаторів й учасників - щоб надихати до розвитку навичок кодування та обчислювального мислення, щоб досліджувати нові ідеї та винаходити інновації для майбутнього.',
    'school_banner_title' => 'Долучайтеся!',
    'school_banner_text' => 'Ви вчитель?',
    'school_banner_text2' => 'Дізнайтеся, як долучитися!',
    'organize_activity_title' => 'Організувати захід або долучитися до заходу',
    'organize_activity_text' => ' Кожен може організувати захід або долучитися до нього. Просто виберіть тему і цільову аудиторію <a href="/add">та додайте свій захід</a> на <a href="/events">карту</a> або перегляньте заходи у своєму районі.',
    'get_started_title' => 'Розпочати',
    'get_started_text' => 'Не знаєте, як розпочати? Перегляньте <a href="/guide">сторінку з інструкціями</a> та завантажте наші <a href="/toolkits">набори інструментів для організаторів,</a> щоб підготуватися і розповсюдити інформацію.',
    'access_resources_title' => 'Отримати доступ до ресурсів і тренінгів',
    'access_resources_text' => 'Якщо Ви не знаєте, як організувати захід, перейдіть на нашу <a href="/resources/teach">сторінку з ресурсами для вчителів</a> і <a href="/training">навчальними бітами,</a> щоб отримати інструкції та спеціальні плани уроків.',
];
