<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'title' => 'Згенеруйте сертифікати про участь для свого класу',
    'phrase1' => 'Заповніть форму, зазначивши прізвища та імена учнів через кому, й отримайте сертифікати про участь для кожного учня',
    'names' => [
        'label' => 'Прізвища та імена для сертифікатів',
        'help' => 'Прізвище та ім’я кожного учасника відділяйте комою',
    ],
    'event_name' => [
        'label' => 'Назва заходу',
        'help' => 'Назва вашого заходу, яку буде вказано в сертифікаті',
    ],
    'event_date' => [
        'label' => 'Дата проведення заходу',
        'help' => 'Дата проведення вашого заходу, яку буде вказано в сертифікаті',
    ],
    'submit' => 'Згенерувати сертифікати',
    'thanks_page' => [
        'title' => 'Сертифікати згенеровано!',
        'phrase1' => 'Натисніть на це посилання, щоб звантажити файл zip з усіма сертифікатами',

    ],
];
