<?php

return [
   
    'podcasts-text' => 'Приєднуйтесь до експертних думок про програмування та цифрову креативність!',
    'podcasts-series-text1' => 'Ласкаво просимо до серії подкастів EU Code Week. Ми наближаємо програмування, обчислювальне мислення, робототехніку та інновації до вас, вашої спільноти та вашого закладу освіти.',
    'podcasts-series-text2' => "Приєднуйтесь до Ар'яни Блажич, Євгенії Казарієго та Ейріні Сімеоніду, які досліджують широкий спектр тем, від медіаграмотності до робототехніки, за допомогою гостей-експертів – щоб надати своїм учням навички, необхідні для протистояння викликам і можливостям, пов'язаним із цифровим майбутнім.",

];