<?php

return [
    'subtitle' => 'У цій заяві про захист міститься інформація про опрацювання і захист Ваших персональних даних.',
    'processing-operation' => [
        'Операція опрацювання',
        'управління послами Тижня кодування, провідними вчителями та реєстрація заходів на сайті'
    ],
    'data-processors' => [
        'Розпорядники персональних даних',
        'GOPA Com. S.A. і EUN Partnership AISBL (European Schoolnet), info@codeweek.eu'
    ],
    '1-intro' => [
        'Інформація щодо опрацювання персональних даних для управління послами Тижня кодування, провідними вчителями та реєстрації заходів на сайті.'
    ],

    '3-legal_process' => [
        'Законність операції опрацювання: Відділ G.2 збирає, зберігає та опубліковує Ваші персональні дані, тому що Ви дали явну згоду, поставивши відповідну відмітку під час реєстрації, щоб стати послом Тижня кодування чи провідним учителем, або під час подання заявки на реєстрацію події на <a href="https://codeweek.eu/register">Тиждень кодування ЄС.</a>',

    ],
    '4-collect_data' => [
        '<strong>Обов’язкові</strong> персональні дані, що підлягають збору, для <strong>послів і провідних учителів</strong>:',
        'прізвище та ім’я',
        'електронна адреса',
        'пароль',
        'світлина',
        'біографія',
        'звання',
        'спеціалізація для провідних учителів.',
        'Для <strong>реєстрації заходу обов’язковими</strong> персональними даними, що підлягають збору, є:',
        'назва організації',
        'тип організації',
        'контактна електронна адреса',
        'Надання цих даних є обов’язковим для того, щоб стати послом Тижня кодування, провідним учителем або щоб зареєструвати захід на сайті Тижня кодування ЄС.',
        'Окрім того, <strong>посли та провідні вчителі</strong> можуть <strong>добровільно</strong> надати такі персональні дані:',
        'облікові записи в соціальних мережах',
        '<strong>Організатори заходів</strong> можуть <strong>добровільно</strong> надати такі дані:',
        'загальна електронна адреса',
        'вебсайт організатора',
        'код для участі в «Code Week for All»',
        'Організатори заходів, зауважте, що відповідний посол Вашої країни або Відділ G.2 може використовувати персональні дані, які Ви надали для реєстрації заходу, щоб зв’язатися з Вами з питань зазначеного заходу.',
        'Ви надали свої персональні дані на',
        'сторінці входу на сайт Тижня кодування',
        'та на',
        'сторінці реєстрації заходу.',
    ],
    '5-how_long' => [
        'Усі персональні дані буде видалено з баз даних у разі Вашої відмови від ініціативи або через п’ять років після завершення ініціативи.',
    ],

    '6-protect_data' => [
        'Усі персональні дані в електронному форматі (електронні листи, документи, бази даних, завантажені пакети даних тощо) зберігають на серверах Європейської комісії або її підрядників. Усі операції опрацювання виконують відповідно до <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?qid=1548093747090&uri=CELEX:32017D0046">Рішення Комісії (ЄС, Євратом) 2017/46</a> від 10 січня 2017 року про безпеку комунікаційних та інформаційних систем Європейської комісії.',
        'Підрядники Комісії діють відповідно до конкретного договірного положення щодо операцій опрацювання Ваших даних від імені Комісії та зобов’язань щодо конфіденційності, що випливають із імплементації Загального регламенту про захист даних (‘GDPR’ <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32016R0679">Regulation (EU) 2016/679</a>).',
        'Для того щоб захистити Ваші персональні дані, Комісія вжила низку технічних та організаційних заходів. Технічні заходи охоплюють відповідні дії з реагування на питання безпеки в режимі онлайн, ризик втрати даних, зміни даних або несанкціонований доступ, зважаючи на ризик, що його становить опрацювання, та характер персональних даних, які опрацьовуються. Організаційні заходи передбачають обмежений доступ до персональних даних виключно уповноважених осіб, у яких є законна службова необхідність для цілей такої операції опрацювання.',
    ],
    '7-access_data' => [
        'Персонал Комісії може отримати доступ до всіх персональних даних, які Ви надали, на основі принципу службової необхідності. Окрім того, доступ до Ваших персональних даних також надано нашому підрядникові на основі принципу службової необхідності.',
        'З метою поліпшення видимості посла Тижня кодування, провідного вчителя або зареєстрованих заходів, усі Ваші персональні заходи оприлюднено на цьому <a href="https://codeweek.eu/">сайті</a>.',
        'Окрім того, Відділ G.2 може поділитися Вашими контактними даними з будь-яким представником громадськості або зацікавленою особою, якій потрібно зв’язатися з Вами з питань Тижня кодування. Організатори заходів, зауважте, що відповідний посол Вашої країни або Відділ G.2 може використовувати персональні дані, які Ви надали для реєстрації заходу, щоб зв’язатися з Вами з питань зазначеного заходу.',
    ],
    '8-rights' => [
        'Ви дали згоду надати Ваші персональні дані Відділу G.2 для виконання цієї операції опрацювання. Ви можете відкликати свою згоду в будь-який час, повідомивши про це Відділ G.2 за CNECT-G2@ec.europa.eu. Таке відкликання не вплине на законність опрацювання, яке здійснили до того, як Ви відкликали згоду.',
    ],

    '10-detailed-info' => [
        'Цю конкретну операцію опрацювання включено до публічного реєстру Співробітника з питань захисту даних за таким номером повідомлення у попередній версії: DPR-EC-02631 Управління контактними пунктами щодо політик, програм і проектів DG CONNECT.'
    ]
];