<?php

return [
    'title' => 'ЗАХИСТ ВАШИХ ПЕРСОНАЛЬНИХ ДАНИХ',
    'processing-operation' => [
        'Операція опрацювання',
        'Опрацювання персональних даних на codeweek.eu, у тому числі IP-адреси, відвідувачами загальнодоступних сайтів.',
    ],

    'data-controller' => [
        'Контролер даних',
        'Європейська комісія, Генеральна дирекція комунікаційних мереж, контенту і технологій, підрозділ G.2.',
    ],
    'record-reference' => 'Номер запису',
    'table-of-contents' => 'Зміст',

    '1-intro' => [
        'title' => 'Вступ',
        'items' => [
            '1' => 'Європейська комісія (далі — «Комісія») зобов’язана захищати Ваші персональні дані та поважати Ваше приватне життя. Комісія збирає та далі опрацьовує персональні дані відповідно до <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv:OJ.L_.2018.295.01.0039.01.ENG&toc=OJ:L:2018:295:TOC">Регламенту Європейського парламенту і Ради (ЄС) 2018/1725</a> від 23 жовтня 2018 року про захист фізичних осіб стосовно опрацювання персональних даних інституціями, органами, офісами та агентствами Союзу і про вільний рух таких даних (та про скасування Регламенту (ЄС) № 45/2001).',
            '2' => 'У цій заяві про захист пояснено причину опрацювання Ваших персональних даних, спосіб збирання нами всіх наданих персональних даних, поводження з ними та забезпечення їх захисту, спосіб використання такої інформації та права, які у Вас є у зв’язку з Вашими персональними даними. У ній також зазначено контактні дані відповідального контролера даних, через якого Ви можете реалізувати свої права, співробітника з питань захисту даних та європейського інспектора із захисту даних.',
            '3' => [
                'Інформацію щодо операції опрацювання',
                '«Опрацювання даних на codeweek.eu»',
                ', яку проводить Комісія, викладено нижче.',
            ],
        ],
    ],
    '2-why' => [
        'title' => 'Чому та як ми опрацьовуємо Ваші персональні дані?',
        'items' => [
            'Мета операції опрацювання',
            'Генеральний директорат Європейської комісії з комунікаційних мереж, контенту і технологій пропонує низку зовнішніх сайтів. За допомогою технічних налаштувань Ваші персональні дані збираються та опрацьовуються, щоб мати змогу забезпечити сайти, які фізично знаходяться за межами інфраструктури хостингу, яку контролює Комісії.',
            'Ваші персональні дані не будуть використані для автоматичного ухвалення рішень, у тому числі профілювання.',
        ],
    ],
    '3-legal_process' => [
        'title' => 'На яких правових підставах ми опрацьовуємо Ваші персональні дані?',
        'items' => [
            'Ми опрацьовуємо Ваші персональні дані на основі таких підстав:',
            '<strong>стаття 5(1)(a) Регламенту (ЄС) 2018/1725</strong>: таке опрацювання <span style="text-decoration: underline">необхідне для втілення завдання,</span> що виконується в інтересах суспільства або при здійсненні офіційних повноважень, покладених на інституцію або орган Союзу.',
            'Так інформування широкої громадськості є завданням, що випливає з власних прерогатив Європейської комісії на інституційному рівні, як передбачено статтею 58(2) (d) Регламенту (ЄС, Євратом) 2018/1046 Європейського парламенту та Ради від 18 липня 2018 року щодо фінансових правил, які застосовуються до загального бюджету Союзу  (Офіційний вісник L 193, 30.7.2018, стор. 1). Ми забезпечуємо впровадження належних та конкретних захисних заходів для опрацювання персональних даних відповідно до чинного законодавства щодо персональних даних.',
            '<strong>Стаття 5(1)(d) Регламенту (ЄС) 2018/1725:</strong> для операцій з обробки, що складаються з файлів cookie та автентифікації, Ваша <span style="text-decoration: underline">згода</span> необхідна. Відповідно до статті 3(15) і статті 7 Регламенту (ЄС) 2018/1725, згода повинна бути вільно надана, конкретна, поінформована та однозначна.',
            'Ми отримуємо згоду безпосередньо від Вас. Ви можете надати згоду електронною поштою, через електронну форму реєстрації або будь-яким іншим способом у письмовій формі.',
        ],
    ],
    '4-collect_data' => [
        'title' => 'Які персональні дані ми збираємо та далі опрацьовуємо?',
        'items' => [
            'Для <strong>виконання цієї операції з обробки</strong>, підрозділ G.2 збирає наступні категорії персональних даних:',
            'адреса Інтернет-протоколу (IP-адреса) або ідентифікаційний номер пристрою, використаного для доступу до сайту.',
            'Без такого опрацювання неможливо буде встановити технічний зв’язок між Вашим пристроєм і серверною інфраструктурою та отримати доступ до сайту.',
            'Щоб Ви могли <strong>автентифікуватися на цьому вебсайті</strong>, підрозділ G.2 збирає наступні категорії персональних даних:',
            'електронна адреса',
            'пароль; або',
            'автентифікація в соціальних мережах.',
        ],
    ],
    '5-how_long' => [
        'title' => 'Скільки часу ми зберігаємо Ваші персональні дані?',
        'items' => [
            'Підрозділ G.2 зберігає Ваші персональні дані лише протягом часу, необхідного для виконання мети збору або подальшої обробки, а саме, протягом сеансу перегляду. Окрім того, IР-адреси можуть у цілях безпеки зберігатися протягом одного року в файлах журналу служб. Щодо аналітичних інструментів, то IР-адреса та ідентифікаційний номер (напр., номер IMEI й адреса WIFI MAC) видаляються відразу після від’єднання.',
        ],
    ],
    '6-protect_data' => [
        'title' => 'Як ми захищаємо та убезпечуємо Ваші персональні дані?',
        'items' => [
            'Усі персональні дані в електронному форматі (електронні листи, документи, бази даних, завантажені пакети даних тощо) зберігають на серверах Європейської комісії. Усі операції опрацювання виконують відповідно до',
            'рішення Комісії (ЄС, Євратом) 2017/46',
            'від 10 січня 2017 року про безпеку комунікаційних та інформаційних систем Європейської комісії.',
            'Для того, щоб захистити Ваші персональні дані, Комісія вжила низку технічних та організаційних заходів. Технічні заходи охоплюють відповідні дії з реагування на питання безпеки в режимі онлайн, ризик втрати даних, зміни даних або несанкціонований доступ, зважаючи на ризик, що його становить опрацювання, та характер персональних даних, які опрацьовуються. Організаційні заходи передбачають обмежений доступ до персональних даних виключно уповноважених осіб, у яких є законна службова необхідність для цілей такої операції опрацювання.',

        ],
    ],
    '7-access_data' => [
        'title' => 'У кого є доступ до Ваших персональних даних, кому їх розкривають?',
        'items' => [
            'Доступ до Ваших персональних даних надано працівникам Комісії, відповідальним за виконання цієї операції опрацювання, та уповноваженим працівникам на основі принципу службової необхідності. Такий персонал дотримується передбачених законом вимог та, за необхідності, додаткових угод про конфіденційність.',
            'Окрім того, доступ до Ваших персональних даних може бути надано зовнішнім підрядникам, які працюють від імені служби Комісії, що є власником сайту, і за договорами підряду з нею, та яких залучено до створення сайтів, їх обслуговування, управління ними і їх архівування, на основі принципу службової необхідності.',
            'Інформацію, яку ми збираємо, не передаватимуть третім особам, окрім випадків, коли цього вимагає від нас законодавство у певному обсязі та для певних цілей.',
        ],
    ],
    '8-rights' => [
        'title' => 'Які у Вас права, як Ви можете їх реалізувати?',
        'items' => [
            'Відповідно до глави ІІІ (статті 14‒25) Регламенту (ЄС) 2018/1725, у Вас є конкретні права як у суб’єкта даних, зокрема право на доступ, виправлення або стирання своїх персональних даних та право на обмеження опрацювання Ваших персональних даних. За доцільності, у Вас також є право на заперечення проти опрацювання персональних даних та право на мобільність даних.',
            'У Вас є право на заперечення проти опрацювання Ваших персональних даних, яке здійснюється на законних підставах відповідно до статті 5(1)(a).',
            'Ви дали згоду надати свої персональні дані для виконання цієї операції опрацювання. Ви можете відкликати свою згоду в будь-який час, повідомивши підрозділ G.2. Таке відкликання не вплине на законність опрацювання, здійсненого до відкликання Вами згоди.',
            'Ви можете реалізувати свої права, зв’язавшись із контролером даних або, у разі виникнення конфлікту, зі співробітником із захисту даних. За необхідності, Ви також можете звернутися до європейського інспектора із захисту даних. Їхні контактні дані викладено нижче в розділі 9 .',
            'Якщо Ви бажаєте реалізувати свої права в контексті однієї або кількох конкретних операцій опрацювання, то опишіть такі операції (напр., вкажіть номер(-и) запису, як зазначено нижче в розділі 10) у своєму запиті.',
        ],
    ],
    '9-contact' => [
        'title' => 'Контактна інформація',
        'data-controller' => [
            'title' => 'Контролер даних',
            'text' => 'Якщо Ви бажаєте скористатися своїми правами відповідно до Регламенту (ЄС) 2018/1725, або якщо у Вас є коментарі, запитання або занепокоєння, або якщо Ви бажаєте подати скаргу щодо збору та використання Ваших персональних даних, будь ласка, звертайтесь у будь-який час до контролера даних, підрозділ G.2, Європейська комісія,',

        ],
        'data-protection-officer' => [
            'title' => 'Співробітник Комісії з питань захисту даних',
            'text' => "Ви можете зв’язатися зі співробітником із захисту даних (<a href='mailto:DATA-PROTECTION-OFFICER@ec.europa.eu'>DATA-PROTECTION-OFFICER@ec.europa.eu</a>) щодо питань, пов’язаних з опрацюванням Ваших персональних даних, відповідно до Регламенту (ЄС) 2018/1725.",
        ],
        'european-data-protection' => [
            'title' => 'Європейський інспектор із захисту даних',
            'text' => 'Ви маєте право звернутися (тобто Ви можете подати скаргу) до європейського інспектора із захисту даних (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>), якщо вважаєте, що Ваші права, передбачені Регламентом (ЄС) 2018/1725, порушено внаслідок опрацювання Ваших персональних даних контролером даних.',
        ],
    ],
    '10-detailed-info' => [
        'title' => 'Де знайти детальнішу інформацію?',
        'items' => [
            'Співробітник Комісії з питань захисту даних оприлюднює реєстр усіх операцій опрацювання персональних даних Комісією, які було задокументовано та повідомлено йому. Реєстр доступний за таким посиланням: <a href="https://ec.europa.eu/dpo-register">https://ec.europa.eu/dpo-register</a>',
            'Цю конкретну операцію опрацювання включено до публічного реєстру співробітника з питань захисту даних за таким номером запису: <strong>DPR-EC-09706.1</strong>.',
        ],
    ],
];
