<?php

return [
    'remote-teaching' => 'Дистанційне навчання',
    'intro' => [
        'title' => 'Тиждень кодування і дистанційне навчання',
        'text' => 'Дистанційна освіта може стати викликом для вчителів та учнів, і потрібно здолати багато перепон. Проте навчання кодуванню, обчислювальному мисленню і навіть робототехніці не можна зупиняти, коли ваші учня вдома. Ми підготували декілька підказок та ресурсів, які, сподіваємося, допоможуть вам.',
        'points' => [
            1 => 'це добірка коротеньких відео, матеріалів для створення виробів своїми руками, загадок, ігор та викликів кодування для щоденного використання в сім’ї і в школі.',
            2 => ['Кодування без ґаджетів', 'тут ви знайдете різні завдання, які можна легко виконати вдома, щоб навчитися або навчити кодуванню за допомогою підручних матеріалів.'],
            3 => [
                'Навчальні біти',
                'тут ви знайдете Навчальні біти або посібники на тему',
                'стабільного розвитку',
                'та',
                'штучного інтелекту',
                ', у планах уроків яких містяться розділи про дистанційне навчання.',
            ],
            4 => [
                'Сховище ресурсів',
                'для дистанційного навчання можна використовувати багато ресурсів зі сховища. Ви можете знайти ресурси, щоб',
                'навчати',
                'кодуванню або',
                'навчатися',
                'кодуванню.',
            ],
            5 => [
                'Вебінари про кодування з дому',
                'ви знали, що в межах Тижня кодування було організовано декілька вебінарів про те, як навчатися та навчати кодуванню з дому? Прогляньте їх!',
            ],

        ],
    ],
    'tips' => [
        'title' => '7 підказок, як навчати кодуванню дистанційно',
        'points' => [
            1 => [
                'Ознайомтеся з поняттями, мовами програмування та програмним забезпеченням',
                'поки учні напівсамостійно навчаються кодувати і програмувати методом спроб і помилок, ви повинні направляти їх та допомагати їм знаходити помилки в роботі. Будьте готові вносити зміни і адаптовуватися до них, якщо цифровий інструмент або мова програмування не дали результат, на який ви очікували',
            ],
            2 => [
                'Надихайте учнів',
                'допомагайте своїм учням повністю розкривати свій потенціал за допомогою мотиваційних та змістовних уроків. Дозволяйте їм досліджувати свої вміння та креативність, даючи можливість самостійно вибирати проекти та досягати результатів. Окрім того, ми рекомендуємо бути реалістом і встановлювати цілі, досяжні вашими учнями.',
            ],
            3 => [
                'Заохочуйте студентів до роботи в групах',
                'кодування в групах не лише приносить задоволення, але й допомагає учням реалізовувати складніші та креативніші проекти. Навіть більше, дистанційне навчання може призводити до ізоляції деяких учнів, а робота в групах запобігає цьому. Наприклад, ви можете створити онлайн-зали, де б ваші учні могли збиратися групами, або запровадити партнерське оцінювання, запропонувавши учням обмінятися конструктивними відгуками про проекти один одного.
', ],
            4 => [
                'Дізнайтеся про відкрите ПЗ та безоплатні онлайн-платформи для навчання кодуванню',
                'для навчання кодуванню і його вивчення існує багато простих у використанні ресурсів належної якості та високого рівня. Це безоплатні інструменти, які ваші учні можуть використовувати без необхідності купувати ліцензію або звантажувати ПЗ. Більшість таких інструментів можна знайти у',
                'сховищі Тижня кодування,',
                'напр.,',
                'тощо. Як ми бачили на прикладі ',
                'Навчальних бітів Тижня кодування',
                ', ці інструменти можна використовувати для будь-якої теми!',

            ],
            5 => [
                'Пам’ятайте про веселощі',
                'ваші перші кроки в кодуванні повинні бути захопливими і веселими; можливо, цього разу ви не зможете особисто поділитися своїм захопленням, але завжди можна знайти способи пограти та повеселитися разом! Наприклад, можна запропонувати учням зробити перерву, щоб об’єднатися та зіграти разом',
                'розраховану на декількох гравців освітню гру, мета якої — навчатися обчислювальному мисленню в грі.',

            ],
            6 => [
                'Відтворіть взаємодію, що присутня в справжньому класі',
                'технології дають нам можливість відтворити — щонайменше частково — таку взаємодію, яка була б присутня в класі. Ви можете заохотити учнів увімкнути камери на певний час, піднімати віртуально руки, ставити запитання особисто або в чаті, відповідати на електронні опитування, виконувати тести тощо. Для цього ви можете використовувати безоплатні цифрові інструменти, як',
                ', та',
                'для класних сесій у прямому ефірі, та ',
                'для проведення тестів та взаємодії в класі. Так учні зможуть почуватися як у класі та відчути зв’язок зі своїми колегами.',
            ],
            7 => [
                'Забезпечте наявність і доступність матеріалів',
                'упевніться, що ваші уроки кодування реалістичні та інклюзивні, переконавшись, що необхідні матеріали легко знайти вдома, усі студенти можуть дістати їх або ви можете запропонувати щось взамін у разі неможливості використання таких матеріалів. Наприклад, на заходах із кодування без ґаджетів необхідно мати недорогі матеріали, такі як ножиці, папір або маркери. Виконуючи онлайн-вправи з кодування, упевніться, що всі учні мають вдома планшет або комп’ютер та надійне з’єднання з Інтернетом.',

            ],

        ],

    ],
];
