<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'title' => 'Відзвітуйте про свій захід #EUCodeWeek',
    'event_title' => 'Назва заходу',
    'number_required' => 'Надайте приблизний кошторис навіть за відсутності точних даних.',
    'phrase1' => 'Цю форму можна заповнити лише один раз! Уважно перевірте дані. За наявності помилки ',
    'phrase2' => 'Після подання звіту автоматично буде згенеровано персоналізований сертифікат про участь у Тижні кодування; ви зможете звантажити його або поділитися ним. Приклад сертифіката можна проглянути тут.',
    'phrase3' => 'Обов\'язкові поля позначено зірочкою (*).',
    'phrase4' => 'Цю форму можна заповнити лише один раз! Уважно перевірте дані. За наявності помилки',
    'contactus' => 'зв’яжіться з нами',
    'participants_count' => [
        'label' => 'Кількість учасників',
    ],
    'average_participant_age' => [
        'label' => 'Середній вік учасників',
    ],
    'percentage_of_females' => [
        'label' => 'Відсоток жінок',
    ],
    'codeweek_for_all_participation_code' => [
        'label' => 'Код для участі в Тижні кодування для всіх',
        'help' => 'Тут можна ввести код для виклику Codeweek4All за його наявності. Якщо Ви не берете участі, пропустіть це поле.',
    ],
    'name_for_certificate' => [
        'label' => 'Прізвище та ім’я для сертифіката',
        'help' => 'Вкажіть прізвище та ім’я організатора заходу, який отримуватиме сертифікат про участь у Тижні кодування. Використовуйте лише латиницю. Літери з діактричними знаками не підтримуються.',
    ],
    'submit' => 'Подати звіт про захід',
    'thanks_page' => [
        'title' => 'Вдячні за звіт про захід!',
        'certificate_ready' => 'Ваш сертифікат готовий.',
        'download_button' => 'Натисніть тут, щоб звантажити його.',
        'back_events' => 'Повернутися до заходу',
    ],

];
