<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'title' => 'Розповідати про Тиждень кодування своїм учням',
    '1' => [
        'title1' => 'Навіщо вам навчати кодуванню своїх учнів?',
        'title2' => 'Яку користь може принести кодування вашим учням? Що воно означає для вас як для вчителя?',
        'content' => [
            'Ми вважаємо, що основи грамотності будь-якої людини в цифровій ері повинні охоплювати розуміння кодування та розвиток важливих уміньй, пов’язаних з обчислювальним мисленням, таких як вирішення проблем, співпраця та аналітичні навички.',
            'Опанувавши кодування, ваші учні можуть займати провідні позиції в компетентному в цифровій галузі суспільстві, розвивати краще розуміння світу, що оточує їх, та отримати кращі шанси на успіх в особистому і професійному житті.',
            'Тиждень кодування пропонує всім учням можливість зробити перші кроки як цифрові творці, даючи школам і вчителям безоплатні можливості професійного розвитку, навчальні матеріали, міжнародні виклики та можливості обміну.',
        ],
        'button' => [
            'label' => 'Хочете розпочати зараз же? Реєструйтеся тут!',
        ],
    ],
    '2' => [
        'title1' => 'Готові долучитися?',
        'title2' => 'Організуйте урок, навчальну сесію або захід і закріпіть їх на карті.',
        'content' => [
            'Знаєте ви щось про кодування або програмування чи ні, ви можете легко організувати урок у класі, відкритий день або захід у школі. Просто виберіть дату та зареєструйте свій захід на карті нижче. Якщо вам потрібна допомога, щоб підготувати урок із кодування, то перейдіть до наступного розділу.',
            'Прогляньте приклади заходів, що їх організовують, переглянувши карту нижче, та додайте свій захід, щоб долучитися до тисяч педагогів-колег у Європі та за її межами: ',

        ],
        'button' => [
            'label' => 'Готові спробувати? Додайте захід!',
        ],

    ], '3' => [

        'title1' => 'Новенькі в кодуванні? Не хвилюйтеся',
        'title2' => 'Наші інструменти допоможуть вам познайомитися з кодуванням, перш ніж ви донесете його до своїх учнів',
        'content' => [
            'Якщо ви хочете пояснити кодування своєму класові, але не знаєте, із чого почати, не хвилюйтеся! Міжнародна команда вчителів і фахівців розробляють пакет коротких навчальних онлайн-модулів, щоб вам було легше почати.',
            'Для перегляду наших навчальних бітів попередній досвід не потрібен!',

        ],
        'button' => [
            'label' => 'Перейти до навчальних модулів',
        ],
    ], '4' => [

        'title1' => 'Шукаєте додаткове завдання?',
        'title2' => 'Створіть мережу заходів, залучіть якомога більше учнів та отримайте сертифікат про досконалість',
        'content' => [
            '«Code Week 4 All» («Тиждень кодування для всіх») закликає вас об’єднати сили з іншими вчителями чи школами та взяти участь у міжнародній спільноті однодумців, даючи учням можливість зробити перші кроки в кодуванні. Створіть об’єднання за участю більше ніж 500 учнів і отримайте сертифікат про досконалість.',

        ],
        'button' => [
            'label' => 'Дізнатися більше про «Code Week 4 All»',
        ],
    ],

];
