<?php

return [

    'featured-activities' => 'Тут представлено майбутні основні заходи Тижня кодування ЄС, які раді прийняти учасників у режимі онлайн. Ви можете відфільтрувати їх за мовою та місяцем і, натиснувши «Переглянути», побачити всю інформацію про захід і контакти організатора. Приємного перегляду!',
    'learn' => 'Кодування і програмування — ключові навички, попит на які зростає в усіх галузях, а Тиждень кодування ЄС прагне підтримати Вас у навчанні! Перегляньте наше сховище та виберіть ідеальний ресурс, щоб розпочати або продовжити свою мандрівку в кодування. Усі ці ресурси безоплатні. Не забувайте про можливість налаштувати фільтр пошуку за типом ресурсу, рівнем знань, мовою програмування, категорією та мовою.',
    'teach' => 'Кодування і програмування — ключові навички, які відкриють нові можливості для Ваших учнів та дітей. Бажаєте навчати кодуванню вдома, у школі або в клубі кодування? Перегляньте наше сховище та виберіть найвідповідніший ресурс для того, щоб впровадити кодування та програмування у свою викладацьку практику. Усі ці ресурси безоплатні. Не забувайте про можливість налаштувати фільтр пошуку за типом ресурсу, рівнем знань, мовою програмування, предметом, категорією та мовою.',
    'toolkits' => [
        'У цьому розділі Ви знайдете матеріали, які допоможуть Вам організувати захід Тижня кодування ЄС та підтримати ініціативу зі своєю спільнотою.',
        'Набір комунікаційних інструментів',
        'тут ви знайдете офіційні логотипи, знаки, флаєри, постери, шаблони PowerPoint і Word, приклади дописів у соціальних мережах та ілюстрації Тижня кодування ЄС.',
        'Набір учительських інструментів',
        'тут Ви знайдете офіційні логотипи, знаки Тижня кодування ЄС, шаблон сертифіката про участь для своїх учнів, вступну презентацію про Тиждень кодування ЄС та матеріали для соціальних мереж.',
        'Офіційна брошура Тижня кодування ЄС.',
    ],

    'about' => [

        'goal' => 'Ціль — допомогти більшій кількості молодих людей опанувати основи кодування та обчислювального мислення.',

    ],

    'guide' => [

        'tutorials' => [

            '1' => 'Перегляньте наші',

            '2' => 'посібники і тренінги,',

            '3' => 'доступні 29 мовами, щоб підготуватися до організації заходів, у межах яких молодь вивчає кодування та обчислювальне мислення.',

        ],

    ],

    'dance' => [

        'menu' => 'Танцювальний виклик',

        'subtitle' => 'Хто сказав, що програмісти не вміють танцювати? Ми доведемо зворотне через виклик #EUCodeWeekDance.',

        'content' => 'Запрошуємо усі школи, усіх вчителів, усі бібліотеки, клуби кодування, компанії та державні органи  відзначити Тиждень кодування ЄС, організувавши захід #EUCodeWeekDance та додавши його на карту Тижня кодування.',

    ],

    'treasure-hunt' => [

        'menu' => 'Полювання на скарби',

        'subtitle' => 'Це гра в Telegram',

    ],

    'videos' => [
        1 => 'Дивитися відео про наші цінності від послів Тижня кодування ЄС',
        2 => 'Дивитися відео від посла Словенії Каті Ошляк про те, чому Тиждень кодування незалежний',
        3 => 'Дивитися відео від посла Франції Лорана Туше про те, чому Тиждень кодування для кожного',
        4 => 'Дивитися відео від посла Тунісу Фатьми Буазіз про те, чому Тиждень кодування глокальний',
        5 => 'Дивитися відео від посла Латвії Лінди Сінки про те, чому Тиждень кодування — це співпраця',
        6 => 'Дивитися відео від посла Італії Алессандро Больйоло про те, чому Тиждень кодування неприбутковий',
        7 => 'Дивитися відео від посла Албанії Мар’яни Пріфті про те, чому Тиждень кодування заохочує до інновацій та творчості',
        8 => 'Дивитися відео від посла Румунії Крістіани Лукачі про те, чому Тиждень кодування вдячний своїй спільноті',
    ],

     'learn_and_teach_1' => 'Репозитарій ресурсів для початку або продовження вашої подорожі з програмування та розвитку цифрових і технічних навичок – і все це доступно безкоштовно.',
    'learn_and_teach_2' => 'Кодування та програмування є ключовими компетентностями, які стають все більш затребуваними в кожній галузі, і EU Code Week хоче підтримати вас у вашому викладанні та навчанні! Перегляньте наш репозиторій і знайдіть ідеальний ресурс для початку або продовження вашої подорожі з програмування. Всі ці ресурси безкоштовні. Не забувайте, що ви можете фільтрувати пошук за назвою, типом ресурсу, рівнем навичок, мовою програмування, предметом, категорією та мовою.',
];
