<?php


return [
    'title' => 'Заява про цінності Тижня кодування ЄС',
    'description' => [
        1 =>
            [
                1 => 'Тиждень кодування ЄС — це рух, втілений волонтерами –',
                2 => 'послами',
                3 => ', провідними вчителями і фанатами кодування з усього світу. Його підтримують',
                4 => 'Європейська комісія',
                5 => 'та міністерства освіти в країнах Європейського Союзу і Західних Балкан.',
            ],

        2 => 'Серцем Тижня кодування ЄС є спільнота організаторів-волонтерів заходів, а саме, вчителі, наставники, клуби кодування, бібліотеки, приватні компанії, батьки та неурядові організації. Вони присвячують свій час, енергію та вміння, щоб познайомити з обчислювальним мисленням, кодуванням, робототехнікою, ремонтом апаратного забезпечення, комп’ютерними науками та цифровими навичками загалом якомога більше людей у Європі та в світі.',
        3 => 'Тиждень кодування ЄС — це також мільйони його учасників, а саме, люди будь-якої статі, будь-якого віку та походження, будь-якої культури та з будь-якими навичками з усього світу.',
        4 => 'Ми пишаємося, що ми — Тиждень кодування ЄС. Це наші цінності. І вони завжди керують нашою роботою та нашими рішеннями.'
    ],
    '1' => [
        'title' => 'Тиждень кодування ЄС незалежний',
        'content' => 'Тиждень кодування ЄС — це спільнота, рушійною силою якої є волонтери. Ми не працюємо в економічних інтересах. Ми поважаємо та цінуємо ідеї, переконання і культури інших людей. Ми беремо участь у Тижні кодування ЄС, тому що віримо у важливість того, що робимо. Це наша сила. Ми хочемо, щоб обчислювальне мислення, кодування, робототехніка, ремонт апаратного забезпечення, комп’ютерні науки та цифрові навички загалом стали доступними для кожного. '
    ],
    '2' => [
        'title' => 'Тиждень кодування ЄС для кожного',
        'content' => 'Кожен може організувати заходи в рамках Тижня кодування ЄС. Ми розуміємо, наскільки важливо, аби події Тижня кодування ЄС було організовано для кожного незалежно від віку, кольору шкіри, статті, культурного виховання та інтелектуальних здібностей. Заходи можуть слугувати відправною точкою для пробудження інтересу та зацікавленості або допомогти розвинути навички ще далі.  Наші принципи — рівність, повага, свобода та інклюзивність. Ми хочемо, аби всі учасники пізнавали технології і творили з ними весело.'
    ],
    '3' => [
        'title' => 'Тиждень кодування ЄС глокальний',
        'content' =>
            [
                1 => 'Тиждень кодування ЄС прагне потрапити до Вас незалежно від того, чи Ви живете у великому місті, в адміністративному центрі чи у віддаленому селі. Ми приділяємо особливу увагу підтримці місцевих організаторів',
                2 => 'матеріалами,',
                3 => 'укладеними їхньою рідною мовою та пристосованими до їхніх потреб. Карта',
                4 => 'Тижня кодування ЄС —',
                5 => 'ключовий інструмент, де реєструють усі заходи та зазначають їхню точну локацію. Разом із тим, Тиждень кодування ЄС є глобальним і радо приймає до своєї спільноти людей з усього світу. Ми «глокальні».',
            ]
    ],
    '4' => [
        'title' => 'Тиждень кодування ЄС — це співпраця',
        'content' => [
            1 => 'Члени спільноти Тижня кодування ЄС взаємодіють, обмінюються інформацією, навчаються один в одного та здобувають знання разом. Ми взаємопов’язані та підтримуємо один одного. Ми обмінюємося ресурсами, ідеями та успішними практиками. Ми заохочуємо партнерство та обмін знаннями.',
            2 => 'Виклик «EU Code Week 4 All»',
            3 => 'має на меті прокласти мости між країнами та спільнотами. Він допомагає поширювати позитивну енергетику та об’єднує людей, які можуть вчитися один в одного.'

        ]
    ],
    '5' => [
        'title' => 'Тиждень кодування ЄС неприбутковий',
        'content' =>
            [
                1 => 'Усі заходи Тижня кодування ЄС неприбуткові. Усі ',
                2 => 'ресурси',
                3 => 'на вебсайті Тижня кодування ЄС безоплатні. Усі тренінги та онлайн-курси Тижня кодування ЄС безоплатні.',
            ]
    ],
    '6' => [
        'title' => 'Тиждень кодування ЄС заохочує до інновацій',
        'content' => 'Новим ідеям завжди раді. Тиждень кодування ЄС заохочує до інновацій, творчості і далекоглядного мислення. Ми відкриті до зворотного зв’язку та критики і вдячні за них, тому ми зможемо ухвалювати зважені рішення і розвивати Тиждень кодування ЄС. Навіть невдачі допоможуть нам зростати як особистостям та як спільноті.'
    ],
    '7' => [
        'title' => 'Тиждень кодування ЄС вдячний своїй спільноті',
        'content' => 'Ми вдячні за підтримку вчителям, наставникам та іншим організаторам заходів, учням, батькам, клубам кодування та всім партнерам, з якими ми працюємо. У нас усіх одна мета. Ми хочемо познайомити якомога більше людей з обчислювальним мисленням, кодуванням, комп’ютерними науками та цифровими навичками загалом.'
    ],

];
