<?php

return [   
    'webinars-text' => 'Відкрийте для себе серію безкоштовних вебінарів, які допоможуть покращити ваші навички програмування та розширити знання. Долучайтеся у зручний для вас час і навчайтеся від провідних експертів!',
    'webinars-sub-text1' => "Ця серія вебінарів організована командою EU Code week, щоб підтримати проведення подій та активностей. Вебінари об'єднують експертів, освітян і ентузіастів, які досліджують захопливе поєднання програмування та цифрової креативності.",
    'webinars-sub-text2' => "Це чудова можливість як для освітян, які прагнуть урізноманітнити навчальні програми, так і для здобувачів освіти, які хочуть розвинути свої навички, або ж для всіх, хто цікавиться сучасними освітніми тенденціями в ІТ.",
    'recordings-youtube-list-title' => "Усі записи доступні у вигляді плейлистів на YouTube:",
    '2024-webinar-series-title'=>"Серія вебінарів 2024 року:",
    '2025-webinar-series-title'=>"Серія вебінарів 2025 року:",
];