<?php

return [
    "titles" => [
        "Чому кодування?",
        "Ідеться про втілення ідей у життя",
        "Ідеться про розвиток ключових навичок",
        "Зрештою, ідеться про формування нашого майбутнього",
    ],
    "texts" => [
        "Ідеться про Пію, якій здавалося, що вона мусить вивчати право, але завжди захоплювалася математикою та іграми з комп’ютерами. Ідеться про Марка, у якого є ідея поліпшеної соціальної мережі, але він не знає, як створити її самотужки. Ідеться про Еліс, яка мріє створити робота, тому що батьки забороняють їй завести кота. Ідеться про тих із-поміж вас, хто вже допомагає здійснювати ці мрії.",
        "Насправді йдеться про всіх нас та про те, як ми формуємо наше життя і наше майбутнє. Ми здатні на краще, ніж просто обмінюватися постами і ставити вподобайки. Ми можемо втілювати наші ідеї в життя, створювати речі, які приноситимуть радість іншим.",
        "Ніколи не було так легко розробити застосунок, створити власного робота чи — хто знає — винайти літальний автомобіль! Ця мандрівка нелегка, проте вона сповнена креативних викликів, моря веселощів та підтримки від спільноти. Готові прийняти виклик і стати цифровим творцем?",
        "Мова програмування така, як будь-яка інша мова. Але в цьому випадку діти не навчаються висловлювати свої думки та спілкуватися з іншими людьми. Натомість вони повинні зрозуміти, як спілкуватися з технологіями. Із технологіями, що оточують нас  — у телефонах, комп’ютерах, транспорті, повсюди!",
        "Проте розуміння комп’ютерів та спілкування з ними — лише частина справи. Кодування допомагає розвинути багатопрофільні навички, як-от обчислювальне мислення, вирішення проблем, творчість та командна робота — чудові навички для всіх сфер життя. Здатність вирішувати проблеми, долати невдачі та відновлювати спроби, співпрацювати з іншими — цих якостей потребують в багатьох галузях.",
        "Ще сто років тому мови програмування навіть не існувало. Сьогодні код навколо нас, і практично все можна запрограмувати, навіть взуття та упаковку для каш! То навіщо дозволяти іншим влаштовувати наше майбутнє, якщо ми можемо стати творцями і втілювати наші бачення та ідеї? Зрештою, єдиним обмеженням є наша уява.",
        "Алессандро Больйоло, координатор команди послів-волонтерів Тижня кодування ЄС  зазначив:",
        "«Споконвіку ми виготовляли безліч речей за допомогою каменю, заліза, паперу та олівця, що змінило наше життя. Тепер ми живемо в іншій епосі, де наш світ створюють за кодом. У різних епох різні вимоги до роботи, умінь та навичок. Протягом Тижня кодування ми хочемо дати кожному європейцю можливість відкрити кодування і весело провести час. Вивчаймо кодування, щоб вершити наше майбутнє»",
        "Зрештою, програмування — це навичка, якої потребують практично у всіх галузях: не лише в галузі технологій, а й у галузі фінансів, охорони здоров’я, науки, навіть дизайну та сільського господарства, і попит на неї зростає. Діти, котрі вміють кодувати, розуміють, як працюють технології, і тому мають певну перевагу, незважаючи на професійний шлях, який вони врешті-решт оберуть.",
        "Відчуваєте натхнення?",
        "Долучайтеся до Тижня кодування ЄС!",
        "Потрібно більше інформації для роздумів?",
        "Читайте детальніше в нашому блозі."
    ],
];
