<?php

return [
    'subtitle' => 'В настоящата декларация за поверителност се предоставя информация относно обработването и защитата на личните Ви данни.',
    'processing-operation' => [
        'Операция по обработване',
        'управление на посланиците, водещите лектори и регистрацията на дейности за Европейската седмица на програмирането на уебсайта',
    ],
    'data-processors' => [
        'Обработващи лични данни',
        'GOPA Com. S.A. и EUN Partnership AISBL (Европейска училищна мрежа), info@codeweek.eu',
    ],
    '1-intro' => [
        'Информация, свързана с обработването на лични данни за целите на управлението на посланиците, водещите лектори и регистрацията на дейности за Европейската седмица на програмирането на уебсайта.',
    ],

    '3-legal_process' => [
        'Законосъобразност на операцията по обработване: Отдел G.2 събира, съхранява и публикува Вашите лични данни, тъй като сте дали изричното си съгласие чрез отбелязване с отметка в поле по време на регистрацията си за посланик или водещ лектор, или при кандидатстване за регистрация на събитие в <a href="https://codeweek.eu/register">Европейската седмица на програмирането.</a>',

    ],
    '4-collect_data' => [
        'Задължително <strong>събираните</strong> лични данни на <strong>посланиците и водещите лектори</strong> са следните:',
        'Име',
        'Адрес на електронна поща',
        'Парола',
        'Изображение',
        'Биография',
        'Длъжност',
        'Сфера на компетентност на водещия лектор.',
        'Когато <strong>регистрирате дейност, задължително</strong> събираните лични данни са следните:',
        'Наименование на организацията',
        'Вид на организацията',
        'Имейл адрес за връзка',
        'Предоставянето на тези данни е задължително, за да бъдете посланик или водещ лектор, или ако искате да регистрирате дейност за Европейската седмица на програмирането на уебсайта.',
        'Освен това <strong>посланиците и водещите лектори</strong> могат <strong>доброволно</strong> да предоставят следните лични данни:',
        'Профили в социалните медии',
        '<strong>Организаторите на дейности</strong> могат <strong>доброволно</strong> да предоставят следните данни:',
        'Публичен имейл адрес за връзка',
        'Уебсайт на организатора',
        'Седмица на програмирането за всички езици',
        'За организаторите на събития, имайте предвид, че съответният посланик за Вашата държава или отдел G.2 могат да използват личните данни, които сте предоставили при регистрацията на дейност, за да се свържат с Вас относно въпросната дейност',
        'Вие предоставихте вашите лични данни на',
        'страницата за вход в уебсайта на Европейската седмица на програмирането',
        'и на',
        'страницата за регистрация на дейност.',
    ],
    '5-how_long' => [
        'Всички лични данни ще бъдат заличени от базите данни, ако се оттеглите от инициативата, или 5 години след края на инициативата.',
    ],

    '6-protect_data' => [
        'Всички лични данни в електронен формат (електронни съобщения, документи, бази данни, качени партиди данни и т.н.) се съхраняват на сървърите на Европейската комисия или на сървърите на нейните изпълнители на договори. Всички операции по обработване се извършват в съответствие с <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?qid=1548093747090&uri=CELEX:32017D0046">Решение (ЕС, Евратом) 2017/46</a>, от 10 януари 2017 г. относно сигурността на комуникационните и информационните системи в Европейската комисия.',
        'Изпълнителите на договори на Комисията са обвързани от конкретна договорна клауза за всички операции по обработване на Вашите данни от името на Комисията и от задълженията за поверителност, произтичащи от прилагането на Общия регламент относно защитата на данните в държавите — членки на ЕС (ОРЗД — <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32016R0679">Регламент (ЕС) 2016/679</a>).',
        'За да защити вашите лични данни, Комисията е въвела редица технически и организационни мерки. Техническите мерки включват подходящи действия по отношение на сигурността онлайн и риска от загуба на данни, от промяна на данните или от неразрешен достъп, като се вземат предвид свързаният с обработването риск и естеството на обработваните лични данни. Организационните мерки включват предоставяне на достъп до личните данни единствено на оправомощени лица със законна необходимост да бъдат осведомени за целите на операцията по обработване.',
    ],
    '7-access_data' => [
        'Всички предоставени от Вас лични данни са достъпни за служителите на Комисията въз основа на принципа „необходимост да се знае“. Освен това достъп до Вашите лични данни се предоставя и на нашите изпълнители на договори въз основа на принципа „необходимост да се знае“.',
        'С цел популяризация на посланика, водещия лектор или регистрираните дейности всички ваши лични данни са публикувани на следния <a href="https://codeweek.eu/">уебсайт</a>.',
        'Освен това отдел G.2 може да споделя Вашите данни за контакт с всеки представител на обществеността или заинтересовано лице, което би пожелало да се свърже с Вас във връзка с Европейската седмица на програмирането. За организаторите на събития, имайте предвид, че съответният посланик за Вашата държава или отдел G.2 могат да използват личните данни, които сте предоставили при регистрацията на дейност, за да се свържат с Вас относно въпросната дейност.',
    ],
    '8-rights' => [
        'Вие сте се съгласили да предоставите личните си данни на отдел G.2 за настоящата операция по обработване. Можете да оттеглите съгласието си по всяко време, като уведомите отдел G.2 на адрес CNECT-G2@ec.europa.eu. Оттеглянето не засяга законосъобразността на обработването, извършено преди да сте оттеглили съгласието си.',
    ],

    '10-detailed-info' => [
        'Тази конкретна операция по обработване е включена в публичния регистър на длъжностното лице по защита на данните под следния референтен номер на уведомление: DPR-EC-02631 Управление на звената за контакт за политиките, програмите и проектите на ГД „Съобщителни мрежи, съдържание и технологии“.',
    ],
];
