<?php

return [
    'titles' => [
        'Защо програмиране?',
        'Защото дава възможност за реализиране на идеи',
        'Защото помага за развитие на ключови умения',
        'Защото става въпрос за оформяне на нашето бъдеще',
    ],
    'texts' => [
        'Заради Пиа, която се чувстваше задължена да учи право, макар че винаги е харесвала математиката и работата с компютри. Заради Марк, който има идея за по-добра социална мрежа, но не знае как да я осъществи сам. Заради Алис, която мечтае да създава роботи, защото нейните родители не ѝ позволяват да си има котка. И заради онези от вас, които вече помагат тези мечти да се превърнат в реалност.',
        'Всъщност заради всички нас и начина, по който оформяме живота и бъдещето си. Можем да правим много повече от това да споделяме и харесваме публикации. Можем да вдъхваме живот на нашите идеи, да създаваме неща, които носят радост на другите.',
        'Никога не е било по-лесно да се разработи приложение, да се създаде робот или, кой знае, може би дори да се изобрети летяща кола! Пътят не е лесен, но е изпълнен с творчески предизвикателства и изобилие от забавления в компанията на една отзивчива общност. Готови ли сте да приемете предизвикателството и да станете цифрови създатели?',
        'Езиците за програмиране са като всеки друг език. Само че в този случай децата не се учат да се изразяват и да общуват с други хора. Вместо това те разбират как да общуват с технологиите. Технологиите, които са навсякъде около нас — в нашите смартфони, компютри, автомобили, навсякъде!',
        'Разбирането и общуването с компютрите е само една част. Програмирането помага и за развитието на мултидисциплинарни компетентности, като например изчислително мислене, решаване на проблеми, творчество и работа в екип — отлични умения за всички сфери на живота. В много области се търсят хора, които могат да решават проблеми, да се справят с неуспехите и да опитват отново, както и да си сътрудничат с другите.',
        'Преди един век езиците за програмиране дори не са съществували. Днес програмният код е навсякъде около нас и почти всичко може да бъде програмирано — дори обувки или кутии с овесени ядки! Защо да оставяме другите да оформят нашето бъдеще, след като можем да станем създатели и да реализираме нашите визии и идеи? В крайна сметка единствената граница е нашето въображение.',
        'Алесандро Больоло, ръководител на екипа от посланици доброволци за Европейската седмица на програмирането, сподели:',
        'Човек винаги е използвал материалите около себе си, за да преобрази своя живот — камък, желязо, хартия и молив. Сега живеем в различна епоха, в която светът се оформя чрез програмен код. През различните епохи има различни изисквания по отношение на работните места и уменията. По време на Седмицата на програмирането искаме да дадем на всички европейци възможност да се запознаят с програмирането и да се забавляват с него. Да се научим да програмираме, за да можем да оформяме бъдещето си',
        'В крайна сметка програмирането е търсено умение в почти всеки сектор — не само в областта на технологиите, но и в областта на финансите, здравеопазването, науката, дори дизайна и селското стопанство, и търсенето нараства все повече и повече. Децата, които могат да програмират, които разбират как функционират технологиите, имат определено предимство, независимо от това какъв професионален път ще изберат.',
        'Убедихме ли ви?',
        'Участвайте в Европейската седмица на програмирането!',
        'Имате нужда от повече храна за размисъл?',
        'Посетете нашия блог',
    ],
];
