<h2>Не заборавајте да ја додадете вашата активност на мапата на Неделата на кодирање!</h2>

<p>Лесно може да организирате час во училницата, отворен ден или настан во училиштето. Само најдете датум и регистрирајте ја активноста на <a href="/events">мапата на Неделата на кодирање</a>. Организаторот на секоја активност ќе добие сертификат за учество за својот труд.</p>

<p>Ако сакате да се поврзете со меѓународна група на наставници ентузијасти, придружете се на <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">Групата на Facebook за наставници за Европската недела на кодирањето</a>! За да направите чекор понатаму и да соработувате со други училишта во земјата или во странство - придружете се на <a href="codeweek4all">Предизвикот Code Week 4 All</a>.</p>