<?php

return [
    /*'when-title' => 'През 2024 г. Европейската седмица на програмирането ще се проведе между 14 и 27 октомври.',
    'when-text' => '<p>Европейската седмица на програмирането е движение на равнище граждани, което популяризира креативността, решаването на проблеми и сътрудничеството чрез програмиране и други технически дейности. Идеята е да се популяризира програмирането, да се покаже на младите и старите хора как идеите оживяват с помощта на програмирането, тези умения да станат по-ясни и разбираеми и да се съберат на едно място мотивирани хора, които искат да учат.</p>',
    'codeweek_in_numbers-title' => 'Седмицата на програмирането в цифри',
    'codeweek_in_numbers-text' => '<p>През 2021 г. <a href="https://blog.codeweek.eu/4-million-people-created-code-with-the-help-of-eu-code-week-in-2021/">4 млн. души</a> в над 80 държави по целия свят взеха участие в Европейската седмица на програмирането.</p>
                    <p>Средната възраст на участниците беше 11 години, а 49 % от участниците през 2021 г. бяха жени или момичета. 88 % от събитията в Европейската седмица на програмирането се проведоха в училища, което показва, че усилията да се подготвят учители през кампанията от 2021 г. са били успешни.</p>
                    <p>Всеки е добре дошъл да организира или да се присъедини към събитие. Просто изберете тема и целева аудитория, и <a href="/add">добавете своето събитие!</a> на <a href="/events">на картата.</a></p>',
    'run_by_volunteers-title' => 'Организира се от доброволци',
    'run_by_volunteers-text' => '<p>Европейската седмица на програмирането се ръководи от доброволци. Един или няколко <a href="/ambassadors">посланици на Седмицата на програмирането</a> координират инициативата в своята страна, но всеки може да организира собствено събитие и да го добави на картата на <a href="/">codeweek.eu</a>.</p>',
    'supported_by_commission-title' => 'Подпомага се от Европейската комисия',
    'supported_by_commission-text' => '<p>Инициативата беше стартирана през 2013 г. от експертната група на младите съветници към Програмата в областта на цифровите технологии за Европа. Европейската комисия подпомага Европейската седмица на програмирането като част от своята стратегия за <a href="http://ec.europa.eu/priorities/digital-single-market/">единен цифров пазар</a>. В <a href="https://education.ec.europa.eu/focus-topics/digital-education/action-plan">Плана за действие за цифрово образование</a> Комисията насърчава специално училищата да се присъединят към инициативата.</p>',
    'schools-title' => 'Училища',
    'schools-text' => '<p>За участие в Европейската седмица на програмирането са поканени специално училища и учители от всички образователни степени, за да дадат възможност на своите ученици да се запознаят с цифровата креативност и с програмирането. Научете повече за инициативата и как да организирате своето събитие чрез уеб страницата, предназначена за учители: <a href="/schools">CodeWeek.eu/Schools</a></p>',
    'why_coding-title' => 'Защо програмиране?',
    'why_coding-text' => '<p>Заради Пиа, която мислеше, че трябва да учи право, макар че винаги е харесвала математиката и работата с компютри. Заради Марк, който има идея за по-добра социална мрежа, но не може да я създаде сам. Заради Алис, която мечтае да създава роботи, защото нейните родители не ѝ позволяват да си има котка.</p>

                    <p>Всичко е заради онези от вас, които вече помагат тези мечти да се превърнат в реалност.</p>

                    <p>Всъщност е заради всички нас. Нашето бъдеще. Технологиите предопределят живота ни, но ние позволяваме на малка група хора да решават за какво и как да ги използваме. Можем да правим по-добри неща, не само да споделяме и харесваме разни неща. Можем да превърнем налудничавите си идеи в реалност, да създадем неща, които ще донесат радост на другите.</p>

                    <p>Никога не е било по-лесно да създадеш свое собствено приложение, да си конструираш робот или да изобретиш летящи автомобили, защо не! Пътят не е лесен, но това е път, изпълнен с творчески предизвикателства, подкрепяща общност и изобилие от забавления. Готови ли сте да приемете предизвикателството и да станете творец?</p>

                    <p>Програмирането помага също така за развиването на умения като изчислително мислене, решаване на проблеми, креативност и работа в екип — наистина добри умения за всички сфери на живота.</p>',*/
    'why_coding-quote' => '<p>Алесандро Болиоло, координатор на екипа от посланици на Европейската седмица на програмирането, заяви:<blockquote>
                            <p>„Още от древността сме правили много неща с помощта на камък, желязо, хартия и молив, които са преобразили живота ни. Сега живеем в различна епоха, в която светът ни е кодиран. Различните епохи имат различни изисквания за работните места и уменията. По време на Седмицата на програмирането искаме да дадем възможност на всеки европеец да научи за програмирането и да се забавлява с него. Нека се научим да програмираме, за да сътворим бъдещето си“.</p>
                        </blockquote>
                    </p>',
    /*'join_codeweek-title' => 'Присъединете се към Европейската седмица на програмирането:',
    'join_codeweek-text' => '<p>Присъединете се към Европейската седмица на програмирането, като <a href="/guide">организирате събитие за програмиране</a> във вашия град, се присъедините към <a href="/codeweek4all">предизвикателството Code Week 4 All</a> и свържете събития, пресичащи общности и граници, или като ни помогнете да разпространим визията на Седмицата на програмирането като <a href="/ambassadors">посланик на Европейската седмица на програмирането</a> за вашата страна!</p>',
    'partners_and_sponsors' => 'Партньори и спонсори',*/
];
