<?php

   /*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [

    'languages' => [
        'en' => 'английски',
        'fr' => 'френски',
        'bg' => 'български',
        'mt' => 'малтийски',
        'hr' => 'хърватски',
        'de' => 'немски',
        'pl' => 'полски',
        'cs' => 'чешки',
        'el' => 'гръцки',
        'pt' => 'португалски',
        'da' => 'датски',
        'hu' => 'унгарски',
        'ro' => 'румънски',
        'nl' => 'холандски',
        'ga' => 'ирландски',
        'sk' => 'словашки',
        'it' => 'италиански',
        'sl' => 'словенски',
        'et' => 'естонски',
        'lv' => 'латвийски',
        'es' => 'испански',
        'fi' => 'фински',
        'lt' => 'литовски',
        'sv' => 'шведски',
        'al' => 'албански',
        'ba' => 'босненски',
        'mk' => 'македонски',
        'me'=> 'черногорски',
        'rs' => 'сръбски',
        'mt' => 'Малтийски',
        'tr' => 'Турски'
   ],

    'resources_local_title'=>'Ресурси за програмиране от',
    'are_you_a_teacher' => 'Вие сте учител?',
    'get_involved_banner' => 'Щракнете тук, за да разберете как да се включите!',
    'days'=>'Дни',
    'hours'=>'Часове',
    'minutes'=>'Минути',
    'seconds'=>'Секунди'

];