<?php

   /*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [

    'languages' => [
        'en' => 'английски',
        'fr' => 'френски',
        'bg' => 'български',
        'mt' => 'малтийски',
        'hr' => 'хърватски',
        'de' => 'немски',
        'pl' => 'полски',
        'cs' => 'чешки',
        'el' => 'гръцки',
        'pt' => 'португалски',
        'da' => 'датски',
        'hu' => 'унгарски',
        'ro' => 'румънски',
        'nl' => 'холандски',
        'ga' => 'ирландски',
        'sk' => 'словашки',
        'it' => 'италиански',
        'sl' => 'словенски',
        'et' => 'естонски',
        'lv' => 'латвийски',
        'es' => 'испански',
        'fi' => 'фински',
        'lt' => 'литовски',
        'sv' => 'шведски',
        'al' => 'албански',
        'ba' => 'босненски',
        'mk' => 'македонски',
        'me'=> 'черногорски',
        'rs' => 'сръбски',
        'tr' => 'Турски'
   ],

    'resources_local_title'=>'Ресурси за програмиране от',
    'days'=>'Дни',
    'hours'=>'Часове',
    'minutes'=>'Минути',
    'seconds'=>'Секунди',

    'still_have_question' => 'Все още имате въпрос?',
    'drop_us_a_line' => 'Просто ни драснете няколко реда!',
    'get_in_touch' => 'СВЪРЖЕТЕ СЕ С НАС',
    'footer_msg' => 'Инициатива на равнище граждани, ръководена от доброволци и подкрепяна от Европейската комисия.',
    'email' => 'Имейл',
    'display_email' => 'Показване на имейла',
    'first_name' => 'Лично име',
    'last_name' => 'Фамилно име',
    'your_website' => 'Вашият уебсайт',
    'biography' => 'Биография',
    'update' => 'Актуализиране',
    'delete' => 'Изтриване',
    'choose a file' => 'Изберете файл',

    'learning_bits' => 'Учене и обучение',
    'codeweek' => 'Седмицата на програмирането',
    'bring_codeweek_to_your_students' => 'Представете Седмицата на програмирането на своите ученици',
    'or' => 'или',
    "newsletter" => "Бюлетин"

];
