<?php

return [
    'chatbot' => [
        'title' => 'Направете чатбот',
        'author' => 'Екип на Европейската седмица на програмирането',
        'purposes' => [
            'Кодирайте интерактивни загадки',
            'Използвайте код, за да създадете диалози между чатбот и потребител'
        ],
        'description' =>
            'Кодирайте разговор между чатбот и потребител, който се опитва да реши загадка. Опитайте се да създадете чатбот, който чати като човек. Вместо загадка, може да създадете диалог между чатбот и потребител.',
        'instructions' => [
            'Помислете за някаква загадка',
            'Влезте в',
            'или създайте нов профил. (Когато създавате нов профил, имайте предвид, че поради изискванията за поверителност в Pencil Code не се разрешава използването на истинските имена.)',
            'Кликнете върху Imagine (Представете си) и Make your own (Направете ваше собствено)',
            'Използвайте блокове или текстов режим, за да напишете своята загадка',
            'Може да използвате и',
            'този код',
            'и да го адаптирате към вашата загадка или да изберете Answering a riddle (Отговор на загадка) от менюто и да редактирате'
        ],
        'example' => 'Разгледайте този пример за загадка.',
        'more' => [
            'Този код е адаптиран от дейност в Pencil Code',
            'Answering the Riddle'
        ]
    ],

    'paper-circuit' => [
        'title' => 'Отдалечете се от компютъра и кодирайте: Направете хартиена електрическа верига',
        'author' => 'Екип на Европейската седмица на програмирането',
        'purposes' => ['Засилване на креативността', 'Развиване на умения за решаване на проблеми'],
        'description' => [
            'Нарисувайте предмет по ваш избор. Може да нарисувате нощното небе, калинка, робот, коледно дърво или каквото пожелаете. Не се колебайте да персонализирате своя проект с визуалните елементи на Европейската седмица на програмирането: може да разгледате',
            'Набор от инструменти за учители в Европейската седмица на програмирането',
            'и да свалите всяко едно лого или визуален елемент, които желаете. Дори може да направите покана за Европейската седмица на програмирането от хартиена електрическа верига. Към вашата верига добавете и мотивиращо съобщение, за да окуражите и други учители да се присъединят към Седмицата на програмирането и/или да разгледат уебсайта, специално създаден за училищата.'
        ],
        'instructions' => [
            'Начертайте обект и решете кои части ще бъдат осветени (напр. звездите).',
            'Направете дупка в хартията с молив и поставете LED стикер във всяка част, която трябва да бъде осветена.  ',
            'Нарисувайте кръг, в който ще поставите плоска кръгла батерия.',
            'Начертайте + и - от другата страна на хартията. Уверете се, че по-дългата част на LED стикера е свързана към страната „+“ на батерията, а по-късата – към страната „-“.',
            'Положете медната лента върху успоредните линии.',
            'Направете сгъвка така, че когато хартията покрие батерията, LED стикерът да свети. Може да използвате кламер, за да осигурите добър контакт с медната лента.',
            'Снимайте своята хартиена електрическа верига и я споделете в Instagram, като обясните защо смятате, че си струва да сте част от тази инициатива.  '
        ],
        'example' => 'Вижте някои примери за хартиени електрически вериги',
        'materials' => [
            'хартия или картон',
            'пастели или маркер',
            'плоска кръгла батерия',
            'медна лента',
            'LED стикери за ел. верига',
            'кламер'
        ]
    ],

    'dance' => [
        'title' => 'Създайте танц',
        'author' => 'Екип на Европейската седмица на програмирането',
        'purposes' => [
            'За да научите основни понятия в кодирането',
            'За да научите как да анимирате героите'
        ],
        'description' =>
            'В това предизвикателство вие ще създадете няколко героя, които ще танцуват заедно. Ще използвате вградена медийна библиотека, за да изберете герои и музикални клипове, но също така може да създадете свои собствени. Вие ще анимирате героите, за да танцуват и да говорят помежду си.',
        'instructions' => [
            'Влезте в',
            'като учител. Създайте ученически профили и ги споделете със своите ученици. Друга възможност е да споделите код на класа и вашите ученици да се регистрират с имейл адреса на училището си. Ако сте ученик, може да се присъедините като ученик, но ще трябва да предоставите имейл адреса на родител, за да може вашият родител да одобри вашия профил.',
            'Кликнете',
            'и сложете име',
            'Отидете на',
            'за да добавите фон, като кликнете върху иконата на зъбно колело. Изберете фон от Media Library (медийната библиотека), качете свое изображение, като дори може да направите снимка и да я качите. Изберете аудиоклип и го добавете на сцената (stage):',
            'Кликнете върху бутона',
            'за да добавите герои или предмети, които ще анимирате, така че те да могат да се движат, да говорят или да си взаимодействат помежду си. Добавете два или три героя по ваш избор. Може да нарисувате свои собствени герои или да промените съществуващите. Добавете различни костюми към вашия герой, като кликнете върху иконата с молив.',
            'Кликнете върху всеки герой и го анимирайте, като добавите следните блокове',
            'Добави',
            'say block',
            '(кажи блок) и така героите ще си говорят помежду си. Променете формата на „балончетата“ за реч, както и шрифта и размера на текста'
        ],
        'example' => [
            'Разгледайте',
            'този пример',
            'на танцуващи роботи. Може да го използвате и отново да го смесите.'
        ]
    ],

    'compose-song' => [
        'title' => 'Направете музикална композиция',
        'author' => 'Екип на Европейската седмица на програмирането',
        'purposes' => [
            'Да се научи програмиране чрез музика',
            'Да се разграничават музикалните жанрове и инструменти',
            'Да се композира песен чрез смесване на звукови клипове'
        ],
        'description' =>
            'В това предизвикателство ще създадете музикална композиция, като използвате език за програмиране. Може да използвате вградени звукови клипове или да записвате свои собствени и да ги смесвате, за да създадете музикална композиция. Пуснете своя код в цифровата аудио станция (Digital Audio Workstation, DAW) и слушайте музиката, която сте кодирали. Слушайте заедно с различни звуци и ефекти, за да промените музиката.',
        'instructions' => [
            'Влезте в',
            'Кликнете тук, за да направите скрипт',
            'Дайте име на скрипта си и изберете',
            'като език за програмиране',
            'Започнете да пишете своя код между',
            'и',
            'линии',
            'Разгледайте музикалните клипове в',
            'Sound Library',
            '(Звуковата библиотека) и изберете музикалните жанрове, изпълнителите и инструментите, които харесвате',
            'За да добавите звуков клип към песента, въведете',
            'Между скобите трябва да има следните 4 параметъра, разделени със запетаи',
            'Sound clip (Звуков клип)',
            'Поставете курсора между скобите, отидете на Звуковата библиотека, изберете клип и го поставете, като кликнете върху синята икона за поставяне',
            'Track number (Номер на запис)',
            'записите ви помагат да организирате различните звуци по вид на инструмента (вокал, бас, барабани, клавирни и др.). Добавете толкова записи (инструменти), колкото желаете. Записите се показват като редове, които преминават през цифровата аудио станция (DAW)',
            'Start measure (Започнете такт)',
            'показва кога вашият запис ще започне да се възпроизвежда. Тактовете са музикални времеви единици. Един такт е 4 удара',
            'End measure (Край на такт)',
            'показва кога вашият запис ще спре да се възпроизвежда',
            'Такъв ред на кода ще изглежда така',
            'Можете да добавите различни ефекти, като сила на звука, за да подобрите звука на вашата композиция. Силата на звука варира от -60,0 децибела до 12,0 децибела, като 0,0 е първоначалната сила на звука.',
            'Въведете',
            'В скобите напишете номера на записа, VOLUME, GAIN, ниво на силата на звука, такта, при който започва, нивото и такта, когато свършва',
            'Това е пример за ефект на плавно увеличаване',
            'и за ефект на плавно затихване'
        ],
        'example' => [
            'Слушайте',
            'пример за песен, програмирана с Earsketch',
            'Може да импортирате кода и да го редактирате'
        ],
    ],
    'sensing-game' => [
        'title' => 'Направете видео сензорна игра',
        'author' => 'Екип на Европейската седмица на програмирането',
        'purposes' => [
            'Да програмирате анимирани предмети',
            'Да разберете как да контролирате цифровата анимация с физическо движение',
            'Да композирате песен чрез смесване на звукови клипове'
        ],
        'description' =>
            'В това предизвикателство ще създадете лесна игра, която използва видеокамера като сензор за засичане на движение, което означава, че ще можете да контролирате анимацията си с физическо движение. В тази игра задачата е в рамките на 30 секунди да съберете колкото се може повече балончета на Европейската седмица на програмирането. Вместо да събирате балончета, може да създадете игра, в която преследвате някой герой или спуквате балони с ръце.',
        'instructions' => [
            'Влезте в',
            'Кликнете',
            'Добавяне на разширение',
            'и изберете',
            'Видео Усет',
            'С него ще се засече колко бързо се движи даден предмет. Ако числото е по-малко, той по-лесно ще се поддава на движение.',
            'Добавете спрайт. Изберете звук и го добавете към вашия спрайт. Ако желаете, може да добавите',
            'Създай клонинг',
            'за да дублирате своя спрайт.',
            'Създайте две променливи: една за',
            'Резултат',
            'и другата за',
            'Таймер',
            'и ги добавете към спрайта. Настройте таймера на 30 и добавете',
            'Промени таймер с -1',
            'Създайте нов спрайт',
            'Край на играта',
            'за да приключите играта. Може също така да създадете спрайт с името на вашата игра, напр. Collect all EU Code Week bubbles (Събери всички балончета на Европейската седмица на програмирането).'
        ],
        'example' => [
            'Играй видео сензорна игра Collect all EU Code Week Bubbles (Събери всички балончета на Европейската седмица на програмирането). Ако желаете, можете да смесите отново',
            'този проект'
        ]
    ],

    'calming-leds' => [
        'title' => 'Успокояващи LED диоди: създайте просто устройство с micro:bit',
        'author' => 'Micro:bit Educational Foundation',
        'duration' => '20 минути',
        'materials' => [
            'micro:bit устройство и батерия (ако са налични)',
            'лаптоп или таблет, с които да посетите Microsoft MakeCode и Youtube',
            'microbit.org за ресурси за тази дейност'
        ],
        'description' =>
            'Учениците създават цифрово устройство с помощта на LED диоди, които могат да им помогнат да регулират дишането си и да се чувстват по-спокойни. Те ще бъдат помолени да напишат прост код, като експериментират с анимации и последователности.',
        'instructions' => [
            'Целта е да се създаде работещо успокояващо устройство с LED, което да използваш за регулиране на дишането. Това устройство може да бъде създадено върху физическа micro:bit платка или върху симулатора в редактора на MakeCode.',
            'Това предизвикателство може да бъде изпълнено с помощта на редактора на MakeCode и с написването на проста кодова последователност, както е показано във видеото/на екранната снимка.',
            'За да създадат предизвикателството, учениците могат да експериментират с различни анимации и да проявят творчество с анимацията, която биха искали да видят, за да им помогне да се почувстват спокойни или щастливи.',
            'За допълнителна информация и видео инструкции, вижте',
            'тази връзка'
        ],
        'example' =>
            'Посетете тази страница за инструкции и видеоклипове на изпълненото предизвикателство плюс как да кодирате',
        'purposes' => [
            'Да проектирате прост цифров програмен компонент с полезна цел',
            'Да експериментирате с различни последователности и анимации и начина, по който работят те',
            'Да тествате и дебъгвате прост код',
            'Да повтаряте дизайн, като правите анимациите по-бързи или по-бавни'
        ]
    ],
    'computational-thinking-and-computational-fluency' => [
        'title' =>
            'Изчислително мислене (ИМ) и изчислителна точност и ефикасност със ScratchJr',
        'author' => 'Стаматис Пападакис – посланик на Гърция в Европейската седмица на програмирането',
        'purposes' => [
            'Да се запознаете с нови команди и интерфейс.',
            'Да създавате прости програми с прости причинно-следствени команди.',
            'Да изпълнявате прост дебъгинг чрез метода на опита и грешката.'
        ],
        'description' =>
            'В това предизвикателство децата ще интегрират понятието за ИМ в своите проекти с помощта на приложението ScratchJr, за да направят своите истории по-интересни, вълнуващи и емоционални.',
        'instructions' => [
            'За да използват ScratchJr, децата не трябва да са грамотни. Всички инструкции и опции на менюто се разбират чрез символи и цветове. Предизвикателството може да бъде изпълнено в класната стая, лабораторията или дори на открито, тъй като не е необходим интернет.',
            'Децата използват града като фон и използват кодиращи блокове, за да накарат една кола да пътува из града.'
        ],
        'example' => [
            'Децата могат да използват блокове за звук и движение, както и блокове за ново начало, за да накарат героите да танцуват.',
            'Децата избират фон и герой и използват блок за движение, за да накарат една кола да се движи из града Децата могат да използват блока за скорост, за да ускоряват или забавят даден герой.'
        ],
        'materials' => [
            'Безплатното приложение',
            'работи на различни операционни системи и видове смарт устройства',
            'Също и уебсайтът',
            'предлага множество безплатни образователни материали'
        ],
        'duration' => '90 минути'
    ],
    'ai-hour-of-code' => [
        'title' => 'Часът на AI в програмирането',
        'author' => 'Minecraft Education Edition',
        'purposes' => [
            'Да създавате решения за кодиране, които включват последователности, събития, цикли и условни конструкции',
            'Да декомпозирате стъпките, необходими за решаване на проблем, в точна последователност от инструкции',
            'Да разучите понятия в кодирането'
        ],
        'description' =>
            'Едно село е застрашено от пожар и се нуждае от вас, за да кодирате решение! Запознайте се с вашия помощник в програмирането – агентът в Minecraft, след това програмирайте агента така, че да се движи през гората и да събира данни. Тези данни ще помогнат на агента да направи прогноза къде могат да възникнат пожари. След това програмирайте агента така, че да предотврати разпространението на пожара, да спаси селото и да върне животните обратно в гората. Научете основите на програмирането и разучете реалния пример за изкуствен интелект (AI).',
        'instructions' => 'Свалете плана на урока тук',
        'materials' => [
            'Инсталиране на Minecraft: Education Edition',
            'След като инсталирате Minecraft Education Edition, предизвикателството е прието',
            'този уебсайт'
        ]
    ],
    'create-a-dance' => [
        'title' => 'Създайте танц с помощта на Ode to Code!',
        'purposes' =>
            'Да се упражнявате в програмиране по забавен начин и да се чувствате свързани с общността на Европейската седмица на програмирането.',
        'description' => [
            'Създайте танц с помощта на Ode to Code! Използвайте',
            'ръководството на Dance Party',
            'за да програмирате танц към Ode to Code. Официалният химн на Европейската седмица на програмирането е включен в списъка на Dance Party.'
        ],
        'instructions' => [
            'Инструкциите се показват като видеоклипове в',
            'ръководството',
            'както и са написани най-отгоре на всяко ниво'
        ],
        'example' =>
            'Избраните ученически творения могат да бъдат намерени на следната страница',
        'materials' => 'Ръководството на Code.org'
    ],
    'create-a-simulation' => [
        'title' => 'Създай симулация!',
        'purposes' => [
            'Да научите за симулациите, като въведете следните променливи: създаване на тълпа, процент на оздравяване, носене на маски и ваксини.',
            'Да активирате предишни познания за огнища на вируси в реалния свят, които да бъдат използвани в измислен сценарий.'
        ],
        'description' =>
            'Напишете код, за да създадете и стартирате своя собствена симулация на възникването на огнище на вируса в Monster Town. Научете се да програмирате и да правите прогнози какво ще се случи със съседите на Monster Town.',
        'instructions' => [
            'Инструкциите се показват като видеоклипове в',
            'ръководството',
            'както и са написани най-отгоре на всяко ниво'
        ],
        'example' =>
            'Когато станете готови, може да споделите своята симулация с останалите. Споделете вашето послание за това, което смятате, че можем да направим, за да опазим здравето на другите хора, когато в града се появи вирус.',
        'materials' => 'Ръководството на Code.org',
    ],
    'create-your-own-masterpiece' => [
        'title' => 'Създайте свой собствен шедьовър!',
        'audience' => 'Подходящо за всички възрасти',
        'purpose' =>
            'Да въведете понятия от компютърните науки по визуален начин и да стимулирате творчеството',
        'description' =>
            'Създайте свой собствен шедьовър с помощта на художник! Използвайте блокове за кодиране, за да накарате вашия художник да създаде уникално произведение на изкуството.',
        'instructions' => 'Инструкциите са показани най-отгоре на всяко ниво',
        'example' => 'Примери за художници могат да бъдат намерени на тази страница под рисунка',
        'materials' => ['Можете да откриете първото ниво от ръководството', 'ТУК']
    ],
    'cs-first-unplugged-activities' => [
        'title' => 'Дейности CS First Unplugged',
        'purposes' => [
            'Подкрепа на ученици, които учат от вкъщи',
            'Почивка от екраните за всички'
        ],
        'description' =>
            'CS First Unplugged е набор от дейности, които запознават учениците с понятията в компютърните науки без участието на компютър. Ние създадохме този урок, за да покажем, че компютърните науки са много повече от код.',
        'instructions' => [
            'Брошурата за всички дейности на английски език ще намерите в следната',
            'връзка',
            'както и плана на урока на английски език тук',
            'Дейностите в този урок могат да се изпълняват индивидуално и в произволен ред',
            'Учителят може да направи снимка на учебния процес и да я сподели в Instagram, като използва #CodeWeekChallengeGoogle #GrowWithGoogle'
        ],
        'materials' => [
            'В допълнение към брошурата с дейностите за някои дейности са необходими допълнителни материали или те могат да се използват по избор.',
            'Малки маркери за броене (като зрънца боб), които да се ползват в картата за „Изграждане на мрежа в квартала“.',
            'Ножици, с които да се изреже шифровъчният кръг за „Изпращане на тайно съобщение“.',
            'Картон и лепило за допълнително подсилване на шифровъчния кръг за „Изпращане на тайно съобщение“.',
            'Кабърче, клечка за зъби или изправен кламер за съединяване на шифровъчния кръг за „Изпращане на тайно съобщение“.'
        ]
    ],
    'family-care' => [
        'title' => 'Грижи за семейството',
        'experience' => 'Отворена за всички',
        'duration' => '5 до 10 часа',
        'author' => '',
        'purposes' => [
            'Да се проучи въпросът за грижите за семейството, които извършваме всеки ден;',
            'Да започнете да гледате на проблемите като на възможности и да създавате идейни решения;',
            'Да използвате код за иновативно реализиране на вашите решения;',
            'Да създавате постери и да представяте своите решения на останалите;',
            'Да използвате социалните медии за разпространяване на влиянието на вашите проекти.'
        ],
        'description' => [
            'За какво се сещате, когато говорим за дома? Хубава къща? Голяма вечеря, приготвена от родителите? Да имате тайно място за себе си? Топлият дом зарежда телата и духа ни като истинска бензиностанция. В суматохата на съвременния живот родителите винаги са заети с работа. Когато излизате с приятели, не можете да оставите котенцата си сами. Но как да се грижите за тях, когато сте далече? Темата на предизвикателството е',
            'Грижи за семейството',
            'С използването на тази тема като база учениците се поощряват да мислят за предаването на любов и грижи чрез кодиране и хардуер. Ето и няколко въпроса, върху които да помислите',
            'Във вашия дом колко членове на семейството има? Кои са те? Срещали ли сте някакви проблеми в живота заедно? Какви грижи са им необходими?',
            'Познавате ли някой, който получава по-малко грижи от други във вашата общност? По какъв начин можете да им помогнете?'
        ],
        'instructions' => [
            'Обсъдете и проучете темата за грижите в семейството',
            'Направете списък с проблемите',
            'Генерирайте възможни решения',
            'Изберете решение',
            'Програмирайте и изградете структурата',
            'Направете дизайн на плакат, за да оформите вашия проект',
            'Представете го на вашите учители и на семейството'
        ],
        'example' => ['Може да разгледате някои примери тук', 'и'],
        'materials' => [
            'Инструмент за кодиране:',
            'или да свалите',
            'компютърната версия',
            'mBlock е език за програмиране, базиран на Scratch',
            'Това състезание е адаптирано и от състезанието MakeX Global Spark, проектна програма за творческо проектиране за младежи на възраст от 6 до 13 години.',
            'Участващият екип ще трябва да се съсредоточи върху конкретната тема и да измисли решение чрез софтуерно програмиране и изграждане на хардуер.',
            'Учениците се насърчават да завършат предизвикателството в рамките на Седмицата на програмирането и да го изведат на международно ниво, където да общуват с други ученици и да печелят награди.',
            'За допълнителна информация, разгледайте тук:',
            'или се свържете с нас на'
        ],
    ],
    'virtual-flower-field' => [
        'title' => 'Отгледайте свое виртуално поле с цветя',
        'author' =>
            'Йадга Хуегле – инструктор „Meet and Code“, част от екипа на SAP Snap!',
        'duration' => '30 – 60 минути',
        'purposes' => [
            'Да се запознаете с програмирането с помощта на лесен, но изразителен проект.',
            'Да разберете, че с програмирането може да се твори и да се постигнат красиви резултати.',
            'Да направите есента по-ярка с красиви цветя и с Европейската седмица на програмирането.',
            'Да покажете колко разнообразни са цветята на Земята.',
            'Да дадете своя принос към целите за устойчиво развитие, и по-специално към цел 13 – „Борба с климатичните промени“, като създавате събития, посветени на програмирането, с които се подобрява обучението по въпросите на изменението на климата чрез повишаване на осведомеността по темата.'
        ],
        'description' =>
            'Създайте програма в Snap!, с която се развива виртуално поле с различни видове цветя, които имат различен брой венчелистчета.',
        'instructions' => [
            'Ако имате нужда от вдъхновение преди да започнете с предизвикателството, гледайте',
            'това видео',
            'или използвайте',
            'този документ',
            'за да проследявате',
            'Предизвикателството може да бъде изпълнено чрез програмиране на виртуално поле с цветя в Snap! (или Scratch) и публикуване на екранна снимка или снимка на резултата онлайн.',
            'Полето с цветя трябва да съдържа различни видове цветя с различен брой венчелистчета. В идеалния случай цветята са програмирани, което означава, че са конструирани чрез многократно щамповане и завъртане (или рисуване и завъртане) на венчелистчетата.',
            'Публикувайте изображение на вашата виртуална цветна градина с #MeetandCode.'
        ],
        'materials' => [
            'Препоръчваме ви да използвате',
            'проектът обаче работи и в'
        ]
    ],
    'haunted-house' => [
        'title' => 'Обитавана от духове къща в Hedy',
        'author' =>
            'Фелиен Ерман, Лайденски университет – Рамон Моорлаг, I&I – Седмица на програмирането, Нидерландия',
        'audience' => 'Учители и преподаватели',
        'duration' => 'От 1 до 2 часа, в зависимост от знанията до момента',
        'purposes' => [
            'Да се направи интерактивна история за обитавана от духове къща.',
            'Да се научите да програмирате с Hedy.'
        ],
        'description' =>
            'С Hedy ще създадете история за къща, обитавана от духове, с интерактивни елементи. Всеки път, когато кодът се изпълнява, ще се създава нова история. Историята може да бъде прочетена на глас от вашия компютър и споделена онлайн.',
        'instructions' => [
            'Започнете като отворите браузъра и отидете на hedycode.com.',
            'Следвайте инструкциите за нива 1–4. Използвайте разделите ‘Level (Ниво)’ и ‘Haunted house (Обитавана от духове къща).’',
            'С помощта на тези нива ще напишем интерактивна история за обитавана от духове къща.',
            'Учители, плана на урока за Hedy може да намерите',
            'тук',
            'Може да намерите запис на презентацията на Hedy от Фелиен Ерман на',
            'тази връзка'
        ],
        'example' => 'Пример за къща, обитавана от духове, на ниво',
        'materials' => ['Hedy на', 'ниво 1 до 4'],
    ],
    'inclusive-app-design' => [
        'title' => 'Проектиране на приобщаващо приложение',
        'author' => 'Apple Education',
        'duration' => '60 минути + незадължителни допълнителни дейности',
        'purposes' => [
            'Да се измисли и планира, да се направи прототип и да се сподели идея за приложение, до което всеки може да получи достъп и да разбере.'
        ],
        'description' =>
            'Великите приложения започват с велики идеи. В тази дейност учениците ще измислят идея за приложение по тема, която ги интересува, след което ще разберат как да проектират приложения, с мисъл за приобщаването и достъпността.',
        'instructions' => [
            'Всички инструкции ще намерите на тази връзка',
            'С този едночасов план на урока преподавателите могат да насочат учениците към',
            'Научете повече за приобщаващото проектиране на приложения',
            'Обсъдете теми, които ги интересуват, за да намерите идея за приложение',
            'Нахвърлете техните идеи за приложения и планирайте дейностите на потребителя',
            'Направете прототип на една част на тяхното приложение в Keynote',
            'Споделете демо версиите на техните прототипи и опишете по какъв начин те оказват подкрепа на потребители с различен произход и възможности'
        ],
        'materials' => [
            'Разгледайте дейността за проектиране на приобщаващо приложение (Inclusive App Design Activity) в Apple Teacher Learning Center',
            'Препоръчва се Keynote на iPad или Mac, но не е задължително.'
        ]
    ],
    'silly-eyes' => [
        'title' => 'Смешни очи',
        'author' => 'Raspberry Pi Foundation',
        'duration' => '25 минути',
        'purposes' => [
            'Да направите проект с взаимодействие с потребителя.',
            'Да персонализирате проект с цветни и графични ефекти.',
            'Да научите за дизайна с цифрови средства.'
        ],
        'description' =>
            'В този проект ще проектирате и създадете герой със смешни очи. Огромните, смешни очи на героя ще следват показалеца на мишката, за да дадат живот на вашия герой.',
        'instructions' => 'За пълно описание на проекта, вижте тук',
        'example' => 'Разгледайте Gobo, Under the sea и Don\'t eat donut'
    ],
    'train-ai-bot' => [
        'title' => 'Обучете AI бот!',
        'purposes' =>
            'Да научите за изкуствения интелект (AI), машинното самообучение, данните от обученията и отклоненията, докато изследвате етични въпроси и как AI може да се използва за справяне със световните проблеми.',
        'description' =>
            'Обучете AI бот с AI for Oceans (AI за океани). В тази дейност ще програмирате или обучите AI (изкуствен интелект) да разпознава риба или боклук. Нека да изчистим океана!',
        'instructions' => [
            'Инструкциите се показват като видео в ръководството',
            'както и са написани най-отгоре на всяко ниво'
        ],
        'materials' => [
            'Ръководството можете да намерите тук',
            'Ръководството е преведено на над 25 езика'
        ],
    ]
];
