<?php

return [

    'title' => 'Предизвикателството Code Week 4 All',
    'text' => 'Предизвикателството Code Week 4 All ви насърчава да свържете вашите събития с тези, организирани от приятели, колеги и познати, и заедно да спечелите сертификат за отлични постижения от Седмицата на програмирането.',
    'what' => [
        'title' => 'Какво всъщност е това?',
        'content' => '<p>Освен да отбележите събитието си на картата на Европейската седмица на програмирането, можете и да ангажирате други хора в мрежата си, които да направят същото. Ако вие и вашият съюз достигнете един от следните прагове, всички вие ще спечелите сертификат за отлични постижения от Седмицата на програмирането!</p>
                            <p>Критерии за получаване на сертификат за отлични постижения:</p>',
        'criteria1' => 'да участват 500 ученици',
        'criteria2' => '10 свързани активности (10 различни организатори)',
        'criteria3' => '3 включени държави',
        'andor' => 'И/или',
    ],
    'howto' => [
        'title' => 'Как да участвате?',
        'time' => 'Предизвикателството Code Week 4 All продължава до края на календарната година. Сертификатите ще бъдат издадени в началото на следващата година (през януари или февруари).',
        'content' => 'Посетете страницата <a href="/add">Добавяне на събитие</a> и попълнете необходимите данни за вашето събитие по програмиране.',
        'first_alliance' => [
            'title' => 'Ако сте първият от вашия съюз:',
            '1' => 'Щракнете върху „Изпращане“.',
            '2' => 'След като събитието ви бъде прието, ще получите имейл за потвърждение с вашия уникален код за Code Week 4 All.',
            '3' => 'Копирайте кода и го споделете с ваши колеги и други хора от вашата мрежа, които също организират събитие, свързано с програмирането. Разпространете информацията, за да насърчите и други хора да вземат участие!',
            '4' => 'След края на кампанията всички организатори на събития ще бъдат помолени да докладват броя на участниците, които са убедили да се включат в събитията. Ако сте успели да достигнете прага, вие и вашите колеги, които са били част от вашата мрежа, ще получите сертификат за отлични постижения!',
        ],
        'existing_alliance' => [
            'title' => 'Ако се присъединявате към съществуващ съюз:',
            '1' => 'Копирайте паролата, която сте получили от инициатора (т.е. създателя на съюза), в полето КОД ЗА CODE WEEK 4 ALL.',
            '2' => 'Щракнете върху „Изпращане“.',
            '3' => 'Разпространете информацията (и кода!), за да приемете повече организатори във вашия съюз.',
            '4' => 'След края на кампанията всички организатори на събития ще бъдат помолени да докладват броя на участниците, които са убедили да се включат в събитията. Ако сте успели да достигнете прага, вие и вашите колеги, които са били част от вашата мрежа, ще получите сертификат за отлични постижения!',
        ],
    ],
    'why' => [
        'title' => 'Защо да се присъедините към предизвикателството?',
        '1' => 'За да разпространите съобщението за важността на програмирането.',
        '2' => 'За да видите как се включват голям брой ученици.',
        '3' => 'За да изградите връзки с организации и/или училища във вашата общност или в международен план.',
        '4' => 'За да намерите подкрепа от други организатори и учители.',
        '5' => 'За да спечелите <strong>сертификат за отлични постижения.</strong>',
    ],
    'superorganiser-title' => 'Сертификат за супер организатор',
    'superorganiser' => 'Също така можете да спечелите Сертификат за супер организатор. За тази цел е необходимо да организирате и <a href="https://codeweek.eu/add">регистрирате</a> най-малко 10 отделни събития в рамките на вашето училище или организация, или онлайн.',

];
