<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Въпроси',
    'material' => [
        'required' => 'Необходими материали',
        'chequered' => 'дъска на квадратчета',
        'footprint' => 'плочки с картинки на стъпки',
    ],
    'intro' => [
        'title' => 'Представяне на Coding@Home',
    ],
    'explorer' => [
        'title' => 'Изследователят',
        'text' => '„Изследователят“ е първото занимание от Coding@Home. Местете изследователя по дъската, за да достигнете целта, като преминете през възможно най-много полета. ',
        'questions' => [
            'content' => [
                1 => 'В1. Възможно ли е изследователят да посети всички полета на дъската с показаните във видеото начална и крайна позиция?',
                2 => 'В2. Кои начални и крайни позиции не позволяват на изследователя да посети най-големия възможен брой полета на дъската?',
            ],

        ],

    ],

    'right-and-left' => [
        'title' => 'Дясно и ляво',
        'text' => '„Дясно и ляво“ е игра за състезание и съдействие. Два отбора си сътрудничат, за да направят път към целта, като същевременно се състезават помежду си да използват възможно най-много от приписаните им плочки: жълтият отбор се опитва да постави възможно най-много завои наляво, а червеният отбор се опитва да постави възможно най-много завои надясно.',
        'questions' => [
            'content' => [
                1 => 'В1. Със старт и финал, подредени като на първия вариант в този видеоклип, възможно ли е един от двата отбора да спечели?',
                2 => 'В2. Със старт и финал, подредени като в играта, спечелена от Анна, може ли да има равенство?',
                3 => 'В3. Има ли подредби за старт и финал, които дават предимство на някой от двата отбора?',
                4 => 'В4. Като се има предвид разпределението между стартовата и финалната позиция, възможно ли е да се предвиди каква ще бъде разликата между печелившия и загубилия отбор?',
            ],

        ],

    ],

    'keep-off-my-path' => [
        'title' => 'Пази се от пътя ми',
        'text' => '„Пази се от пътя ми“ е състезателна игра с два отбора. Отборите започват от срещуположните краища на дъската и строят пътеки, които си пречат една на друга. Отборът, който попречи на другия отбор да продължи пътеката си, печели.',
        'questions' => [
            'content' => [
                1 => 'В1. Има ли стартови точки, които дават предимство на някой от двата отбора?',
                2 => 'В2. Възможно ли е да се постигне равен резултат?',
                3 => 'В3. Има ли предимство играчът, който започне пръв?',
                4 => 'В4. Има ли сигурна стратегия за игра, с която играчът, който започне пръв, може да си гарантира, че няма как да загуби?',
            ],

        ],

    ],

    'tug-of-war' => [
        'title' => 'Теглене на въже',
        'text' => '„Теглене на въже“ е игра за сътрудничество и състезание. Два отбора (жълт и червен) започват от най-долната част на дъската и си сътрудничат да достигнат най-горната част. Жълтият отбор се опитва да достигне полетата вляво, а червеният отбор се опитва да достигне полетата вдясно.',
        'questions' => [
            'content' => [
                1 => 'В1. Има ли стратегия, която винаги да води до победа?',
                2 => 'В2. Има ли предимство играчът, който започне пръв?',
                3 => 'В3. Ако и двамата играчи внимават еднакво много, играта винаги ли завършва наравно, тоест в средата?',
            ],

        ],

    ],

    'explorer-without-footprints' => [
        'title' => 'Изследовател без стъпки',
        'text' => 'Изследователят ходи по дъската от стартовата точка към целта, като се опитва да мине през всички полета. Докато ходи, изследователят оставя цветни стъпки, които позволяват на робота да последва пътя му, като тълкува цветовете. Играта става още по-интересна, когато изследователят изчисти стъпките и остави само цветовете.',
        'material' => 'както и червен, жълт и сив маркер (или молив)',
        'questions' => [
            'content' => [
                1 => 'В1. Каква е разликата между дъската, пълна с цветни стъпки и дъската с цветове, но без стъпки?',
                2 => 'В2. Коя дъска предлага по-голяма свобода на движение, като се спазват същите правилата за завиване, посочени от цветовете?',
                3 => 'В3. Има ли възможни пътеки на дъската само с цветове, които не са възможни на дъската с цветни стъпки?',
                4 => 'В4. Има ли възможни пътеки на дъската с цветни стъпки, които не са възможни на дъската само с цветове?',
            ],

        ],

    ],

    'walk-as-long-as-you-can' => [
        'title' => 'Продължавай да вървиш, колкото може по-дълго',
        'text' => 'При тази дейност предизвикателството е да се остане на дъската възможно най-дълго време, като се използват цветове, вместо отпечатъци на стъпала. Дейността става по-трудна с увеличаването на свободата на движение',
        'coloured-cards' => 'цветни карти или червен, жълт и сив флумастер',
        'questions' => [
            'content' => [
                1 => 'В1. В какъв случай двете пътеки се засичат и блокират една друга?',
                2 => 'В2. Тази игра е представена ли е като игра за двама играчи? Възможно ли е да играят 3-ма или 4-ма играчи? Трябва ли да променяме правилата?',
            ],

        ],

    ],

    'ada-charles-roby' => [
        'title' => 'Ада, Чарлз и Роби',
        'text' => 'Историята на Ада Лъвлейс и Чарлз Бабидж е много интересна. Те са измислили и програмирали компютри сто години преди всъщност те да бъдат изобретени',
        'material' => 'пластелин и малък молив',
        'questions' => [
            'content' => [
                1 => 'В1. Опитайте се да си представите, че роботът, който сте направили от пластелин и молив, може да се придвижва по дъската, за да стигне до всяко едно поле и ако е необходимо, да маркира пътя си. Какви инструкции бихте използвали, за да го програмирате?',
            ],

        ],

    ],

    'cody-and-roby' => [
        'title' => 'Коди и Роби',
        'text' => 'Това е ролева игра с програмиста Коди и робота Роби. Видеоклипът въвежда картите Коди-Роби, които ще използваме за определяне на движението по дъската. Коди ще използва тези карти, за да даде на Роби инструкции как да се движи по дъската',
        'material' => 'дъска, разделена на квадратни полета, карти с инструкции (ляво, дясно, направо), както и жетони за поставяне на дъската',
        'starter-kit' => 'Начален комплект Коди-Роби',
        'questions' => [
            'content' => [
                1 => 'В1. До кое поле на дъската ще стигне Роби, ако тръгне от поле C2, обърнат на юг, и изпълни последната последователност от инструкции, показана във видеоклипа?',
                2 => 'В2. Могат ли движенията, които извършва Роби, изпълнявайки последната последователност от инструкции, показана във видеоклипа, да бъдат описани чрез прилагане на дъската на инструкциите Коди-Стъпала или Коди-Цвят?',
                3 => 'В3. Трите вида показани във видеоклипа инструкции, които са представени от зелените, червените и жълтите карти, представляват комплект инструкции, които могат да осигурят придвижване на Роби до всяко едно поле от дъската. Може ли същото да бъде постигнато с комплект инструкции, съдържащ по-малко от 3 броя инструкции?',
            ],

        ],

    ],

    'the-tourist' => [
        'title' => 'Туристът',
        'text' => 'С картите Коди-Роби два отбора играчи се съревновават да намерят във възможно най-кратко време последователността от инструкции, която ще доведе туриста до паметниците на културата на дъската, които туристът желае да посети',
        'material' => 'По-големите карти могат да са полезни за игра на пода',
        'questions' => [
            'content' => [
                1 => 'В1. Каква последователност от инструкции ще доведе туриста до статуята на Рафаело в първия пример от видеоклипа?',
                2 => 'В2. Каква последователност от инструкции ще доведе туриста до кулите на двореца на Дожите във втория пример от видеоклипа?',
                3 => 'В3. Можете ли да измислите нещо забавно като физическо упражнение, което да се прави всеки път, когато един от двата отбора избира карта, за да я добави към програмата? Почерпете идеи от щафетната игра, показана във видеоклипа',
            ],

        ],

    ],

    'material2' => [
        'chequered-with-labels' => 'игрална дъска на квадрати и с обозначения',
        'cards' => '24  карти за „ход напред“, 8за „обърни се наляво“ и 8за „обърни се надясно“',
        'larger-cards' => 'За варианта, в който се играе на пода, се препоръчват по-големи карти',
        'video' => 'Във видеоклипа е обяснено как се играе без тестето карти',
        'pieces-of-paper' => 'Необходими са също така 24  листчета, които да се поставят на полетата, през които вече е преминато',
        'card-alternative' => 'Друг вариант вместо тестето CodyRoby е да използвате картите, публикувани тук',
        'small-drawings' => 'Бихте могли да добавите малки картинки за по-лесно разказване на историята. Картинките, използвани във видеоклипа са публикувани тук',
        'rest-of-cards' => 'За останалото използваме картите CodyRoby, CodyFeet или CodyColour.',
    ],

    'catch-the-robot' => [
        'title' => '„Хвани робота“',
        'text' => '„Хвани робота“ е състезателна игра за маса или за пода. Победител е играчът, който залови робота на противниковия отбор, като достигне до неговото поле на игралната дъска. Заради случайния характер при разпределението на картите и двата отбора трябва непрекъснато да променят стратегиите си.',
        'questions' => [
            'content' => [
                1 => 'В1. Ако розовата фигурка (Roby) е на централното поле C3 с лице на север и розовият отбор има 2  карти „ход напред“, 2  карти „обърни се наляво“ и 1  „обърни се надясно“, до кои полета може да се придвижи?',
            ],

        ],

    ],

    'the-snake' => [
        'title' => '„Змията“',
        'text' => '„Змията“ е вид игра с един участник, която се играе с карти CodyRoby. Целта на играта е змията да бъде преведена през всички полета на дъската, без да захапе опашката си.',
        'questions' => [
            'content' => [
                1 => 'В1. Има ли начални позиции, при които е невъзможно да се премине през всички полета, без да се захапе опашката?',
            ],

        ],

    ],

    'storytelling' => [
        'title' => 'Разказване на истории',
        'text' => 'Днешната тема е разказване на истории! Използвайте инструкциите от CodyRoby, стъпките от CodyFeet или цветовете от CodyColour, за да преведете фигурките по игралната дъска и да разкажете историята. Подредете различни части от историята на различни места по дъската.',
        'questions' => [
            'content' => [
                1 => 'В1. Кой е най-гъвкавият инструмент за насочване на Roby, за да разкаже историята?',
                2 => 'В2. Можете ли да поставите частите на вашата история на места по игралната дъска, за които е невъзможно да бъдат достигнати всички с помощта на CodyFeet?',
            ],

        ],

    ],

    'two-snakes' => [
        'title' => 'Двете змии',
        'text' => 'Като се използват картите CodyRoby, две змии се придвижват по дъската и всяка се опитва да блокира движението на другата. Основното правило е много просто — не можете да се върнете на поле, през което вече е минала змия. Играта печели змията, която успее най-дълго да се придвижва свободно.',
        'material' => 'Карти CodyRoby, игрална дъска с 5х5 полета, две фигури и листчета хартия, които ще се използват за отбелязване на полетата, през които вече е минала фигура.',
        'questions' => [
            'content' => [
                1 => 'В1. При началното разположение на фигурите, показано във видеоклипа, ако двамата играчи не изтеглят жълти карти за обръщане наляво, какви други карти трябва да се надяват да изтеглят?',
            ],

        ],

    ],

    'round-trip' => [
        'title' => 'Отиване и връщане',
        'text' => 'Отборите се редуват. Първият отбор трябва да определи пътя за отиване, а вторият трябва да върне Роби върху началното поле. Изглежда лесно, но не е, особено ако планирате ходовете наум, без да местите Роби...',
        'material' => 'Карти CodyRoby, игрална дъска с 5х5 полета, две фигури и листчета хартия, които ще се използват за отбелязване на полетата, през които вече е минала фигура.',
        'questions' => [
            'content' => [
                1 => 'В1. Възможно ли е програмата за връщане на Роби върху началното поле да е по-кратка (т.е. да се състои от по-малко инструкции), отколкото програмата за отиване?',
            ],

        ],

    ],

    'meeting-point' => [
        'title' => 'Мястото на срещата',
        'text' => 'Този път планираме ходовете си, преди да започнем. Двата отбора поставят карти на масата, за да създадат поредица от инструкции за придвижване на роботите си, но нищо не се мести, преди някой от играчите да каже „Старт!“. В този момент програмирането спира и започва придвижването. Играчът, който е казал „Старт!“, печели само ако двата робота, всеки изпълнявайки инструкциите на своя отбор, накрая се озоват на едно и също поле.',
        'material' => 'Карти CodyRoby, игрална дъска с 5х5 полета, две фигури.',
        'questions' => [
            'content' => [
                1 => 'В1. Ако смятате, че е възможно двата робота никога да не се срещнат, измислете правила, които обхващат всички възможни ситуации в играта.',
            ],

        ],

    ],

    'follow-the-music' => [
        'title' => 'Следвайте музиката',
        'text' => 'Когато поредица от програмни инструкции се повтаря периодично, се получава нещо като ритъм. Ако свържем звук с всяка инструкция, можем да направляваме Роби с музика. Точно това ще направим сега. Ще създам програма, като използвам различни звуци, за да представя различните инструкции, а вие ще местите Роби по дъската, като следвате тези звукови инструкции.',
        'material' => 'Освен картите CodyRoby, игралната дъска и фигурата, трябва да можем да издаваме три различни звука. Аз използвах три чаши, пълни с различно количество вода. А вие какво ще използвате?',
        'questions' => [
            'content' => [
                1 => 'В1. Опитайте да следвате видеоклипа и да се ръководите от звуците, които издават чашите, без да гледате картите. Можете ли да разпознаете и да изпълните инструкциите, предадени чрез звуци?',
                2 => 'В2. Изберете три звука, които да свържете с три основни инструкции. Измислете поредица от инструкции, която можете да повтаряте до безкрай, без Роби да излиза извън дъската...',
            ],

        ],

    ],

    'colour-everything' => [
        'title' => 'Оцвети всичко',
        'text' => 'Можем ли да движим роботите по дъската по такъв начин, че да рисуват със следите си? Тази игра включва програмиране и пикселно изкуство — създаваме изображения, като оцветяваме полетата на игралната дъска подобно на пиксели на екран.',
        'material' => 'карти CodyRoby, игрална дъска и фигурка. За да оцветите полетата, поставяйте листчета хартия върху тях или използвайте маркери.',
        'questions' => [
            'content' => [
                1 => 'Възможно ли е двете сърца, показани в края на видеоклипа, да бъдат нарисувани, като роботът мине само веднъж през всяко от необходимите полета?',
            ],

        ],

    ],

    'codyplotter-and-codyprinter' => [
        'title' => 'CodyPlotter и CodyPrinter',
        'text' => 'Каква е разликата между плотер и принтер? Научете от това занимание по безкомпютърно програмиране.',
        'material' => 'освен комплекта CodyRoby използвах зелен маркер и нов робот от пластилин, но това не е задължително.',
        'questions' => [
            'content' => [
                1 => 'Можете ли да обясните каква е разликата между плотер и принтер?',
                2 => 'Какво изображение ще се получи, ако Роби Принтер премине по редовете на дъската, като изпълни поредицата от команди, продиктувана в края на видеоклипа?',
            ],

        ],

    ],

    'boring-pixels' => [
        'title' => 'Скучни пиксели!/Използване на числа',
        'text' => 'Като даваме на Роби инструкции да нарисува картина поле по поле, пиксел по пиксел, откриваме, че когато много полета от един ред имат един и същ цвят, можем да използваме числа, за да направим нещата по-интересни. Компютрите правят същото...',
        'material' => 'тетрадка с карирани листове или игрална дъска с 5х5 полета, направена от хартия, флумастер. За да представите кода на рисунката, можете да използвате химикалка и хартия.',
        'questions' => [
            'content' => [
                1 => 'Опитайте да нарисувате изображение от квадратчета и да го представите чрез кодиране по дължина (RLE). Размерът на изображението е равен на броя на квадратчетата, но какъв е размерът, когато използваме RLE?',
            ],

        ],

    ],

    'turning-code-into-pictures' => [
        'title' => 'Превръщане на код в рисунки',
        'text' => [
            1 => 'Вече видяхме, че можем да създадем код, за да нарисуваме нещо. Измислих рисунка и съставих код, за да я превърна в поредица от букви и цифри. Използвайте буквите и цифрите, за да възстановите рисунката.',
            2 => 'Ето рисунката, която измислих. Нарисувайте я във вашата тетрадка!',
        ],
        'material' => 'лист хартия (за предпочитане кариран) и химикалка.',
        'questions' => [
            'content' => [
                1 => 'Опитайте да декодирате и нарисувате изображенията, за които говоря в края на видеоклипа.',
            ],

        ],

    ],

    'texts' => [
        1 => '„Coding@Home“ представляват кратки видеоклипове със самоучители, задачи, интересни игри и предизвикателства за програмиране, които могат да се използват ежедневно както в семейството, така и на училище. Не са ви необходими предварителни познания по програмиране и не ви трябват никакви електронни устройства, за да извършвате дейностите Заниманията стимулират изчислителното мислене и култивират уменията на ученици, родители и учители у дома и в училище.',
        2 => 'Поредицата Coding@Home на Европейската седмица на програмирането надгражда инициативата <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">“Coding in famiglia”</a> на Урбинския университет и Асоциацията CodeMOOCnet в сътрудничество с Rai Cultura. Дейностите се представят от Алесандро Болиоло, преподавател по компютърни системи в Урбинския университет, <a href="/ambassadors?country_iso=IT" target="_blank">посланик на Италия за Европейската седмица на програмирането</a> и координатор на всички посланици, както и член на Управителния съвет на Коалицията за цифрови умения и работа.  ',
        3 => 'Ако се интересувате от по-свободни дейности или дейности по различно програмиране, като езици, роботика, micro:bit, разгледайте <a href="/training">"Учебни части" на Европейската седмица на програмирането</a> с видео уроци и планове за уроци за начални, прогимназиални и гимназиални училища. Разгледайте и ресурсите на Европейската седмица на програмирането "Учей и преподавай ", където можете да намерите безплатни висококачествени ресурси от цял свят за учители и ученици.',
    ],
    'coding-at-home-text' => 'Колекция от кратки видеоклипове, материали "направи си сам", пъзели, игри и предизвикателства за програмиране за ежедневна употреба в семейството, както и в училище.',
    'coding-at-home-sub-text1' => 'Поредицата Coding@Home на Европейската седмица на програмирането се основава на инициативата <a class="text-dark-blue underline" href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">"Кодиране във семейството" </a> на Университета в Урбино и Асоциацията CodeMOOCnet в сътрудничество с Rai Cultura. Автор на Coding@Home видеоклип е Алесандро Болиоло, професор по системи за обработка на информация в Университета в Урбино, <a class="text-dark-blue underline" href="https://codeweek.eu/ambassadors?country_iso=IT" target="_blank">посланик на Италия в Европейската седмица на програмирането </a> и координатор на всички посланици, както и член на управителния съвет на Коалицията за цифрови умения и работни места.',
    'coding-at-home-sub-text2' => 'Не се нуждаете от предварителни познания или електронни устройства, за да извършвате дейностите. Дейностите ще стимулират изчислителното мислене и ще култивират уменията на учениците, родителите и учителите у дома или в училище.',
];
