<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Въпроси',
    'intro' => [
        'title' => 'Представяне на Coding@Home',
    ],
    'explorer' => [
        'title' => 'Изследователят',
        'text' => '„Изследователят“ е първото занимание от Coding@Home. Местете изследователя по дъската, за да достигнете целта, като преминете през възможно най-много полета. ',
        'material' => 'Необходими материали: дъска на квадратчета, плочки с картинки на стъпки.',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Възможно ли е изследователят да посети всички полета на дъската с показаните във видеото начална и крайна позиция?',
                    2 => 'В2. Кои начални и крайни позиции не позволяват на изследователя да посети най-големия възможен брой полета на дъската?'
                ]

        ]

    ],

    'right-and-left' => [
        'title' => 'Дясно и ляво',
        'text' => '„Дясно и ляво“ е игра за състезание и съдействие. Два отбора си сътрудничат, за да направят път към целта, като същевременно се състезават помежду си да използват възможно най-много от приписаните им плочки: жълтият отбор се опитва да постави възможно най-много завои наляво, а червеният отбор се опитва да постави възможно най-много завои надясно.',
        'material' => 'Необходими материали: дъска на квадратчета, плочки с картинки на стъпки.',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Със старт и финал, подредени като на първия вариант в този видеоклип, възможно ли е един от двата отбора да спечели?',
                    2 => 'В2. Със старт и финал, подредени като в играта, спечелена от Анна, може ли да има равенство?',
                    3 => 'В3. Има ли подредби за старт и финал, които дават предимство на някой от двата отбора?',
                    4 => 'В4. Като се има предвид разпределението между стартовата и финалната позиция, възможно ли е да се предвиди каква ще бъде разликата между печелившия и загубилия отбор?'
                ]

        ]

    ],

    'texts' => [
        1 => '„Coding@Home“ представляват кратки видеоклипове със самоучители, задачи, интересни игри и предизвикателства за програмиране, които могат да се използват ежедневно както в семейството, така и на училище. Не са ви необходими предварителни познания по програмиране и не ви трябват никакви електронни устройства, за да извършвате дейностите Заниманията стимулират изчислителното мислене и култивират уменията на ученици, родители и учители у дома и в училище.',
        2 => 'Поредицата Coding@Home на Европейската седмица на програмирането надгражда инициативата <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">“Coding in famiglia”</a> на Урбинския университет и Асоциацията CodeMOOCnet в сътрудничество с Rai Cultura. Дейностите се представят от Алесандро Болиоло, преподавател по компютърни системи в Урбинския университет, <a href="/ambassadors?country_iso=IT" target="_blank">посланик на Италия за Европейската седмица на програмирането</a> и координатор на всички посланици, както и член на Управителния съвет на Коалицията за цифрови умения и работа.  ',
        3 => 'Ако ви интересуват още занимания без компютър или пък на различни езици за програмиране, занимания в областта на роботиката, micro:bit и др., вижте <a href="/training">„Учебни модули“ на Европейската седмица на програмирането</a> с видео самоучители и планове с уроци за начално и различните класове на средното училище. Също така погледнете страницата на Европейската седмица на програмирането с ресурси за <a href="/resources/learn">учащи</a> и <a href="/resources/teach">учители.</a> '
    ]
];