<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Въпроси',
    'material' => [
        "required" => "Необходими материали",
        "chequered" => "дъска на квадратчета",
        "footprint" => "плочки с картинки на стъпки"
    ],
    'intro' => [
        'title' => 'Представяне на Coding@Home',
    ],
    'explorer' => [
        'title' => 'Изследователят',
        'text' => '„Изследователят“ е първото занимание от Coding@Home. Местете изследователя по дъската, за да достигнете целта, като преминете през възможно най-много полета. ',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Възможно ли е изследователят да посети всички полета на дъската с показаните във видеото начална и крайна позиция?',
                    2 => 'В2. Кои начални и крайни позиции не позволяват на изследователя да посети най-големия възможен брой полета на дъската?'
                ]

        ]

    ],

    'right-and-left' => [
        'title' => 'Дясно и ляво',
        'text' => '„Дясно и ляво“ е игра за състезание и съдействие. Два отбора си сътрудничат, за да направят път към целта, като същевременно се състезават помежду си да използват възможно най-много от приписаните им плочки: жълтият отбор се опитва да постави възможно най-много завои наляво, а червеният отбор се опитва да постави възможно най-много завои надясно.',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Със старт и финал, подредени като на първия вариант в този видеоклип, възможно ли е един от двата отбора да спечели?',
                    2 => 'В2. Със старт и финал, подредени като в играта, спечелена от Анна, може ли да има равенство?',
                    3 => 'В3. Има ли подредби за старт и финал, които дават предимство на някой от двата отбора?',
                    4 => 'В4. Като се има предвид разпределението между стартовата и финалната позиция, възможно ли е да се предвиди каква ще бъде разликата между печелившия и загубилия отбор?'
                ]

        ]

    ],


    'keep-off-my-path' => [
        'title' => 'Пази се от пътя ми',
        'text' => '„Пази се от пътя ми“ е състезателна игра с два отбора. Отборите започват от срещуположните краища на дъската и строят пътеки, които си пречат една на друга. Отборът, който попречи на другия отбор да продължи пътеката си, печели.',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Има ли стартови точки, които дават предимство на някой от двата отбора?',
                    2 => 'В2. Възможно ли е да се постигне равен резултат?',
                    3 => 'В3. Има ли предимство играчът, който започне пръв?',
                    4 => 'В4. Има ли сигурна стратегия за игра, с която играчът, който започне пръв, може да си гарантира, че няма как да загуби?'
                ]

        ]

    ],

    'tug-of-war' => [
        'title' => 'Теглене на въже',
        'text' => '„Теглене на въже“ е игра за сътрудничество и състезание. Два отбора (жълт и червен) започват от най-долната част на дъската и си сътрудничат да достигнат най-горната част. Жълтият отбор се опитва да достигне полетата вляво, а червеният отбор се опитва да достигне полетата вдясно.',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Има ли стратегия, която винаги да води до победа?',
                    2 => 'В2. Има ли предимство играчът, който започне пръв?',
                    3 => 'В3. Ако и двамата играчи внимават еднакво много, играта винаги ли завършва наравно, тоест в средата?',
                ]

        ]

    ],

    'explorer-without-footprints' => [
        'title' => 'Изследователят ',
        'text' => 'Изследователят ходи по дъската от стартовата точка към целта, като се опитва да мине през всички полета. Докато ходи, изследователят оставя цветни стъпки, които позволяват на робота да последва пътя му, като тълкува цветовете. Играта става още по-интересна, когато изследователят изчисти стъпките и остави само цветовете.',
        'material' => 'както и червен, жълт и сив маркер (или молив)',
        'questions' => [
            'content' =>
                [
                    1 => 'В1. Каква е разликата между дъската, пълна с цветни стъпки и дъската с цветове, но без стъпки?',
                    2 => 'В2. Коя дъска предлага по-голяма свобода на движение, като се спазват същите правилата за завиване, посочени от цветовете?',
                    3 => 'В3. Има ли възможни пътеки на дъската само с цветове, които не са възможни на дъската с цветни стъпки?',
                    4 => 'В4. Има ли възможни пътеки на дъската с цветни стъпки, които не са възможни на дъската само с цветове?'
                ]

        ]

    ],

    'texts' => [
        1 => '„Coding@Home“ представляват кратки видеоклипове със самоучители, задачи, интересни игри и предизвикателства за програмиране, които могат да се използват ежедневно както в семейството, така и на училище. Не са ви необходими предварителни познания по програмиране и не ви трябват никакви електронни устройства, за да извършвате дейностите Заниманията стимулират изчислителното мислене и култивират уменията на ученици, родители и учители у дома и в училище.',
        2 => 'Поредицата Coding@Home на Европейската седмица на програмирането надгражда инициативата <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">“Coding in famiglia”</a> на Урбинския университет и Асоциацията CodeMOOCnet в сътрудничество с Rai Cultura. Дейностите се представят от Алесандро Болиоло, преподавател по компютърни системи в Урбинския университет, <a href="/ambassadors?country_iso=IT" target="_blank">посланик на Италия за Европейската седмица на програмирането</a> и координатор на всички посланици, както и член на Управителния съвет на Коалицията за цифрови умения и работа.  ',
        3 => 'Ако ви интересуват още занимания без компютър или пък на различни езици за програмиране, занимания в областта на роботиката, micro:bit и др., вижте <a href="/training">„Учебни модули“ на Европейската седмица на програмирането</a> с видео самоучители и планове с уроци за начално и различните класове на средното училище. Също така погледнете страницата на Европейската седмица на програмирането с ресурси за <a href="/resources/learn">учащи</a> и <a href="/resources/teach">учители.</a> '
    ]
];