<?php

return [
    'title' => 'Известие за авторски права',
    'training' => [
        0 => 'Уебсайтът на EU Code Week за училищата',
        1 => 'е услуга, поддържана от Европейската комисия',
    ],
    'licence' => [
        0 => 'С изключение на случаите, когато е посочено друго, съдържанието, предоставено на този сайт, е лицензирано съгласно лиценз',
        1 => 'https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en',
        2 => 'Creative Commons Attribution-NonCom Commercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)',
    ],
    'creative-commons' => 'Лицензирането по лицензи на Creative Commons само по себе си не засяга собствеността върху авторските права',
    'third-party' => 'Съдържанието от уебсайтове на трети страни е обект на техните собствени ограничения за авторски права; моля, вижте сайта за повече информация',

];
