<?php
return [
    "common" => [
        "resources" => "Ресурси, от които ще имате нужда",
        "soundtrack" => "Музиката за седмицата на програмирането",
        "moves"=> "Движенията",
        "dance-example" => "Пример от танца на седмицата на програмирането",
        "organizer-guide" => "Ръководство на организатора"
    ],
    "title" => [
        "EU Code Week",
        "Издание 2020 г."
    ],

    "intro" => "През настоящата 2020 година отбелязваме празника на програмирането от 10 до 25 октомври! Поради сегашната здравна обстановка тази година в рамките на седмицата на програмирането ще има повече занимания онлайн. Ще осигурим нови забавни и занимателни дейности, към които можете да се присъедините у дома си или в училище",
    "online-activities" => [
        "title" => "Предлагани открити занимания онлайн",
        "subtitle" => [
            "За да улесним участието Ви в заниманията в рамките на седмицата на програмирането от разстояние, предвиждаме",
            "календар",
            "на предлаганите открити занимания онлайн."
        ],
        "section1" => [
            "title" => "Какво означава „занимание онлайн“?",
            "content" => "Занимание онлайн (т.е. в режим в линия) може да бъде всяко занимание, за което обикновено можете да се запишете на уебсайта на седмицата на програмирането – единствената разлика е в това, че то ще се проведе онлайн. Целта е хората да могат по-лесно да участват в занятията и работилниците по програмиране изцяло онлайн, без да излагат на риск здравето си"
        ],
        "section2" => [
            "title" => "Предлагани открити занимания",
            "content" => "Ако желаете, можете да направите своите занимания онлайн достъпни за всички. Хора от целия свят ще могат да се включат в откритите занимания онлайн – на английски език или на местния език. Ще изберем най-вълнуващите занимания онлайн, които са открити за всички, и ще ги обявим в календара на събитията на нашия уебсайт."
        ],
        "section3" => [
            "title" => "Какво означава това за участниците?",
            "content" => [
                "Всеки ден от седмицата на програмирането ще можете да преглеждате",
                "календара",
                "и да участвате в най-интересните за Вас занимания. Тези събития са най-различни – работилници по роботика, курсове за електронно обучение, семинари в интернет, уроци по програмиране и много други. Изборът е ваш."
            ]
        ],
    ],


    "dance" => [
        "title" => "Танц на седмицата на програмирането",
        "subtitle" => "Кой е казал, че програмистите не могат да танцуват? За да отбележим изданието на седмицата на програмирането за 2020 г., започваме ново занимание – предизвикателството „танц на седмицата на програмирането“ (#CodeWeekDance)",
        "section1" => [
            "title" => "Кой може да участва?",
            "content" => [
                "Каним всички – училища, учители, библиотеки, клубове по програмиране, предприятия и обществени власти – да отбележат седмицата на програмирането за 2020 г., като организират занимание по предизвикателството „танц на седмицата на програмирането“ (#CodeWeekDance) и го добавят към",
                "картата на седмицата на програмирането.",
            ]
        ],
        "section2" => [
            "title" => "Как се участва?",
            "content" => "Изберете измежду петте вида занимания или предложете свое собствено занимание. Независимо кое занимание ще изберете, не забравяйте да го добавите към картата си."
        ],
        "activity1" => [
            "title" => "Програмирайте приятел или родител – нямате нужда от компютър",
            "subtitle" => "Чрез програмирането се осигурява възможност за подаване на команди към електронно устройство. Технически погледнато обаче, за програмирането нямате непременно нужда от компютър. Вместо това вземете един партньор – съученик, приятел, родител или дори учител – и им давайте указания как да изпълнят „танца на седмицата на програмирането“ (#CodeWeekDance), които те трябва точно да следват.",
            "resources" => [
                "Ръководство от Code.org за организирането на Вашата танцувална забава извън мрежата",
                "Кратък урок за програмиране на Вашия човекоробот",

            ]
        ],

        "activity2" => [
            "title" => "Визуално програмиране",
            "subtitle" => "Програмирайте своя танц за седмицата на програмирането в Scratch. Използвайте героите на седмицата на програмирането или създайте свои герои в Scratch и ги програмирайте да изпълнят танца на седмицата на програмирането (#CodeWeekDance).",
            "resources" => [
                "Пример за проект по Scratch за танца на седмицата на програмирането (#CodeWeekDance)",
    "Героите на седмицата на програмирането",
    "Ръководство от Code.org за оживяването на герой",
    "Ръководство от Code.org за организирането на танцувалната Ви забава",
                "Споделете проекта си с нас в това студио по Scratch."
            ]
        ], "activity3" => [
    "title" => "Програмиране въз основа на текст",
    "subtitle" => "Сътворете темата на танца на седмицата на програмирането (#CodeWeekDance) с Python или JavaScript, използвайки платформи за създаване на музика чрез програмиране като EarSketch или Sonic Pi.",
    "resources" => [
        "Урок по създаване на музика с EarSketch",
        "Урок по създаване на музика със Sonic Pi",

    ]
],
        "activity4" => [
    "title" => "Роботика",
    "subtitle" => "Програмирайте робота си, така че да изпълнява заповедите Ви и да изпълни танца на седмицата на програмирането",
    "resources" => [
        "Урок по програмиране на роботи",
    ]
], "activity5" => [
    "title" => "Предизвикателство: танц на живо",
    "subtitle" => "Направете видеозапис, на който Вие, Вашият отбор или Вашият робот изпълнява танца на седмицата на програмирането (#CodeWeekDance) и го споделете в Instagram. Записът Ви може да достигне огромен брой ползватели, а Вие може да спечелите подаръци от седмицата на програмирането! Заинтригувахте ли се? Следвайте тези стъпки:",
    "resources" => [
        "Направете видеозаписа с Instagram Stories",
        "Следвайте",
        "@CodeWeekEU в Instagram",
        "Споменете @CodeWeekEU в своя разказ за танца и използвайте хаштага #CodeWeekDance.",
    ]
],
        "outro" => [
    "Победителите ще бъдат избирани всеки ден и ще бъдат обявявани в нашия канал в Instagram чрез Stories, така че не забравяйте редовно да проверявате известията си, може днес да имате късмет.",
    "Танцът на седмицата на програмирането (#CodeWeekDance) се основава на",
    "Ode to Code („Ода за програмирането“)",
    "композирана от Брендан Паолини, и танца, създаден от Бианка Мария Берарди през 2015 г., по идея на Алесандро Болиоло – преподавател по компютърни системи в Урбинския университет."
],

    ],
    "treasure-hunt"=>[
    "title"=>"Търсене на съкровището през седмицата на програмирането",
    "subtitle"=>[
        "За седмицата на програмирането за 2020 г. въвеждаме една новост – игра в Telegram, която е сравнително лесна за начинаещите и същевременно е достатъчно предизвикателна за опитните участници.",
        "Търсенето на съкровището през седмицата на програмирането",
        "е игра, която най-добре се играе на компютър с мобилен телефон в ръка. В играта трябва да решавате задачи по програмиране и да преминете през историята на програмирането, компютърните науки и технологията в Европа."
    ],
    "section" => [
        "title" => "За да започнете играта, трябва да",
        "content" => [
            "свалите приложението Telegram. То е на разположение за",
            "настолни компютри.",
            "Можете да играете на настолен или преносим компютър или на смартфон. Препоръчваме да играете на компютър, за да можете да получавате указанията и да решавате задачите по програмиране в приложението Telegram на телефона си.",
            "За да играете,",
            "отворете играта",
            "и сканирайте кода за бърза реакция (QR), който ще Ви отведе до приложението Telegram и ще Ви даде първия набор от указания.",
            "За да спечелите, трябва да решите 10 задачи по програмиране и да намерите 10 места на картата на Европа, които са свързани с възникването на програмирането и технологията.",
            "След приключване на играта споделете своя резултат с приятелите си, използвайки #CodeWeek, и ги предизвикайте също да играят и научат за историята на програмирането. Да видим кой ще получи най-високите резултати!",
            "Търсенето на съкровището през седмицата на програмирането е виртуалната версия за 2020 г. на оригиналната игра със същото название, разработена за първи път от Алесандро Болиоло – преподавател по компютърни системи в Урбинския университет. За да научите повече за неговата оригинална игра, посетете нашия",
            "блог."

        ]
    ],
],
    "kick-off"=>[
    "title"=>"Откриване: 8 октомври 2020 г.",
    "content" => [
        "Виртуалното откриване на седмицата на програмирането за 2020 г. ще се проведе на 8 октомври в 17 ч. берлинско/брюкселско/парижко време. Събитието ще бъде предавано на живо във Facebook Live, Instagram TV и YouTube Live.",
        "В нашия вълнуващ списък има гостуващи оратори:",
        "комисар на ЕС по въпросите на вътрешния пазар," ,
        "комисар на ЕС по въпросите на иновациите, научните изследвания, културата, образованието и младежта,",
        "създател на Scratch и преподавател по научни изследвания за обучението в MIT Media Lab,",
        "автор и илюстратор на Hello Ruby",
        "както и",
        "председател на E-MMA – френска организация с нестопанска цел, която популяризира половото разнообразие в технологичната област.",
        "И сякаш това не е достатъчно, екипът на седмицата на програмирането ще покаже новости във връзка с уебсайтове, ресурси и предизвикателства.",
        "Преподавател по компютърни системи в Урбинския университет и координатор на",
        "посланиците на седмицата на програмирането",
        "ще Ви разкаже още за виртуалното търсене на съкровището през седмицата на програмирането.",
        "А xxx ще Ви държи нащрек с новото предизвикателство „танц на седмицата на програмирането“(#CodeWeekDance).",
        "Членовете на общността на европейската седмица на програмирането ще въведат нови местни и световни занимания, или както обичаме да ги наричаме – „местно-световни“ занимания. Освен това ще се свързваме с училища и ученици от цяла Европа, които ще разказват за своя опит в програмирането и ще обменят идеи с гостуващите оратори.",
        "Ще имате възможност също така да споделите мислите и идеите си и да зададете въпросите си. Нужно е само да проследите предаването ни на живо във",
        "или",
        "на 8 октомври 2020 г. от 17:00 до 18.30 ч. централноевропейско време и да дадете отзивите си в социалните мрежи с хаштага #CodeWeek.",
    ]
],
    "get-involved"=>[
    "title"=>"Как да се включите?",
    "subtitle"=>"Нямате търпение да започнете да програмирате? Ако искате да се присъедините към общността на европейската седмица на програмирането, но не знаете откъде да започнете, вижте тези материали, които ще Ви помогнат се ориентирате тъкмо навреме за годишния ни празник през октомври.",
    "content" => [
        "Първи стъпки за седмицата на програмирането",
        "Как да добавим занимание от седмицата на програмирането",
        "Уроци",
        "Подробен и широкообхватен открит онлайн курс (Deep Dive)",
        "Coding@Home series"
    ]]];