<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'title' => 'Редактиране на вашето #codeEU събитие',
    'required_fields' => 'Задължителните полета са маркирани със звездичка *. Чувствайте се свободни да добавите обява за събитието на вашия местен език.',
    'description' => 'Описание',
    'audience' => 'Аудитория',
    'theme' => 'Тема',
    'location' => 'Място',
    'website' => 'Уебсайт',
    'contact' => 'Контакт',
    'tags' => 'Етикети',
    'image' => 'Изображение',
    'help' => 'Размерите на по-големите изображения ще бъдат намалени до 256 x 512 пиксела. Максималният размер за качване е 256 x 1024.',
    'aspect' => 'Кой аспект от програмирането ще обхваща събитието ви?',
    'address' => 'Въведете адрес или щракнете върху картата по-долу, за да зададете място.',
    'privacy_disclaimer' => [
        'header' => 'Вашата информация за контакт',
        'text_1' => 'Тази информация ще бъде видима само за ',
        'link_1' => 'посланиците на Европейската седмица на програмирането',
        'text_2'=> ' и за организаторите на
        Седмицата на програмирането, които
        ще проверят събитието ви, преди да се появи на картата, и може да се свържат с вас, ако е необходимо
        редактиране или
        за администриране на проучванията за статистически цели след провеждане на събитието.',
        'contact_email' => 'Вашият имейл за контакт'
    ], 
    'edit' => 'Редактиране на събитие'
];
