<?php

return [
    'educational_resources_text' => "Добре дошъл! Тук ще намерите колекция от безплатни ресурси, предназначени да подпомогнат вашето учебно пътуване!",
    'share_your_resources_button' => "Споделете ресурсите си",
    'share_your_resources_title' => "Имате безплатни и отворени образователни ресурси?",
    'share_your_resources_text' => "Споделете ги с общността на Европейската седмица на програмирането! Изпратете безплатните си ресурси чрез формата по-долу и ние ще ги представим на тази страница, за да помогнем на другите да учат, създават и растат.",
    'share_your_feedback_button' => "Споделете отзивите си",
    'share_your_feedback_text' => "Кажете ни какво мислите! Споделете отзивите си за съществуващите ресурси – независимо дали имате предложения за подобрение, комплименти или нови идеи, ще се радваме да чуем от вас!",
    'educational_resources_cta_btn' => 'Насоки за разнообразие и приобщаване',
];
