<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'main_title' => 'Добавяне на вашето #EUCodeWeek събитие',
    'button' => 'Добавяне на събитие',
    'howto' => 'Как да организирате ваше собствено събитие',
    'required' => 'Задължителните полета са маркирани със звездичка *. Чувствайте се свободни да добавите обява за събитието на вашия местен език.',
    'audience_title' => 'Аудитория',
    'theme_title' => 'Тема',
    'scoreboard_by_country' => 'Табло',
    'get_involved' => 'Включете се',
    'organize_or_support_events' => 'Организирайте или подкрепете събития във вашия град',
    'or_contact_your' => 'или се свържете с вашите',
    'eu_code_week_ambassadors' => 'посланици на Европейската седмица на програмирането',
    'show_events_for' => 'Показване на събития за ',
    'who' => 'За кого е предназначено събитието?',
    'tags' => 'Етикети',
    'image' => 'Изображение',
    'start' => [
        'label' => 'Начална дата',
        'placeholder' => 'Кога започва събитието?',
    ],
    'end' => [
        'label' => 'Крайна дата',
        'placeholder' => 'Кога свършва събитието?',
    ],
    'organizer' => [
        'label' => 'Име на организацията',
        'placeholder' => 'Организация, в която работите или сте доброволец',
    ],
    'website' => [
        'label' => 'Уебсайт на организатора',
        'placeholder' => 'Имате ли уебсайт с повече информация?',
    ],
    'description' => [
        'label' => 'Описание',
        'placeholder' => 'Опишете накратко планираното събитие.',
    ],
    'contact' => [
        'label' => 'Имейл за контакт',
        'placeholder' => 'Този имейл ще бъде използван за важна кореспонденция относно Европейската седмица на програмирането',
        'explanation' => 'Вашият имейл за контакт ще бъде видим само за посланици на Европейската седмица на програмирането и за организаторите на Седмицата на програмирането, които ще проверят събитието ви, преди да се появи на картата, и може да се свържат с вас, ако е необходимо редактиране или за администриране на проучванията за статистически цели след провеждане на събитието.',
    ],
    'public' => [
        'label' => 'Публичен имейл',
        'placeholder' => 'Искате ли да се показва имейл за контакт?',

    ],
    'title' => [
        'label' => 'Име на събитието',
        'placeholder' => 'Какво е името на събитието?',
    ],
    'address' => [
        'label' => 'Адрес',
        'placeholder' => 'Къде ще се проведе събитието?',
    ],

    'organizertype' => [
        'label' => 'Тип организация',
        'placeholder' => 'Изберете типа на организатора',
        'school' => 'Училище',
        'library' => 'Библиотека',
        'non profit' => 'Организация с нестопанска цел',
        'private business' => 'Частно дружество',
        'other' => 'Друго',
    ],
    'audience' => [
        'Pre-school children' => 'Деца в предучилищна възраст',
        'Elementary school students' => 'Ученици в началното училище',
        'High school students' => 'Ученици в гимназията',
        'Graduate students' => 'Завършили студенти',
        'Post graduate students' => 'Докторанти',
        'Employed adults' => 'Заети възрастни',
        'Unemployed adults' => 'Безработни възрастни',
        'Other (see description)' => 'Други (вж. описанието)',
        'Teachers' => 'Учители',
    ],
    'theme' => [
        'AI & Generative AI' => 'Изкуствен интелект и генеративен ИИ',
        'Robotics, Drones & Smart Devices' => 'Роботика, дронове и смарт устройства',
        'Web, App & Software Development' => 'Уеб, приложения и софтуерна разработка',
        'Game Design' => 'Дизайн на игри',
        'Cybersecurity & Data' => 'Киберсигурност и данни',
        'Visual/Block Programming' => 'Визуално/блоково програмиране',
        'Art & Creative Coding' => 'Изкуство и креативно програмиране',
        'Internet of Things & Wearables' => 'Интернет на нещата и носими технологии',
        'AR, VR & 3D Technologies' => 'AR, VR и 3D технологии',
        'Digital Careers & Learning Pathways' => 'Дигитални кариери и обучителни пътеки',
        'Digital Literacy & Soft Skills' => 'Дигитална грамотност и меки умения',
        'Unplugged & Playful Activities' => 'Без екран и игриви дейности',
        'Promoting Diversity & Inclusion' => 'Насърчаване на разнообразието и приобщаването',
        'Awareness & Inspiration' => 'Осъзнатост и вдъхновение',
        'Other' => 'Друго',
    ],
    'codeweek_for_all_participation_code' => [
        'title' => 'КОД ЗА CODE WEEK 4 ALL',
        'explanation' => 'Ако сте получили код за Code Week 4 all от колега от училище или от приятел, поставете го тук, в противен случай оставете полето празно. Допълнителна информация за Code Week 4 All е налична',
        'link' => 'тук',
    ],
    'thanks_page' => [
        'title' => 'Благодарим ви, че добавихте събитието си!',
        'phrase1' => 'Един от нашите местни посланици сега ще прегледа събитието ви',
        'phrase2' => 'и ще се увери, че всичко изглежда добре.',
        'phrase3' => 'Ако имате някакви въпроси, свържете се с някой от нашите',
        'phrase4' => 'национални посланици',
        'phrase5' => 'или ни изпратете',
        'phrase6' => 'имейл',
        'phrase7' => 'Можете да споделите вашия код за Codeweek for all с други хора:',
    ],
    'activitytype' => [
        'label' => 'Тип мероприятие',
        'placeholder' => '',
        'open-online' => 'Онлайн мероприятие с отворен достъп',
        'invite-online' => 'Онлайн мероприятие с ограничен достъп',
        'open-in-person' => 'Мероприятие с отворен достъп',
        'invite-in-person' => 'Мероприятие с ограничен достъп',

    ],

    'privacy' => 'Прочетох и се съгласих с условията и политиката за поверителност, описани в този документ.',
    'country' => 'Държава',
    'loading' => 'Зарежда се...',
    'add_activity' => 'Добавете събитие',
    'edit_activity' => 'Редактирайте събитие',
    'update_activity' => 'Актуализирайте събитие',
    'delete_activity' => 'Изтрийте събитие',
    'total_pending_events' => 'Общо чакащи събития:',
    'no_pending_events' => 'Няма намерени чакащи събития за',
    'all_countries' => 'Всички държави',
    'current_status' => 'Текущо състояние',
    'actions' => 'Действия',
    'certificate_ready' => 'Вашият сертификат за Седмицата на програмирането е готов. Можете да го изтеглите или да го споделите директно.',
    'view_your_certificate' => 'Вижте своя сертификат тук',
    'submit_event_and_report' => 'Подайте доклад за това събитие и заявете своя сертификат за Седмицата на програмирането.',
    'report_and_claim' => 'Докладвайте събитие и заявете сертификат',

];
