<?php


return [

    'title' => 'Ръководство',
    'organise_activity' => 'Организирайте ваше събитие с #CodeWeek',
    'register_activity' => 'Регистрирайте събитието си тук',
    'what' => [
        'title' => 'Какво представлява Европейската седмица на програмирането?',
        'content' => '<p>Европейската седмица на програмирането е инициатива на равнище граждани, ръководена от доброволци и подкрепяна от Европейската комисия. Всеки — училища, учители, библиотеки, клубове за програмиране, предприятия, публични органи — може да организира събитие #CodeWeek и да го добави към картата <a href="/events">codeweek.eu</a>.</p>'
    ],
    'what_you_need_organise' => [
        'title' => 'Какво ви е нужно, за да организирате събитие?',
        'items' => [
            '1' => '<strong>Група хора, които желаят да учат.</strong> Например вашите приятели, деца, тинейджъри, възрастни колеги, родители или баби и дядовци. Запомнете, че двама вече са група!',
            '2' => '<strong>Учители или преподаватели</strong>, които са запознати със събитието по програмиране и знаят как да преподават и да вдъхновяват хора. Броят зависи от вида и мащаба на събитието.',
            '3' => '<strong>Място на обучението.</strong> Класни стаи, библиотеки, конферентни зали и различни публични пространства са идеални за провеждане на подобни събития.',
            '4' => '<strong>Компютри и интернет връзка.</strong> В зависимост от вашата целева група, можете да помолите участниците да донесат своите собствени лаптопи.',
            '5' => '<strong>Програмиране на живо.</strong> Всъщност не са ви нужни компютри и интернет връзка, за да се учите на изчислително мислене. Разгледайте нашия <a href="/training/coding-without-computers">Модул за обучение на живо</a>, за да започнете.',
            '6' => '<strong>Материали за обучението.</strong> Покажете на участниците колко може да е забавно да създадат нещо сами. Разгледайте нашата <a
                        href="/resources">страница с ресурси</a> и <a href="/training">учебни модули</a> с видео уроци и планове на уроци и ги приспособете към нуждите на вашата група.',
            '7' => '<strong>Регистриране на участници.</strong> Ако местата ви са ограничени, можете да използвате онлайн инструменти от рода на <a href="https://docs.google.com/forms/">Google forms</a> и <a
                        href="https://www.eventbrite.com/">Eventbrite</a> за регистриране на участници.',
            '8' => 'Не забравяйте да <a href="/add">поставите събитието си</a> на <a href="/events">картата на Седмицата на програмирането</a>!',
        ]
    ],
    'how_to' => [
        'title' => 'Как да организирате събитието си?',
        'items' => [
            '1' => 'Форматът на вашето събитие, свързано с програмиране, зависи от вас, но ние препоръчваме да включите <strong>практическа част</strong>, по време на която участниците могат да творят самостоятелно и/или да се упражняват с някакъв хардуер.',
            '2' => 'Използвайте <strong>инструменти и технологии</strong>, които са подходящи за вашата целева група. Препоръчваме ви да използвате <a href="http://codeweek.eu/resources/">свободно достъпен материал с отворен код</a>.',
            '3' => 'Насърчете участниците да <strong>покажат и представят</strong> какво са създали един на друг в края на събитието.',
            '4' => '<strong>Разпространете новината!</strong> Популяризирайте и споделете в социалните медии това, което сте направили по време на събитието, като използвате хаштага #CodeWeek. Също така можете да споделите в <a
                        href="https://www.facebook.com/groups/774720866253044/">групата на учителите за Европейската седмица на програмирането</a> и в Twitter (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Говорете пред приятелите си, пред колеги преподаватели, пред местната преса, направете съобщение за пресата.',
            '5' => 'Не забравяйте да <a href="/add">добавите събитието си</a> на <a href="/events">картата на Седмицата на програмирането</a>!',
        ]
    ],
    'material' => [
        'title' => 'Рекламни материали',
        'text' => '<p>Разгледайте нашия <a href="http://blog.codeweek.eu/">блог</a> за последните новини и не се колебайте да адаптирате последното прессъобщение към вашите нужди или да създадете свой собствен блог:</p>',
        'items' => [
            '1' => '<a href="https://ec.europa.eu/digital-single-market/en/news/gearing-celebrate-eu-code-week-2019">Подготовка за отбелязването на Европейската седмица на програмирането 2019 г.</a> (предлага се на 29 езика)'
        ]
    ],
    'toolkits' => [
        'title' => 'Изтеглете следните набори от инструменти, които ще ви помогнат да започнете:',
        'communication_toolkit' => 'Комуникационен набор от инструменти',
        'teachers_toolkit' => 'Набор от инструменти за учители'
    ],
    'questions' => [
        'title' => 'Въпроси?',
        'content' => '<p>Ако имате въпроси относно организирането и популяризирането на вашето събитие #CodeWeek, се свържете с един от <a href="/ambassadors">посланиците на Европейската седмица на програмирането</a> от вашата държава.</p>'
    ]

];
