<?php

return [

    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Вдъхнете живот на вашите идеи!',
    'sections' => [
        1 => [
            'title' => '6 хакатона, 6 предизвикателства',
            'content' => [
                1 => 'Ако живеете в Латвия, Ирландия, Италия, Румъния, Словения или Испания, това е вашият шанс да използвате творческия си талант, любознателност, ентусиазъм и технически умения. Присъединете се към един от хакатоните в рамките на Европейската седмица на програмирането и разработете иновационно решение, което ще помогне на обществото.',
                2 => 'През 2020 г. по време на Европейската седмица на програмирането ще бъдат организирани шест изключителни хакатона в шест европейски държави, като ученици от горните класове на средните училища (16-19 годишни) ще имат възможност да използват своите умения по програмиране, за да измислят в рамките на 2 дена решение на местно предизвикателство.'
            ]
        ],
        2 => [
            'title' => 'Как мога да участвам?',
            'content' => [
                1 => 'Изберете хакатона във вашата държава и следвайте няколко лесни стъпки за регистрация. Ако желаете да се присъедините заедно с приятели или съученици, не забравяйте да посочите името на вашия отбор. За всеки хакатон ще има отделна регистрация.'
            ]
        ],
        3 => [
            'title' => 'Кои са организаторите?',
            'content' => [
                1 => 'Хакатоните в рамките на Европейската седмица на програмирането се организират съвместно от Европейската комисия и местните ',
                2 => 'посланици на Европейската седмица на програмирането',
                3 => ', като те се финансират от Европейския парламент. Целта е да се покаже как се създават конкретни решения с помощта на творческия талант, ентусиазъм, свежи идеи и умения по програмиране на младите хора.'
            ]
        ],
        4 => [
            'title' => 'Какво представлява хакатонът?',
            'content' => [
                1 => 'Във всеки хакатон ще участват 60 ученици от средните училища, които ще се състезават по отбори в продължение на 2 дни. Накрая всеки отбор ще представи своето решение пред жури от експерти. Опитни наставници ще дават напътствия на екипите, като ще бъдат организирани практически сесии, по време на които участниците ще имат възможност да усвоят нови умения и да се забавляват. Хакатоните предоставят също така чудесна възможност на участниците да създадат контакти и да общуват с хора от местния технологичен сектор.',
                2 => 'Отборът победител във всеки местен хакатон ще получи различни награди, както и възможност да пътува до Брюксел и да представи своето решение пред международна аудитория на 12 октомври 2020 г.',
            ]
        ],
        5 => [
            'title' => 'Не мога да програмирам – какво мога да направя?',
            'content' => [
                1 => 'Наред с хакатоните ще има практически сесии за участници, които са начинаещи в програмирането, работата с хардуер, роботиката и т.н., за да научат някои основни принципи на изчислителното мислене и програмирането. Повече информация относно регистрацията можете да откриете на страницата за вашата държава.'
            ]
        ],

        6 => [
            'title' => 'Партньори',
        ],

    ],

    'cities' => [

        1 => [
            'city' => "",
            'country' => "Ирландия",
            'date' => "април 2020"
        ],
        2 => [
            'city' => "",
            'country' => "Словения",
            'date' => "май 2020"
        ],
        3 => [
            'city' => "",
            'country' => "Румъния",
            'date' => "май 2020"
        ],
        4 => [
            'city' => "",
            'country' => "Испания",
            'date' => "април 2020"
        ],
        5 => [
            'city' => "",
            'country' => "Латвия",
            'date' => "април 2020"
        ],
        6 => [
            'city' => "",
            'country' => "Италия",
            'date' => "април 2020"
        ],
    ],


];
