<?php

return [

    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Вдъхнете живот на вашите идеи!',
    'sections' => [
        1 => [
            'title' => '6 хакатона, 6 предизвикателства',
            'content' => [
                1 => "Живееш в Гърция, Латвия, Ирландия, Италия, Румъния или Словения? Притежаваш креативно мислене, амбициозна личност си и се интересуваш от бъдещето на технологиите? Сега имаш страхотен шанс! Включи се в някой от хакатоните от Европейската седмица на програмирането и създай иновативно решение, с което да поведеш технологичната революция!",
                2 => "През 2021 г. в рамките на EU Code Week (Европейската седмица на програмирането) се организират шест невероятни хакатона. Каним учениците на възраст 15—19 години от горните гимназиални класове да се обединят в екипи и да приложат уменията си по програмиране, за да решат избран от тях местен проблем. След 24-часово „хакване“ всеки от отборите ще представи идеите си пред жури от експерти, което ще избере 10-те отбора финалисти. Всички отбори ще разполагат с еднакво време, ресурси и достъп до ментори и експерти за решаване на предизвикателството, но само 10 от тях ще получат възможността да продължат в следващия кръг, да изградят свой прототип, да получат обучение от експерти и да участват във финалния хакатон през есента. Тогава битката на финалистите ще реши кой ще спечели страхотно IT оборудване и възможността за менторска помощ и обучение на отбора за доразвиване на прототипа."
            ]
        ],
        2 => [
            'title' => 'Как мога да участвам?',
            'content' => [
                1 => "Избери хакатона за твоята страна и се регистрирай в няколко лесни стъпки. Можеш да се включиш самостоятелно или в отбор от шест души. Ако участваш с приятели и съученици, при регистрацията не пропускай да посочиш името на вашия отбор. За всеки от хакатоните регистрацията стартира отделно, затова не забравяй да следиш хакатона за своята страна!"
            ]
        ],
        3 => [
            'title' => 'Кои са организаторите?',
            'content' => [
                1 => 'Хакатоните в рамките на Европейската седмица на програмирането се организират съвместно от Европейската комисия и местните ',
                2 => 'посланици на Европейската седмица на програмирането',
                3 => ', като те се финансират от Европейския парламент. Целта е да се покаже как се създават конкретни решения с помощта на творческия талант, ентусиазъм, свежи идеи и умения по програмиране на младите хора.'
            ]
        ],
        4 => [
            'title' => 'Какво представлява хакатонът?',
            'content' => [
                1 => 'EU Code Week Hackathon е цяло пътешествие, което започва с 24-часов онлайн хакатон. Отборите ще ползват подкрепата на опитни ментори; ще бъдат организирани и работилници, на които участниците не само ще могат да усвояват нови умения, но и да се позабавляват. Хакатонът също така представлява прекрасна възможност за участниците да общуват онлайн и да се запознаят с хора от технологичния сектор в Европа. В края на хакатона всеки отбор ще представи своето решение на жури от експерти. ',
                2 => 'Десетте най-добри отбора ще продължат своето хакатонско пътешествие с обучения и менторска подкрепа през лятото. След това победителите ще участват във финалното събитие — 12-часовия национален хакатон през септември или октомври (който е предвиден да се проведе присъствено, но ако това е невъзможно поради извънредната обстановка, ще се реализира онлайн).',
            ]
        ],
        5 => [
            'title' => 'Не мога да програмирам – какво мога да направя?',
            'content' => [
                1 => 'Наред с хакатоните ще има практически сесии за участници, които са начинаещи в програмирането, работата с хардуер, роботиката и т.н., за да научат някои основни принципи на изчислителното мислене и програмирането. Повече информация относно регистрацията можете да откриете на страницата за вашата държава.'
            ]
        ],

        6 => [
            'title' => 'Партньори',
        ],
        7 => [
            'title' => "Включи се в забавлението!",
        ],


    ],

    'cities' => [

        1 => [
            'city' => "",
            'country' => "Румъния",
            'date' => "17—18 април 2021 г."
        ],
        2 => [
            'city' => "",
            'country' => "Ирландия",
            'date' => "26-27 април 2021 г."
        ],
        3 => [
            'city' => "",
            'country' => "Италия",
            'date' => "7—8 май 2021 г."
        ],
        4 => [
            'city' => "",
            'country' => "Гърция",
            'date' => "7-9 май 2021 г."
        ],
        5 => [
            'city' => "",
            'country' => "Словения",
            'date' => "15—16 май 2021 г."
        ],
        6 => [
            'city' => "",
            'country' => "Латвия",
            'date' => "29—30 май 2021 г."
        ],
    ],
    'final' => [
        1 => 'Финал',
        2 => 'септември/октомври 2021 г.'
    ]



];
