<?php

return [

    'about' => 'Европейската седмица на програмирането е инициатива, насочена към гражданите, която има за цел да представи програмирането и цифровата грамотност на всички по забавен и развлекателен начин.',
    'when' => '5—20 октомври 2019 г.',
    'when_text' => 'Усвояването на програмирането ни помага да разбираме бързо променящия се заобикалящ ни свят, да научим повече за начина на работа на технологиите и да развиваме умения и възможности, за да проучваме нови идеи и да създаваме иновации.',
    'school_banner_title' => 'Вземете участие!',
    'school_banner_text' => 'Вие сте учител?',
    'school_banner_text2' => 'Щракнете тук, за да разберете как да се включите!',
    'organize_activity_title' => 'Организирайте или се присъединете към събитие',
    'organize_activity_text' => 'Всеки е добре дошъл да организира или да се присъедини  към събитие. Просто изберете тема и целева аудитория и <a href="/add">добавете своето събитие</a> към <a href="/events">картата</a>, или потърсете събитие във вашия регион.',
    'get_started_title' => 'Начални стъпки',
    'get_started_text' => 'Не сте сигурни как да започнете? Разгледайте <a href="/guide">страницата Как да</a> и изтеглете нашите <a href="/toolkits">набори от инструменти за организатори</a>, за да се подготвите и да разпространите информацията.',
    'access_resources_title' => 'Достъп до ресурси и обучение',
    'access_resources_text' => 'Ако не сте сигурни как да организирате събитие, посетете нашата <a href="/resources/teach">страница с преподавателски ресурси</a> и материали за <a href="/training">учене и обучение</a> за насоки и специални планове на уроци.',

];
