<?php

return [

    'about' => 'Европейската седмица на програмирането е инициатива, насочена към гражданите, която има за цел да представи програмирането и цифровата грамотност на всички по забавен и развлекателен начин.',
    'when' => '5—20 октомври 2019 г.',
    'when_text' => 'Усвояването на програмирането ни помага да разбираме бързо променящия се заобикалящ ни свят, да научим повече за начина на работа на технологиите и да развиваме умения и възможности, за да проучваме нови идеи и да създаваме иновации.',
    'school_banner_title' => 'Вземете участие!',
    'school_banner_text' => 'Вие сте учител?',
    'school_banner_text2' => 'Щракнете тук, за да разберете как да се включите!'

];
