<?php

return [
    'about' => 'Европейската седмица на програмирането е инициатива, насочена към гражданите, която има за цел да представи програмирането и цифровата грамотност на всички по забавен и развлекателен начин.',
    'when' => '14-27 октомври 2024 г.',
    'when_text' => 'Усвояването на програмирането ни помага да разбираме бързо променящия се заобикалящ ни свят, да научим повече за начина на работа на технологиите и да развиваме умения и възможности, за да проучваме нови идеи и да създаваме иновации.',
    'school_banner_title' => 'Вземете участие!',
    'school_banner_text' => 'Вие сте учител?',
    'school_banner_text2' => 'Щракнете тук, за да разберете как да се включите!',
    'organize_activity_title' => 'Организирайте или се присъединете към събитие',
    'organize_activity_text' => 'Всеки е добре дошъл да организира или да се присъедини  към събитие. Просто изберете тема и целева аудитория и <a href="/add">добавете своето събитие</a> към <a href="/events">картата</a>, или потърсете събитие във вашия регион.',
    'get_started_title' => 'Начални стъпки',
    'get_started_text' => 'Не сте сигурни как да започнете? Разгледайте <a href="/guide">страницата Как да</a> и изтеглете нашите <a href="/toolkits">набори от инструменти за организатори</a>, за да се подготвите и да разпространите информацията.',
    'access_resources_title' => 'Достъп до ресурси и обучение',
    'access_resources_text' => 'Ако не сте сигурни как да организирате събитие, посетете нашата <a href="/resources/teach">страница с преподавателски ресурси</a> и материали за <a href="/training">учене и обучение</a> за насоки и специални планове на уроци.',

    'toolkits_title' => 'Не сте сигурни как да започнете?',
    'toolkits_description' => 'Разгледайте страницата с инструкции и изтеглете нашите организаторски комплекти, за да се подготвите и разпространите информацията.',
    'toolkits_button1' => 'Започни тук',
    'toolkits_button2' => 'Инструменти за организатори',

    'minecraft_description1' => 'Издигнете кодърските си умения на следващото ниво с Minecraft Education. Открийте как Minecraft Education може да преподава умения за кодене и изкуствен интелект и разберете как да започнете още днес!',
    'minecraft_description2' => 'Регистрирайте се, за да получите забавни, интерактивни сесии директно в класната си стая!',
    'minecraft_button' => 'Започнете пътешествието си в Minecraft Обучение тук',

    'activity_title' => 'Организирайте или участвейте в дейност',
    'activity_description' => 'Всеки е добре дошъл да организира или да се присъедини към дейност. Просто изберете тема и целева аудитория и добавете вашата дейност на картата, или разгледайте дейностите във вашия район.',
    'activity_button1' => 'Добавете вашата дейност',
    'activity_button2' => 'Покажи карта на дейностите',

    'resouce_title' => 'Ресурси и обучение',
    'resouce_description' => 'Ако не сте сигурни как да организирате дейност, посетете нашата страница с образователни ресурси и учебни материали за насоки и адаптирани уроци.',
    'resouce_button1' => 'Достъп до ресурси',
    'resouce_button2' => 'Достъп до обучения',
    
    'get_involved' => 'Включете се',
    'meet_our_community' => 'Запознайте се с нашата общност',
    'banner1_title' => 'Дигитални Момичета',
    'banner1_description' => 'Разкрийте и грабнете дигиталните възможности – подкрепа на ново поколение момичета в дигиталния свят!',
    'banner2_title' => 'Нашето Code Week семейство',
    'banner2_description' => 'Открийте нашата динамична мрежа от посланици, учители, ученици и центрове – всеки допринася за споделената ни страст към дигиталното образование.'
];
