<?php

return [
    'free-online-courses' => 'Безплатни онлайн курсове',
    'intro' => 'Европейската седмица на програмирането предлага възможности за професионално развитие под формата на онлайн курсове. Целта е да се подкрепят учителите при въвеждането на програмирането и изчислителното мислене в класната стая.',
    'icebreaker' => [
        'title' => 'Уводният курс „Icebreaker“',
        'text' => [
            0 => '',
            1 => 'Курсът „Icebreaker“ от Европейската седмица на програмирането',
            2 => 'е петчасов курс на английски език, насочен към всеки, който се интересува от основите на програмирането и изчислителното мислене. Участниците научават как да вдъхновяват любознателността и иновативния дух на младите хора и да им дават възможността и способностите да станат дигитални творци. Курсът помага на участниците да открият ползите и значението на изчислителното мислене и програмирането в нашето ежедневие. Той също така предлага идеи, безплатни учебни материали и ресурси за организиране на забавни и образователни занимания за деца по всяко време и навсякъде – особено през Европейската седмица на програмирането.',
            3 => 'За участие в този курс не са ви необходими никакъв предходен опит или знания по програмиране, а само любознателна нагласа.',

        ],
        'registration' => [
            0 => 'Регистрацията е отворена',
            1 => 'тук за курса, който се провежда между 16 септември и 30 октомври 2020 г. Моля, имайте предвид, че трябва да си създадете акаунт в European Schoolnet Academy, за да се регистрирате. ',
        ],
        'check-out' => 'Вижте изданието от 2019 г',
    ],
    'deep-dive' => [
        'title' => 'Задълбоченият курс „Deep Dive“',
        'text' => [
            0 => 'Онлайн курсът от Европейската седмица на програмирането „Deep Dive“ е 25-часов курс на английски език, който дава възможност на преподавателите да се запознаят с принципите в областта на програмирането и да придобият знанията и самочувствието, необходими за организиране на лесни и забавни интерактивни занимания по програмиране за своите ученици. Преподавателите се запознават с безплатните',
            1 => 'ресурси',
            2 => 'ресурси и учебни материали за Европейската седмица на програмирането, налични на 29 езика, и с конкретни аспекти на програмирането като изчислително мислене, занимания без цифрови устройства, безкрайните възможности на роботиката, заиграване с хардуер и създаване на машини, езици за визуално програмиране, създаване на приложения и още много други',
        ],
        'course-link' => 'Вижте курса „Deep dive“ от 2019 г',
    ],
    'social-media' => [
        0 => 'Следвайте',
        1 => 'Европейската седмица на програмирането в социалните медии',
        2 => ', за да разберете кога ще започне следващият курс',
    ],

];
