<?php

return [

    'title' => 'Генерирайте сертификати за участие за вашия клас',
    'phrase1' => 'Попълнете формуляра с името на вашите ученици, отделени със запетая, и ще получите индивидуални сертификати за участие',
    'names' => [
        'label' => 'Имена за сертификата',
        'help' => 'Използвайте запетая между имената на всеки участник'
    ],
    'event_name' => [
        'label' => 'Име на събитие',
        'help' => 'Името на вашето събитие, което да се отпечата на сертификата'
    ],
    'event_date' => [
        'label' => 'Дата на събитието',
        'help' => 'Датата на вашето събитие, която да се отпечата на сертификата'
    ],
    'submit' => 'Общи сертификати',
    'thanks_page'=>[
        'title'=>'Вашите сертификати са генерирани!',
        'phrase1'=>'Кликнете върху тази връзка, за да изтеглите zip файл с всички сертификати',

    ]

];