<?php

return [
   
    'podcasts-text' => 'Включете се за експертни прозрения за кодирането и дигиталната креативност!',
    'podcasts-series-text1' => 'Добре дошли в поредицата подкасти на Европейската седмица на програмирането. Ние доближаваме кодирането, изчислителното мислене, роботиката и иновациите до вас, вашата общност и вашето училище.',
    'podcasts-series-text2' => 'Присъединете се към Ариана Блажич, Евгения Касариего и Ейрини Симеониду, които изследват редица теми – от медийна грамотност до роботика, с помощта на експертни гости – за да ви дадат възможност да предоставите на учениците си уменията да се справят с предизвикателствата и възможностите, породени от цифровото бъдеще.',

];