<?php

return [
    'title' => '',
    '1-intro' => [
        'title' => '1. Въведение',
        'items' => [
            '1' =>
                '<p>Европейската комисия (наричана по-долу „Комисията“) е ангажирана да защитава личните ви данни и да зачита вашата поверителност. Комисията събира и допълнително обработва лични данни съгласно Регламент (ЕС) 2018/1725 на Европейския парламент и на Съвета от 23 октомври 2018 г. относно защитата на физическите лица във връзка с обработването на лични данни от институциите, органите, службите и агенциите на Съюза и относно свободното движение на такива данни (отменящ Регламент (ЕО) № 45/2001).</p>',
            '2' =>
                '<p>Настоящата декларация за поверителност обяснява причината за събирането и обработването, начина, по който събираме, обработваме и гарантираме защитата на всички предоставени лични данни, как се използва тази информация и какви права можете да упражнявате във връзка с личните ви данни (правото на достъп, коригиране, блокиране и т.н.). Тя също така посочва данните за връзка на отговорния администратор на данни, с когото можете да упражните правата си, длъжностното лице по защита на данните и Европейския надзорен орган по защита на данните.</p>',
            '3' =>
                '<p>Тази декларация за поверителност се отнася до събирането и публикуването на лични данни на публично достъпния уебсайт Codeweek.eu на лица, които служат като звена за контакт за дейностите в рамките на Европейската седмица на програмирането (посланици на Седмицата на програмирането, координатори на Министерството на образованието, водещи учители, както и организатори на дейности и събития).</p>'
        ]
    ],
    '2-why' => [
        'title' => '2. Защо обработваме вашите данни?',
        'items' => [
            '1' =>
                '<p>Европейската комисия събира и публикува вашата лична информация, за да улесни идентифицирането на звената за контакт от заинтересовани страни или заинтересовани граждани. Предлагането на реални лица като звена за контакт е най-добрият и най-ефективният начин да се гарантира, че заинтересованите лица могат да се свържат със службите на Комисията.</p>',
            '2' =>
                '<p>Вашите лични данни няма да бъдат използвани за автоматизирано вземане на решения, нито за профилиране.</p>'
        ]
    ],
    '3-legal_process' => [
        'title' =>
            '3. На какво(-и) правно(-и) основание(-я) обработваме личните ви данни',
        'items' => [
            '1' =>
                '<p>Операциите по обработване на лични данни за публикуване на звената за контакт са законни съгласно член 5, параграф 1, буква г) от Регламент (ЕС) 2018/1725, защото сте дали съгласието си за обработването на личните ви данни чрез онлайн формуляр или когато сте се съгласили да използваме имейла и потребителското ви име, в случай че сте се регистрирали в социална мрежа.</p>'
        ]
    ],
    '4-collect_data' => [
        'title' => '4. Какви лични данни събираме и обработваме допълнително?',
        'items' => [
            '1' =>
                '<p>Събраните лични данни представляват информация, която улеснява вашето идентифициране като звено за контакт и увеличава видимостта ви за обществеността, а именно: официално обръщение, име, фамилия, длъжност, служебен пощенски адрес и имейл, телефонен номер, снимка, акаунт в социалните медии, биография.</p>',
            '2' =>
                '<p>Вие предоставихте тези лични данни доброволно, като попълнихте формуляра за кандидатстване.</p>',
            '3' =>
                '<p>Предоставянето на определени лични данни е задължително за публикуване на дейности и/или информация за връзка на уебсайта codeweek.eu. В случай че не предоставите личните си данни, вашата дейност няма да бъде публикувана и/или няма да имате възможност да участвате в гореспоменатите мрежи.</p>',
            '4' => '<p>Всички други лични данни предоставяте доброволно.</p>',
            '5' =>
                'Когато се абонирате за нашия бюлетин, вашият имейл адрес се добавя към списъка с получатели на бюлетина на EU Code Week, който се управлява от Mailerlite.com. Моля, прочетете политиката за поверителност на Mailerlite: https://www.mailerlite.com/legal/privacy-policy. Можете да се откажете от бюлетина по всяко време, като използвате връзката „Unsubscribe“ в имейлите, които получавате от нас, или можете да ни изпратите имейл на info@codeweek.eu с „Unsubscribe“ в темата.'
        ]
    ],
    '5-how_long' => [
        'title' => '5. Колко дълго съхраняваме личните ви данни?',
        'items' => [
            '1' =>
                '<p>Комисията съхранява личните ви данни само за периода, който е необходим за изпълнение на целта на събиране или по-нататъшно обработване, описана в точка 2, а именно дотогава, докато вие служите като звено за контакт.</p>',
            '2' =>
                '<p>Личните ви данни ще бъдат премахнати от публично достъпния уебсайт веднага щом прекратите функцията си на звено за контакт, освен ако не сте дали съгласието си за включване в базата данни за бъдещи дейности.</p>'
        ]
    ],
    '6-protect_data' => [
        'title' =>
            '6. Как защитаваме и гарантираме неприкосновеността на личните ви данни?',
        'items' => [
            '1' =>
                '<p>Всички лични данни в електронен формат (имейли, документи, бази данни, качени партиди данни и т.н.) се съхраняват или на сървърите на Европейската комисия, или на нейния изпълнител. Всички операции по обработване се извършват в съответствие с Решение (ЕС, Евратом) 2017/46 на Комисията от 10 януари 2017 г. относно сигурността на комуникационните и информационните системи в Европейската комисия.</p>',
            '2' =>
                '<p>Изпълнителите на Комисията са обвързани със специална договорна клауза относно операциите по обработване на вашите данни от името на Комисията и със задълженията за поверителност, произтичащи от транспонирането на Общия регламент за защита на данните в държавите – членки на ЕС (Регламент (ЕС) 2016/679, „ОРЗД“).</p>',
            '3' =>
                '<p>За да защити личните ви данни, Комисията е разработила и въвела редица технически и организационни мерки. Техническите мерки включват подходящи действия за справяне със сигурността онлайн, риска от загуба на данни, промяната на данни или непозволения достъп, като се вземат предвид рискът, свързан с обработването, и естеството на обработваните лични данни. Организационните мерки включват ограничаване на достъпа до личните данни единствено до упълномощени лица, които имат основателна необходимост да са запознати с целите на операцията по обработване.</p>'
        ]
    ],
    '7-access_data' => [
        'title' => '7. Кой има достъп до вашите данни и на кого се разкриват?',
        'items' => [
            '1' =>
                '<p>Достъп до личните ви данни се предоставя на служителите на Комисията, отговорни за извършването на тази операция по обработване, и на упълномощени служители съгласно принципа „необходимост да се знае“. Такива служители спазват законовите и при необходимост допълнителните споразумения за поверителност.</p>',
            '2' =>
                '<p>По-конкретно, достъп до всички лични данни, които сте предоставили, могат да имат администраторите на уебсайтове (служители на Комисията), както и други служители на Комисията съгласно принципа „необходимост да се знае“.. Освен това личната ви информация и информацията за събитията ще бъдат споделяни с членове на мрежите на посланиците на Европейската седмица на програмирането и на образователните координатори за организиране на дейности на местно ниво или за последващи действия.</p>',
            '3' =>
                '<p>За да се увеличи видимостта на звената за контакт, вашите лични данни се публикуват на публичния уебсайт: https://codeweek.eu без ограничения за достъп.</p>',
            '4' => '<p><i>Относно предаването на данни на трети страни</i></p>',
            '5' =>
                '<p>Информацията, която събираме, няма да бъде предоставяна на трета страна, освен до степента и за целта, която може да бъде изискана от нас по закон.</p>'
        ]
    ],
    '8-rights' => [
        'title' => '8. Какви са вашите права и как можете да ги упражните?',
        'items' => [
            '1' =>
                '<p>Имате конкретни права в качеството си на „субект на данни“, съгласно глава III (членове 14–25) от Регламент (ЕС) 2018/1725, по-специално правото на достъп, коригиране или изтриване на личните ви данни и правото да ограничите обработването на личните ви данни. Когато е приложимо, вие също имате право да възразите срещу обработването или право на преносимост на данните.</p>',
            '2' =>
                '<p>Вие се съгласихте да ни предоставите личните си данни за настоящата операция по обработване и можете да оттеглите съгласието си по всяко време, като уведомите администратора на данни. Оттеглянето няма да окаже влияние върху законността на обработването, извършено преди да сте оттеглили съгласието.</p>',
            '3' =>
                '<p>Можете да упражните правата си, като се свържете с администратора на данни, а в случай на конфликт – с длъжностното лице по защита на данните. Ако е необходимо, можете да се обърнете и към Европейския надзорен орган по защита на данните. Техните данни за връзка са дадени в раздел 9 по-долу.</p>'
        ]
    ],
    '9-contact' => [
        'title' => '9. Информация за връзка',
        'data-controller' => [
            'title' => '– Администратор на данни',
            'text' =>
                '<p>В случай че желаете да упражните правата си съгласно Регламент (ЕС) 2018/1725 или ако имате коментари, въпроси или притеснения, или ако желаете да подадете жалба относно събирането и използването на личните ви данни, моля, не се колебайте да се свържете с администратора на данни,</p>',
            'address' =>
                'ГД „Съобщителни мрежи, съдържание и технологии“, Отдел F4<br> Сграда BU25<br> B-1049 Брюксел<br> ',
            'email' => 'Имейл '
        ],
        'data-protection-officer' => [
            'title' => '– Длъжностно лице от Комисията по защита на данните',
            'text' =>
                '<p>Можете да се свържете с длъжностното лице по защита на данните (<a href="mailto:DATA-PROTECTION-OFFICER@ec.europa.eu">DATA-PROTECTION-OFFICER@ec.europa.eu</a>) по отношение на въпроси, свързани с обработването на личните ви данни съгласно Регламент (ЕС) 2018/1725.</p>'
        ],
        'european-data-protection' => [
            'title' => '– Европейски надзорен орган по защита на данните',
            'text' =>
                '<p>Имате право да се обръщате (т.е. можете да подадете жалба) към Европейския надзорен орган по защита на данните (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>), ако смятате, че правата ви съгласно Регламент (ЕС) 2018/1725 са нарушени при обработването на личните ви данни от страна на администратора на данни.</p>'
        ]
    ]
];
