<?php

return [
    'title' => 'ЗАЩИТА НА ЛИЧНИТЕ ВИ ДАННИ',
    'processing-operation' => [
        'Операция по обработване',
        'Обработване на лични данни в codeweek.eu, включително IP адреси, на посетителите на публично достъпните уебсайтове.',
    ],

    'data-controller' => [
        'Администратор на лични данни',
        'Генерална дирекция „Съобщителни мрежи, съдържание и технологии“ на Европейската комисия, отдел G.2.',
    ],
    'record-reference' => 'Номер на записа',
    'table-of-contents' => 'Съдържание',

    '1-intro' => [
        'title' => 'Въведение',
        'items' => [
            '1' => 'Европейската комисия (наричана по-нататък „Комисията“) е поела ангажимент да защитава личните Ви данни и да зачита неприкосновеността на личния Ви живот. Комисията събира и впоследствие обработва лични данни в съответствие с <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv:OJ.L_.2018.295.01.0039.01.ENG&toc=OJ:L:2018:295:TOC">Регламент (ЕС) 2018/1725</a> на Европейския парламент и на Съвета от 23 октомври 2018 г. относно защитата на физическите лица във връзка с обработването на лични данни от институциите, органите, службите и агенциите на Съюза и относно свободното движение на такива данни и за отмяна на Регламент (ЕО) № 45/2001.',
            '2' => 'Настоящата декларация за поверителност съдържа обяснение за причината за обработването на личните Ви данни, за начина, по който събираме, обработваме и осигуряваме защитата на всички предоставени лични данни, за това как се използва информацията и какви са правата Ви във връзка с личните Ви данни. В нея са посочени и координатите за връзка с отговорния администратор на лични данни, пред когото можете да упражните правата си, с длъжностното лице за защита на данните и с Европейския надзорен орган по защита на данните.',
            '3' => [
                'Информацията, свързана с дейността по обработване на данни',
                'Обработването на лични данни в codeweek.eu,',
                'извършвано от Комисията, е описано по-долу.',
            ],
        ],
    ],
    '2-why' => [
        'title' => 'Защо и как обработваме личните Ви данни?',
        'items' => [
            'Цел на операцията по обработване',
            'Генерална дирекция „Съобщителни мрежи, съдържание и технологии“ на Европейската комисия предлага редица външни уебсайтове. Техническите настройки събират и използват Вашата лична информация, за да могат да се предоставят тези уебсайтове, които физически са разположени извън контролираната от Комисията хостинг инфраструктура.',
            'Личните Ви данни няма да бъдат използвани за автоматизирано вземане на решения, включително профилиране.',
        ],
    ],
    '3-legal_process' => [
        'title' => 'На какво(и) правно(и) основание(я) обработваме личните Ви данни?',
        'items' => [
            'Обработваме личните Ви данни на няколко основания:',
            '<strong>Член 5, параграф 1, буква а) от Регламент (ЕС) 2018/1725</strong>: това обработване е <span style="text-decoration: underline">необходимо за изпълнението на задача</span> от обществен интерес или при упражняването на официално правомощие, което е предоставено на институцията или органа на Съюза.',
            'Всъщност информирането на широката общественост е задача, произтичаща от собствените правомощия на Европейската комисия на институционално равнище, както е предвидено в член 58, параграф 2, буква г) от Регламент (ЕС, Евратом) 2018/1046 на Европейския парламент и на Съвета от 18 юли 2018 г. за финансовите правила, приложими за общия бюджет на Съюза (ОВ L 193, 30.7.2018 г., стр. 1). Гарантираме, че за обработването на лични данни се прилагат адекватни и конкретни предпазни мерки в съответствие с приложимото законодателство за защита на данните.',
            '<strong>Член 5, параграф 1, буква г) от Регламент (ЕС) 2018/1725:</strong> за дейностите по обработване, състоящи се в „бисквитки“ и удостоверяване, е необходимо Вашето <span style="text-decoration: underline">съгласие. В съответствие с член 3, точка 15 и член 7 от Регламент (ЕС) 2018/1725 съгласието трябва да бъде свободно изразено, конкретно, информирано и недвусмислено.',
            'Получили сме съгласието Ви директно от Вас. Може да сте го изразили чрез електронна поща, подаване на формуляр за електронна регистрация или в друга писмена форма.',
        ],
    ],
    '4-collect_data' => [
        'title' => 'Какви лични данни събираме и впоследствие обработваме?',
        'items' => [
            'За да <strong>извърши тази операция по обработване</strong>, отдел G.2 събира следните категории лични данни:',
            'Адрес по интернет протокол (IP адрес) или идентификационен номер на устройството, използвано за достъп до уебсайта.',
            'Без това обработване няма да можете да установите техническа връзка между Вашите устройства и сървърната инфраструктура и следователно няма да можете да получите достъп до нашия уебсайт.',
            'За да може самоличността Ви <strong>да бъде удостоверена на този уебсайт</strong>, отдел G.2 събира следните категории лични данни:',
            'Електронна поща',
            'Парола; или',
            'Удостоверяване чрез социални медии.',
        ],
    ],
    '5-how_long' => [
        'title' => 'Колко време съхраняваме личните Ви данни?',
        'items' => [
            'Отдел G.2 съхранява личните Ви данни само за времето, което е необходимо за изпълнение на целите на събирането или последващата обработка, а именно времето на сесията на сърфиране. Освен това IP адресите могат да бъдат запазени за една година в регистрационните файлове на службите от съображения за сигурност. Що се отнася до аналитичните инструменти, IP адресът и идентификационният номер на устройството (напр. IMEI номер и WIFI MAC адрес) се изтриват незабавно при прекъсване на връзката.',
        ],
    ],
    '6-protect_data' => [
        'title' => 'Как опазваме и съхраняваме личните Ви данни?',
        'items' => [
            'Всички лични данни в електронен формат (електронни писма, документи, бази данни, качени групи от данни и т.н.) се съхраняват на сървърите на Европейската комисия. Всички операции по обработване се извършват съгласно',
            'Решение (ЕС, Евратом) 2017/46 на Комисията',
            ', от 10 януари 2017 г. относно сигурността на комуникационните и информационните системи в Европейската комисия.',
            'За да защити личните Ви данни, Комисията е въвела някои технически и организационни мерки. Техническите мерки включват подходящи действия по отношение на сигурността онлайн и риска от загуба на данни, от промяна на данните или от неразрешен достъп, като се вземат предвид свързаният с обработването риск и естеството на обработваните лични данни. Организационните мерки включват предоставяне на достъп до личните данни единствено на оправомощени лица със законна необходимост да бъдат осведомени за целите на операцията по обработване.',

        ],
    ],
    '7-access_data' => [
        'title' => 'Кой има достъп до личните Ви данни и на кого се предоставят те?',
        'items' => [
            'Достъп до личните Ви данни се предоставя на служителите на Комисията, които отговарят за извършването на тази операция по обработване, както и на упълномощени служители в съответствие с принципа „необходимост да се знае“. Тези служители работят при спазване на законоустановените изисквания, а при необходимост — и на допълнителни споразумения за поверителност.',
            'Освен това достъп до личните Ви данни може да се предоставя на външни изпълнители, които работят от името на и по силата на договорно споразумение със службата на Комисията, на която са уебсайтовете, и които се занимават със създаването, поддръжката, управлението и архивирането на уебсайтове, в съответствие с принципа „необходимост да се знае“.',
            'Информацията, която събираме, няма да бъде предоставяна на трети страни, освен в степента и за целта, за която законът може да изисква това от нас.',
        ],
    ],
    '8-rights' => [
        'title' => 'Какви са правата Ви и как можете да ги упражните?',
        'items' => [
            'Като „субект на данните“ Вие разполагате с конкретни права съгласно глава III (членове 14—25) от Регламент (ЕС) 2018/1725, по-специално с правото на достъп до Вашите лични данни, правото на коригиране или изтриване на тези данни, както и правото на ограничаване на обработването на Вашите лични данни. Когато е приложимо, имате също право да възразите срещу обработването, както и право на преносимост на данните.',
            'Имате право да възразите срещу обработване на личните Ви данни, което се извършва законосъобразно съгласно член 5, параграф 1, буква а).',
            'Вие сте се съгласили да предоставите личните си данни за настоящата операция по обработване. Можете да оттеглите съгласието си по всяко време, като уведомите отдел G.2. Оттеглянето на Вашето съгласие няма да засегне законосъобразността на извършеното преди това обработване.',
            'Можете да упражните правата си, като се свържете с администратора на лични данни, а в случай на конфликт — с длъжностното лице за защита на данните. При необходимост можете да се обърнете и към Европейския надзорен орган по защита на данните. Координатите за връзка с тях са дадени в точка 9 по-долу.',
            'Ако желаете да упражните правата си в контекста на една или няколко конкретни операции по обработване, посочете в искането си тяхното описание (т.е. техните референтни номера в съответствие с посоченото в точка 10 по-долу).',
        ],
    ],
    '9-contact' => [
        'title' => 'Информация за връзка',
        'data-controller' => [
            'title' => 'Администратор на лични данни',
            'text' => 'Ако желаете да упражните правата си съгласно Регламент (ЕС) 2018/1725, ако имате коментари, въпроси или опасения или ако желаете да подадете жалба относно събирането и използването на личните Ви данни, моля, не се колебайте да се свържете с администратора на лични данни, отдел G.2, Европейска комисия, на адрес',

        ],
        'data-protection-officer' => [
            'title' => 'Длъжностно лице по защита на данните (ДЛЗД) на Комисията',
            'text' => "Можете да се свържете с длъжностното лице по защита на данните (<a href='mailto:DATA-PROTECTION-OFFICER@ec.europa.eu'>DATA-PROTECTION-OFFICER@ec.europa.eu</a>) по въпроси, свързани с обработването на личните Ви данни съгласно Регламент (ЕС) 2018/1725.",
        ],
        'european-data-protection' => [
            'title' => 'Европейски надзорен орган по защита на данните (ЕНОЗД)',
            'text' => 'Имате право на обжалване (т.е. можете да подадете жалба) пред Европейския надзорен орган по защита на данните, (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>) ако считате, че правата Ви съгласно Регламент (ЕС) 2018/1725 са били нарушени в резултат на обработването на личните Ви данни от администратора на лични данни.',
        ],
    ],
    '10-detailed-info' => [
        'title' => 'Къде може да намерите по-подробна информация?',
        'items' => [
            'Длъжностното лице за защита на данните (ДЛЗД) на Комисията публикува регистър на всички операции по обработване на лични данни от страна на Комисията, които са документирани и за които ДЛЗД е уведомено. За достъп до регистъра използвайте следния адрес: <a href="https://ec.europa.eu/dpo-register">https://ec.europa.eu/dpo-register</a>',
            'Тази конкретна операция по обработване е включена в публичния регистър на длъжностното лице по защита на данните под следния референтен номер: <strong>DPR-EC-09706.1</strong>.',
        ],
    ],
];
