<?php

return [
    'remote-teaching' => 'дистанционното обучение',
    'intro' => [
        'title' => 'Седмицата на програмирането и дистанционното обучение',
        'text' => 'Дистанционното обучение може да бъде голямо предизвикателство за учителите и учащите и има много пречки, които трябва да бъдат преодолени. Въпреки това не е необходимо преподаването на програмиране, изчислително мислене или дори роботика да спира, защото учениците ви са у дома. Ето някои съвети и ресурси, които се надяваме, че ще ви бъдат полезни.',
        'points' => [
            1 => 'това е колекция от кратки видеоклипове, материали тип „направи си сам“, пъзели, игри и задачи за програмиране, които можете да използвате всеки ден както у дома, така и в училище.',
            2 => ['Програмиране без компютър', 'тук ще намерите различни занятия, които лесно можете да правите у дома, за да учите или да преподавате програмиране с материали от ежедневието.'],
            3 => [
                'Уроци',
                'тук ще намерите уроци за устойчивото развитие и изкуствения интелект, които включват раздели за дистанционно обучение в своите учебни планове.',
            ],
            4 => [
                'Хранилище на ресурси',
                'много от ресурсите в хранилището могат да се използват и при дистанционно обучение. Ще намерите ресурси за преподаване или изучаване на програмиране.',
            ],
            5 => [
                'Уебинари за програмиране от вкъщи',
                'знаете ли, че в рамките на Седмицата на програмирането бяха организирани няколко уебинара за това как да изучавате и преподавате програмиране от вкъщи? Вижте ги!',
            ],

        ],
    ],
    'tips' => [
        'title' => '7 съвета за дистанционно преподаване на програмиране',
        'points' => [
            1 => [
                'Запознайте се с понятията, езика за програмиране и софтуера',
                'въпреки че учениците могат да се учат да програмират отчасти самостоятелно по метода на пробата и грешката, ще трябва да ги насочвате и да им помагате да откриват своите синтактични грешки. Бъдете готови да правите промени и да адаптирате занятията, ако даден цифров инструмент или програмен език не води до очакваните резултати от обучението.',
            ],
            2 => [
                'Предоставяйте възможности на учениците',
                'помогнете на учениците си да реализират пълния си потенциал, като провеждате мотивиращи и съдържателни уроци. Давайте им възможност да тестват своите умения и творчески способности, като им позволявате да избират проекти, в които да участват, и резултати, които да постигнат. Освен това ви препоръчваме да бъдете реалисти и да определяте цели, които могат да бъдат постигнати от вашите ученици..',
            ],
            3 => [
                'Насърчавайте учениците да работят в групи',
                'програмирането в група е не само по-забавно, но и ще помогне на учениците да осъществяват по-сложни и творчески проекти. Освен това дистанционното обучение може да доведе до чувство на самота сред някои ученици, а груповата работа може да предотврати това. Например можете да създадете онлайн стаи за срещи, в които учениците да се събират по групи, или да поканите учениците да оценяват взаимно проектите си и така да дават и получават конструктивна обратна информация.
', ],
            4 => [
                'Проучете възможностите за изучаване на програмиране, предоставяни от софтуер с отворен код и безплатни онлайн платформи:',
                'има множество качествени ресурси за изучаване и преподаване на програмиране, които са на високо равнище, но същевременно са лесни за ползване. Това са безплатни инструменти, които вашите ученици могат да използват, без да е необходимо заплащането на лицензи или изтеглянето на софтуер. Ще намерите голяма част от тях в хранилището на Седмицата на програмирането, например Scratch, App Inventor, Code.org, EarSketch, Sonic Pi и други. Както видяхме с уроците на Седмицата на програмирането, можете да използвате тези инструменти за работа по всякакви теми!',

            ],
            5 => [
                'Направете го забавно',
                'първите стъпки в програмирането трябва да са интересни и забавни. Въпреки че този път това приятно преживяване няма да бъде на живо с останалите, има и други начини за съвместни игри и забавления! Например можете да предложите на учениците да си починат от уроците, като играят заедно CodyColor — образователна игра за развитие на изчислително мислене, в която могат да участват много играчи.',

            ],
            6 => [
                'Симулирайте реално взаимодействие в класната стая',
                'технологиите ни позволяват да възпроизведем поне частично взаимодействието, което протича в класната стая. Можете да насърчите учениците си да включват камерите си в определени моменти, да вдигат ръце виртуално, да задават въпроси лично или в чата, да участват в цифрови анкети и тестове и т.н. Ето някои цифрови инструменти, които можете да използвате за целта — Zoom, Microsoft Teams, GoToMeeting или Jitsi за учебни часове на живо и Kahoot, Mentimeter или Google Forms за анкети и взаимодействие в класната стая. Това ще помогне на учениците да се чувстват все едно са в клас и да усещат, че са свързани със своите връстници.',
            ],
            7 => [
                'Погрижете се материалите да са достъпни',
                'направете уроците си по програмиране реалистични и приобщаващи, като се уверите, че необходимите материали могат лесно да бъдат намерени във всяко домакинство и че всички ученици могат да си ги набавят или че сте в състояние да адаптирате уроците за тези, които не могат. Например за заниманията по безкомпютърно програмиране са необходими евтини материали, като ножици, хартия или маркери. Когато използвате онлайн занятия по програмиране, уверете се, че всички ученици имат достъп у дома до таблет или компютър и надеждна интернет връзка.',

            ],

        ],
        'conclusion' => 'Как изучавате и преподавате програмиране от разстояние? Имате ли други съвети за работещите в сферата на образованието? Добавете коментар във форума по-долу!',
    ],

];
