<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'title' => 'Докладване на вашето #codeEU събитие',
    'event_title' => 'Заглавие на събитието',
    'number_required' => 'Моля, направете груба оценка, дори да не разполагате с точни данни.',
    'phrase1'=>'Можете да попълните този формуляр само веднъж! Моля, проверете данните си внимателно. Ако допуснете грешка, ',
    'phrase2'=>'След изпращане на доклада автоматично ще се издаде персонален сертификат за участие в Седмицата на програмирането и ще можете да го изтеглите или споделите. Можете да видите примерен сертификат тук.',
    'phrase3'=>'Задължителните полета са маркирани със звездичка *.',
    'phrase4'=>'Можете да попълните този формуляр само веднъж! Моля, проверете данните си внимателно. Ако допуснете грешка,',
    'contactus'=>'свържете се с нас',
    'participants_count' => [
        'label' => 'Брой участници',
    ],
    'average_participant_age' => [
        'label'=>'Средна възраст на участниците',
    ],
    'percentage_of_females' => [
        'label' => 'Процент жени',
    ],
    'codeweek_for_all_participation_code' => [
        'label' => 'Код за участие за Codeweek for all',
        'help' => 'Тук можете да въведете вашия код за предизвикателство за Codeweek4All, ако имате такъв. Ако няма да участвате, игнорирайте това поле.'
    ],
    'name_for_certificate' => [
        'label' => 'Име за сертификата',
        'help' => 'Променете това име с името на организатора на събитието, на когото ще бъде издаден сертификат за участие в Седмицата на програмирането. Моля, използвайте само ASCII букви (на латиница). Букви с ударения, умлаути и други подобни не се поддържат.'
    ],
    'submit' => 'Изпращане на доклад за събитие',
    'thanks_page'=>[
        'title'=>'Благодарим ви, че ни докладвахте за вашето събитие!',
        'certificate_ready'=>'Сертификатът ви е готов.',
        'download_button'=>'Щракнете, за да го изтеглите.',
        'back_events'=>'Назад към събитието'
    ]



];
