<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application"s requirements.
    |
    */
    'title' =>'Училища: представете Седмицата на програмирането на вашите ученици',
    '1' => [
        "title1" => "Защо трябва да представите програмирането във вашата класна стая?",
        "title2" => "Каква е ползата за вашите ученици от програмирането? Каква е ползата за вас като учител?",
        "content" => [
            "Ние вярваме, че основната грамотност на който и да е човек в цифровия век трябва да включва познаване на програмирането и развитие на ключови умения, свързани с компютърното мислене, като например решаване на проблеми, сътрудничество и аналитични умения.",
            "Обучението по програмиране може да осигури възможност на вашите ученици да заемат водеща позиция в едно цифрово компетентно общество, да развият едно по-добро възприемане на света, който ги заобикаля, и да получат по-добри шансове за успех в личния и професионалния си живот.",
            "Седмицата на програмирането предлага на всички ученици възможността да направят първите си стъпки като цифрови творци, като предоставя на училищата и учителите безплатни възможности за професионално развитие, учебни материали, международни предизвикателства и възможност за обмяна на опит."
        ],
        "button" => [
            "label" => "Искате да започнете веднага? Регистрирайте се тук!",
        ]
    ],
    '2' => [
        "title1" => "Готови ли сте да се включите?",
        "title2" => "Организирайте урок, обучителна сесия или събитие и го обозначете на картата.",
        "content" => [
            "Независимо от това дали имате или не някакви знания по програмиране, лесно можете да организирате урок във вашата класна стая, ден на отворените врати или събитие във вашето училище. Просто изберете дата и регистрирайте вашето събитие на картата по-долу. Ако смятате, че имате нужда от помощ за подготовката на урок по програмиране, преминете към следващия раздел.",
            "Вижте някои примери за събития, които се организират, като разгледате картата по-долу и добавете вашето собствено, за да се присъедините към колеги предподаватели от цяла Европа и извън нейните предели: "

        ],
        "button" => [
            "label" => "Готови ли сте да опитате? Добавете събитие!",
        ]

    ], '3' => [

        "title1" => "Програмирането за вас е нещо ново? Не се тревожете",
        "title2" => "Нашите инструменти ще ви въведат в програмирането, преди да го представите на вашите ученици",
        "content" => [
            "Ако се интересувате от представянето на програмирането в класната стая, но не знаете откъде да започнете, не се притеснявайте! Международен екип от преподаватели и експерти разработва набор от кратки онлайн модули за обучение, които ще ви помогнат да започнете.",
            "Не е необходимо да имате предишен опит в областта на програмирането, за да следвате нашите учебни модули!"

        ],
        "button" => [
            "label" => "Достъп до модулите за обучение",
        ]
    ], '4' => [

        "title1" => "Търсите допълнително предизвикателство?",
        "title2" => "Създайте мрежа от събития, ангажирайте възможно най-много ученици и спечелете сертификата за отлични постижения",
        "content" => [
            "Code Week 4 All ви предизвиква да обедините усилията си с други учители или училища и да участвате в една международна общност от съмишленици, която дава възможност на учениците да направят първите си стъпки в програмирането. Създайте съюз, в който участват над 500 ученици, и ще получите сертификат за отлични постижения.",

        ],
        "button" => [
            "label" => "Научете повече за предизвикателството на Code Week 4 All",
        ]
    ],


];
