<?php

return [

    'featured-activities' => 'Вижте предстоящите дейности в рамките на Европейската седмица на програмирането, в които може да се участва онлайн. Можете да филтрирате по език и месец. Като щракнете върху „Преглед“ ще видите всички подробности за съответната дейност и координатите за връзка с организаторите. Приятни занимания!',
    'learn' => 'Програмирането е ключово умение, което все по-често се изисква във всяка област, затова целта на Европейската седмица на програмирането е да ви помогне да се научите да програмирате! Разгледайте нашето хранилище и открийте подходящия ресурс, за да започнете или продължите пътешествието си в света на програмирането. Всички тези ресурси са безплатни. Не забравяйте, че можете да филтрирате търсенето по вид ресурс, ниво на умения, език за програмиране, категория и език.',
    'teach' => 'Програмирането е ключово умение, което ще разкрие нови възможности пред вашите ученици и деца. Искате да преподавате програмиране вкъщи, в класната стая или в клуб по програмиране? Разгледайте нашето хранилище, за да намерите най-подходящия ресурс за включване на програмирането във вашата преподавателска практика. Всички тези ресурси са безплатни. Не забравяйте, че можете да филтрирате търсенето по вид ресурс, ниво на умения, език за програмиране, тема, категория и език.',
    'toolkits' => [
        'В този раздел ще намерите материали, които ще ви помогнат да организирате вашата дейност в рамките на Европейската седмица на програмирането и да популяризирате инициативата във вашата общност.',
        'Комуникационни материали',
        'официалните лога на Европейската седмица на програмирането, значка, листовка, плакат, PowerPoint и Word образци, примери за публикации в социалните медии, илюстрации',
        'Материали за учителите',
        'официалните лога на Европейската седмица на програмирането, значка, образец на сертификат за участие за вашите ученици, презентация за Европейската седмица на програмирането и материали за социалните медии',
        'Официална брошура на Европейската седмица на програмирането',
    ],
    'about' => [
        'goal' => 'Целта е да се помогне на повече млади хора да усвоят основите на програмирането и изчислителното мислене.',
    ],
    'guide' => [
        'tutorials' => [
            '1' => 'Използвайте нашите',
            '2' => 'уроци и обучения',
            '3' => ', достъпни на 29 езика, за да организирате дейности, при които младите хора се учат на програмиране и изчислително мислене.',
        ],
    ],
    'dance' => [
        'menu' => 'Танцово предизвикателство',
        'subtitle' => 'Кой казва, че програмистите не могат да танцуват? Ще докажем обратното с предизвикателството "танц на седмицата на програмирането" (#EUCodeWeekDance).',
        'content' => 'Каним всички – училища, учители, библиотеки, клубове по програмиране, предприятия и публични органи – да отбележат седмицата на програмирането, като организират занимание във връзка с предизвикателството "танц на седмицата на програмирането" (#EUCodeWeekDance) и го добавят към картата на седмицата на програмирането.',
    ],
    'treasure-hunt' => [
        'menu' => 'Търсене на съкровище',
        'subtitle' => 'Това е игра в Telegram',
    ],

    'videos' => [
        1 => 'Гледайте посветените на нашите ценности видеоклипове на посланиците на Европейската седмица на програмирането',
        2 => 'Гледайте Катя Ошляк, посланик за Словения — Защо Седмицата на програмирането е независима',
        3 => 'Гледайте Лоран Туше, посланик за Франция — Защо Седмицата на програмирането е за всички',
        4 => 'Гледайте Фатма Буазиз, посланик за Тунис — Защо седмицата на програмирането е глокална',
        5 => 'Гледайте Линда Синка, посланик за Латвия — Защо сътрудничеството е важно за Седмицата на програмирането',
        6 => 'Гледайте Алесандро Больоло, посланик за Италия — Защо Седмицата на програмирането е с нестопанска цел',
        7 => 'Гледайте Маряна Прифти, посланик за Албания — Защо Седмицата на програмирането насърчава новаторството и творчеството',
        8 => 'Гледайте Кристиана Лукачи, посланик за Румъния — Признателност към общността на Седмицата на програмирането',
    ],

    'learn_and_teach_1' => 'Хранилище на ресурси, за да започнете или продължите вашето пътуване с кодиране и да развиете цифрови и технически умения – всички те са достъпни безплатно.',
    'learn_and_teach_2' => 'Програмирането и програмирането са ключови компетентности, които са все по-търсени във всяка област и Европейската седмица на програмирането иска да ви подкрепи във вашето преподаване и учене! Разгледайте нашето хранилище и намерете идеалния ресурс, за да започнете или да продължите своето пътуване с кодиране. Всички тези ресурси са безплатни. Не забравяйте, че можете да филтрирате търсенето си по заглавие, тип ресурс, ниво на умения, език за програмиране, тема, категория и език.',

];
