<?php

return [

    "about" => [
        "goal" => "Целта е да се помогне на повече млади хора да усвоят основите на програмирането и изчислителното мислене."
    ],
    "guide" => [
        "tutorials" => [
            "1" => "Използвайте нашите",
            "2" => "уроци и обучения",
            "3" => ", достъпни на 29 езика, за да организирате дейности, при които младите хора се учат на програмиране и изчислително мислене.",
        ]
    ],
    "dance" => [
        "menu" => "Танцово предизвикателство",
        "subtitle" => "Кой казва, че програмистите не могат да танцуват? Ще докажем обратното с предизвикателството \"танц на седмицата на програмирането\" (#CodeWeekDance).",
        "content" => "Каним всички – училища, учители, библиотеки, клубове по програмиране, предприятия и публични органи – да отбележат седмицата на програмирането, като организират занимание във връзка с предизвикателството \"танц на седмицата на програмирането\" (#CodeWeekDance) и го добавят към картата на седмицата на програмирането."
    ],
    "treasure-hunt" => [
        "menu" => "Търсене на съкровище",
        "subtitle" => "Това е игра в Telegram",
    ],


    "videos" => [
        1 => "Гледайте посветените на нашите ценности видеоклипове на посланиците на Европейската седмица на програмирането",
        2 => "Гледайте Катя Ошляк, посланик за Словения — Защо Седмицата на програмирането е независима",
        3 => "Гледайте Лоран Туше, посланик за Франция — Защо Седмицата на програмирането е за всички",
        4 => "Гледайте Фатма Буазиз, посланик за Тунис — Защо седмицата на програмирането е глокална",
        5 => "Гледайте Линда Синка, посланик за Латвия — Защо сътрудничеството е важно за Седмицата на програмирането",
        6 => "Гледайте Алесандро Больоло, посланик за Италия — Защо Седмицата на програмирането е с нестопанска цел",
        7 => "Гледайте Маряна Прифти, посланик за Албания — Защо Седмицата на програмирането насърчава новаторството и творчеството",
        8 => "Гледайте Кристиана Лукачи, посланик за Румъния — Признателност към общността на Седмицата на програмирането",
    ]


];