<?php

return [

    'learning_bits' => 'Учебни модули на Седмицата на програмирането',
    'title' => 'Обмисляте да участвате в Европейската седмица на програмирането, но не знаете откъде да започнете?',
    'text' => '<p>Тук можете да намерите безплатни материали и ресурси за обучение, които ще ви помогнат да започнете и да планирате следващия си иновативен урок.</p>

                    <p>Не е необходим предишен опит в сферата на програмирането, а завършването на всеки модул отнема само около 15 минути. Модулите ви представят ключови концепции, свързани с дейности по програмиране и изчислително мислене. Освен това те ви дават практически съвети и идеи как да интегрирате концепциите в клас.</p>',
    'text_2' => '<p>Сега, след като завършихте един или няколко учебни модули на Седмицата на програмирането се надяваме да сте достатъчно уверени да внесете известна цифрова креативност в клас и да регистрирате събитие на <a href="/events">картата на Седмицата на програмирането</a>!</p>

                    <p>Лесно можете да организирате урок в клас, ден на отворените врати или събитие в училище. Просто изберете дата и регистрирайте вашето събитие на <a href="/events">картата на Седмицата на програмирането</a>. Всеки организатор на събитие ще получи сертификат за участие като награда за положените усилия.</p>

                    <p>Ако желаете да се свържете с международна група от учители ентусиасти, се присъединете към <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">групата за учители във Фейсбук на Европейската седмица на програмирането</a>! За да направите още една стъпка напред и да започнете сътрудничество с други училища във вашата страна или в чужбина — се присъединете към <a href="codeweek4all">предизвикателството на Code Week 4 All</a>.</p>',
    'lessons' => [
        '1' => [
            'title' => 'Програмиране без цифрова технология (на живо)',
            'author' => 'от Алесандро Болиоло',
            'text' => '<p>Програмирането е езикът на нещата, който ни позволява да пишем програми, с които да създаваме нови функции на десетките милиарди програмируеми предмети около нас. Програмирането е най-бързия начин да превърнем идеите си в реалност и най-ефективния начин да развием способности за изчислително мислене. Технологията обаче не е строго необходима за развиването на изчислително мислене. По-скоро нашите умения за изчислително мислене са особено важни, за да може технологиите да заработят.</p>

                    <p>В този видеоматериал, Алесандро Болиоло, преподавател по компютърни системи в Италия и координатор на Европейската седмица на програмирането, ще представи дейности за програмиране на живо, които могат да се практикуват без електронно устройство. Основната цел на дейностите на живо е да намалят пречките за достъп до програмирането във всяко едно училище, независимо от финансирането и оборудването.</p>

                    <p>Дейностите по програмиране на живо разкриват изчислителните аспекти на физическия свят около нас.</p>',
            'activities' => [
                '1' => 'Дейност 1 — CodyRoby за основен курс на обучение',
                '2' => 'Дейност 2 — CodyRoby за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — CodyRoby за среден курс на обучение'
            ]
        ],
        '2' => [
            'title' => 'Изчислително мислене и решаване на проблеми',
            'author' => 'от Майлс Бери',
            'text' => '<p>Изчислителното мислене (ИМ) описва начин за разглеждане на проблеми и системи, при който може да се използва компютър, за да ги решим или разберем. Изчислителното мислене не само е особено важно за разработването на компютърни програми, но може също така да се използва за подпомагане на решаването на проблеми във всички дисциплини.</p>

                    <p>Можете да преподавате ИМ на своите ученици, като ги насърчавате да разчленяват комплексни проблеми на по-малки, (разлагане), да разпознават модели (разпознаване на модели), да идентифицират съответните детайли за решаване на проблеми (абстракция); или да определяте правила или инструкции, които да се следват за постигането на желан резултат (дизайн на алгоритъм). ИМ може да се преподава по различни дисциплини, например по математика (определете правилата за факторинг на полиноми от 2-ра степен), литература (да разделят анализа на дадено стихотворение на анализ на метриката, римата и структурата), езици (намиране на модели в крайните букви на даден глагол, които засягат неговото изписване при промяна на граматическото време) и много други.</p>

                    <p>В този видеоматериал, Майлс Бери, главен лектор във Факултета по педагогика към Университета Роухемптън в Гилдфорд (Обединено кралство), ще представи концепцията за изчислително мислене и различните начини, по които един учител може да го интегрира в клас с лесни игри.</p>',
            'activities' => [
                '1' => 'Дейност 1 — Развиване на математическо аргументиране за основен курс на обучение',
                '2' => 'Дейност 2 — Запознаване с алгоритми за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Алгоритми за среден курс (горна степен) на обучение'
            ]
        ],
        '3' => [
            'title' => 'Визуално програмиране — Въведение в Scratch',
            'author' => 'от Марго Тинауи',
            'text' => '<p>Визуалното програмиране позволява на хората да описват процеси, като използват илюстрации или графики. Обикновено ние противопоставяме визуалното програмиране на програмирането, базирано на текст. Езиците за визуално програмиране (VPL) са особено добре адаптирани за представяне на алгоритмично мислене сред децата (и дори сред възрастните). С VPL има по-малко неща за четене и не се използва синтаксис.</p>

                    <p>В този видеоматериал, Марго Тинауи, учител по уеб разработване в Le Wagon и съосновател на Techies Lab asbl (Белгия), ще ви помогне да откриете Scratch, един от най-популярните VPL, използвани в целия свят. Scratch беше разработен от MIT през 2002 г., и оттогава насам около него се сформира голяма общност, където можете да откриете милиони проекти, които да копирате със своите ученици, и многобройни ръководства за обучение на няколко езика.</p>

                    <p>За да използвате Scratch, не е необходимо да имате опит в програмирането, и можете да го използвате с всички различни теми! Например можете да използвате Scratch като цифров разказвач на приказки, учениците могат да съчиняват приказки, да илюстрирате задача по математика или да проведете творчески конкурс, за да научите повече за културното наследство, докато усвоявате програмиране и изчислително мислене, и най-важното да се забавлявате.</p>

                    <p>Scratch е безплатен инструмент, много интуитивен и мотивиращ за вашите ученици. Гледайте видеото на Марго, за да разберете как да започнете:</p>
',
            'activities' => [
                '1' => 'Дейност 1 — Основи на Scratch за основен курс на обучение',
                '2' => 'Дейност 2 — Основи на Scratch за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Основи на Scratch за среден курс на обучение'
            ]
        ],
        '4' => [
            'title' => 'Създаване на образователни игри със Scratch',
            'author' => 'от Хесус Морено Леон',
            'text' => '<p>Критично мислене, упоритост, решаване на проблеми, изчислително мислене и креативност са само някои от ключовите умения, от които учениците ви се нуждаят, за да успеят в 21-ви век, а програмирането може да ви помогне да ги развиете по забавен и мотивиращ начин.</p>

                    <p>Алгоритмичните понятия за управление на потока на подаване на данни чрез използване на последователности от инструкции и цикли, или синхронизирането на процеси могат да звучат като сложни концепции, но в това видео ще видите, че се научават по-лесно, отколкото сте очаквали.</p>

                    <p>В този видеоматериал, Хесус Морено Леон, учител по компютърни науки и изследовател от Испания, ще обясни как можете да развиете тези и други умения в учениците си по забавен начин. Как може да стане това? Като създадете игра с въпроси и отговори в Scratch, най-популярния език за програмиране, използван в училищата в целия свят. Scratch не само подпомага изчислителното мислене, но също така позволява въвеждането на игрови елементи в клас, за да поддържа мотивацията на учениците ви, докато учат и се забавляват.</p>

                    <p>Гледайте видеото, за да разберете как да започнете:</p>',
            'activities' => [
                '1' => 'Дейност 1 — Игра с въпроси и отговори със Scratch за основен курс на обучение',
                '2' => 'Дейност 2 — Игра с въпроси и отговори със Scratch за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Игра с въпроси и отговори със Scratch за среден курс на обучение'
            ]
        ],
        '5' => [
            'title' => 'Занимания по роботика и ремонтни дейности в клас',
            'author' => 'от Тулиа Уршиц',
            'text' => '<p>Интегрирането в учебните програми на програмирането, ремонтните дейности, роботиката и микроелектрониката като инструменти за преподаване и учене е ключово за образованието през 21-ви век.</p>

                    <p>Заниманията по ремонтни дейности и роботика в училище носят много ползи за учениците, тъй като помагат за развиването на ключови компетенции, като решаване на проблеми, работа в екип и сътрудничество. Освен това те насърчават творческото мислене и увереността на учениците, и могат да помогнат на учениците да станат по-настоятелни и решителни, когато са изправени пред предизвикателства. Роботиката също така е област, която насърчава приобщаването, тъй като е лесно достъпна за широк набор от ученици с различни таланти и умения (както момчета, така и момичета) и повлиява положително на учениците от аутистичния спектър.</p>

                    <p>Изгледайте този видеоматериал, в който Тулиа Уршиц, посланик на Scientix Италия и учител, който използва методите на науката, технологиите, инженерството и математиката (STEM) в Сант\'Амбро̀джо ди Валполичѐла, Италия, ще даде практически примери за това как учителите могат да интегрират ремонтните дейности и роботиката при работа в клас и по този начин да превърнат пасивните ученици в ентусиазирани създатели.</p>
',
            'activities' => [
                '1' => 'Дейност 1 — Как да изработим механична ръка от талашит за основен курс на обучение',
                '2' => 'Дейност 2 — Как да изработим механична или роботизирана ръка за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Как да изработим механична или роботизирана ръка за среден курс (горна степен) на обучение'
            ]
        ]
    ],
    'download_video_script' => 'Изтеглете видео скрипта',
    'ready_to_share' => 'Готови ли сте да споделите какво сте научили с учениците си?',
    'choose_lessons' => 'Изберете един от плановете на уроци по-долу и организирайте дейност с учениците си.',
    'footer' => [
        'title' => 'Не забравяйте да добавите събитието си на картата на Седмицата на програмирането!',
        'text' => '<p>Лесно можете да организирате урок в клас, ден на отворените врати или събитие в училище. Просто изберете дата и регистрирайте вашето събитие на <a href="/events">картата на Седмицата на програмирането</a>. Всеки организатор на събитие ще получи сертификат за участие като награда за положените усилия.</p>

<p>Ако желаете да се свържете с международна група от учители ентусиасти, се присъединете към <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">групата за учители във Фейсбук на Европейската седмица на програмирането</a>! За да направите още една стъпка напред и да започнете сътрудничество с други училища във вашата страна или в чужбина — се присъединете към <a href="codeweek4all">предизвикателството на Code Week 4 All</a>.</p>'
    ]

];