<?php

return [

    'learning_bits' => 'Учебни модули на Седмицата на програмирането',
    'title' => 'Безплатни учебни материали и онлайн курсове',
    'text' => '<p>Тук можете да намерите безплатни материали и ресурси за обучение, които ще ви помогнат да започнете и да планирате следващия си иновативен урок.</p>
<h2 class="subtitle">1.	Учебни модули</h2>
                    <p>Не е необходим предишен опит в сферата на програмирането, а завършването на всеки модул отнема само около 15 минути. Модулите ви представят ключови концепции, свързани с дейности по програмиране и изчислително мислене. Освен това те ви дават практически съвети и идеи как да интегрирате концепциите в клас.</p>',
    'text_2' => '<p>Сега, след като завършихте един или няколко учебни модули на Седмицата на програмирането се надяваме да сте достатъчно уверени да внесете известна цифрова креативност в клас и да регистрирате събитие на <a href="/events">картата на Седмицата на програмирането</a>!</p>

                    <p>Лесно можете да организирате урок в клас, ден на отворените врати или събитие в училище. Просто изберете дата и регистрирайте вашето събитие на <a href="/events">картата на Седмицата на програмирането</a>. Всеки организатор на събитие ще получи сертификат за участие като награда за положените усилия.</p>

                    <p>Ако желаете да се свържете с международна група от учители ентусиасти, се присъединете към <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">групата за учители във Фейсбук на Европейската седмица на програмирането</a>! За да направите още една стъпка напред и да започнете сътрудничество с други училища във вашата страна или в чужбина — се присъединете към <a href="/codeweek4all">предизвикателството на Code Week 4 All</a>.</p>',
    'lessons' => [
        '1' => [
            'title' => 'Програмиране без цифрова технология (на живо)',
            'author' => 'от Алесандро Болиоло',
            'text' => '<p>Програмирането е езикът на нещата, който ни позволява да пишем програми, с които да създаваме нови функции на десетките милиарди програмируеми предмети около нас. Програмирането е най-бързия начин да превърнем идеите си в реалност и най-ефективния начин да развием способности за изчислително мислене. Технологията обаче не е строго необходима за развиването на изчислително мислене. По-скоро нашите умения за изчислително мислене са особено важни, за да може технологиите да заработят.</p>

                    <p>В този видеоматериал, Алесандро Болиоло, преподавател по компютърни системи в Италия и координатор на Европейската седмица на програмирането, ще представи дейности за програмиране на живо, които могат да се практикуват без електронно устройство. Основната цел на дейностите на живо е да намалят пречките за достъп до програмирането във всяко едно училище, независимо от финансирането и оборудването.</p>

                    <p>Дейностите по програмиране на живо разкриват изчислителните аспекти на физическия свят около нас.</p>',
            'activities' => [
                '1' => 'Дейност 1 — CodyRoby за основен курс на обучение',
                '2' => 'Дейност 2 — CodyRoby за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — CodyRoby за среден курс на обучение'
            ]
        ],
        '2' => [
            'title' => 'Изчислително мислене и решаване на проблеми',
            'author' => 'от Майлс Бери',
            'text' => '<p>Изчислителното мислене (ИМ) описва начин за разглеждане на проблеми и системи, при който може да се използва компютър, за да ги решим или разберем. Изчислителното мислене не само е особено важно за разработването на компютърни програми, но може също така да се използва за подпомагане на решаването на проблеми във всички дисциплини.</p>

                    <p>Можете да преподавате ИМ на своите ученици, като ги насърчавате да разчленяват комплексни проблеми на по-малки, (разлагане), да разпознават модели (разпознаване на модели), да идентифицират съответните детайли за решаване на проблеми (абстракция); или да определяте правила или инструкции, които да се следват за постигането на желан резултат (дизайн на алгоритъм). ИМ може да се преподава по различни дисциплини, например по математика (определете правилата за факторинг на полиноми от 2-ра степен), литература (да разделят анализа на дадено стихотворение на анализ на метриката, римата и структурата), езици (намиране на модели в крайните букви на даден глагол, които засягат неговото изписване при промяна на граматическото време) и много други.</p>

                    <p>В този видеоматериал, Майлс Бери, главен лектор във Факултета по педагогика към Университета Роухемптън в Гилдфорд (Обединено кралство), ще представи концепцията за изчислително мислене и различните начини, по които един учител може да го интегрира в клас с лесни игри.</p>',
            'activities' => [
                '1' => 'Дейност 1 — Развиване на математическо аргументиране за основен курс на обучение',
                '2' => 'Дейност 2 — Запознаване с алгоритми за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Алгоритми за среден курс (горна степен) на обучение'
            ]
        ],
        '3' => [
            'title' => 'Визуално програмиране — Въведение в Scratch',
            'author' => 'от Марго Тинауи',
            'text' => '<p>Визуалното програмиране позволява на хората да описват процеси, като използват илюстрации или графики. Обикновено ние противопоставяме визуалното програмиране на програмирането, базирано на текст. Езиците за визуално програмиране (VPL) са особено добре адаптирани за представяне на алгоритмично мислене сред децата (и дори сред възрастните). С VPL има по-малко неща за четене и не се използва синтаксис.</p>

                    <p>В този видеоматериал, Марго Тинауи, учител по уеб разработване в Le Wagon и съосновател на Techies Lab asbl (Белгия), ще ви помогне да откриете Scratch, един от най-популярните VPL, използвани в целия свят. Scratch беше разработен от MIT през 2002 г., и оттогава насам около него се сформира голяма общност, където можете да откриете милиони проекти, които да копирате със своите ученици, и многобройни ръководства за обучение на няколко езика.</p>

                    <p>За да използвате Scratch, не е необходимо да имате опит в програмирането, и можете да го използвате с всички различни теми! Например можете да използвате Scratch като цифров разказвач на приказки, учениците могат да съчиняват приказки, да илюстрирате задача по математика или да проведете творчески конкурс, за да научите повече за културното наследство, докато усвоявате програмиране и изчислително мислене, и най-важното да се забавлявате.</p>

                    <p>Scratch е безплатен инструмент, много интуитивен и мотивиращ за вашите ученици. Гледайте видеото на Марго, за да разберете как да започнете:</p>
',
            'activities' => [
                '1' => 'Дейност 1 — Основи на Scratch за основен курс на обучение',
                '2' => 'Дейност 2 — Основи на Scratch за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Основи на Scratch за среден курс на обучение'
            ]
        ],
        '4' => [
            'title' => 'Създаване на образователни игри със Scratch',
            'author' => 'от Хесус Морено Леон',
            'text' => '<p>Критично мислене, упоритост, решаване на проблеми, изчислително мислене и креативност са само някои от ключовите умения, от които учениците ви се нуждаят, за да успеят в 21-ви век, а програмирането може да ви помогне да ги развиете по забавен и мотивиращ начин.</p>

                    <p>Алгоритмичните понятия за управление на потока на подаване на данни чрез използване на последователности от инструкции и цикли, или синхронизирането на процеси могат да звучат като сложни концепции, но в това видео ще видите, че се научават по-лесно, отколкото сте очаквали.</p>

                    <p>В този видеоматериал, Хесус Морено Леон, учител по компютърни науки и изследовател от Испания, ще обясни как можете да развиете тези и други умения в учениците си по забавен начин. Как може да стане това? Като създадете игра с въпроси и отговори в Scratch, най-популярния език за програмиране, използван в училищата в целия свят. Scratch не само подпомага изчислителното мислене, но също така позволява въвеждането на игрови елементи в клас, за да поддържа мотивацията на учениците ви, докато учат и се забавляват.</p>

                    <p>Гледайте видеото, за да разберете как да започнете:</p>',
            'activities' => [
                '1' => 'Дейност 1 — Игра с въпроси и отговори със Scratch за основен курс на обучение',
                '2' => 'Дейност 2 — Игра с въпроси и отговори със Scratch за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Игра с въпроси и отговори със Scratch за среден курс на обучение'
            ]
        ],
        '5' => [
            'title' => 'Занимания по роботика и ремонтни дейности в клас',
            'author' => 'от Тулиа Уршиц',
            'text' => '<p>Интегрирането в учебните програми на програмирането, ремонтните дейности, роботиката и микроелектрониката като инструменти за преподаване и учене е ключово за образованието през 21-ви век.</p>

                    <p>Заниманията по ремонтни дейности и роботика в училище носят много ползи за учениците, тъй като помагат за развиването на ключови компетенции, като решаване на проблеми, работа в екип и сътрудничество. Освен това те насърчават творческото мислене и увереността на учениците, и могат да помогнат на учениците да станат по-настоятелни и решителни, когато са изправени пред предизвикателства. Роботиката също така е област, която насърчава приобщаването, тъй като е лесно достъпна за широк набор от ученици с различни таланти и умения (както момчета, така и момичета) и повлиява положително на учениците от аутистичния спектър.</p>

                    <p>Изгледайте този видеоматериал, в който Тулиа Уршиц, посланик на Scientix Италия и учител, който използва методите на науката, технологиите, инженерството и математиката (STEM) в Сант\'Амбро̀джо ди Валполичѐла, Италия, ще даде практически примери за това как учителите могат да интегрират ремонтните дейности и роботиката при работа в клас и по този начин да превърнат пасивните ученици в ентусиазирани създатели.</p>
',
            'activities' => [
                '1' => 'Дейност 1 — Как да изработим механична ръка от талашит за основен курс на обучение',
                '2' => 'Дейност 2 — Как да изработим механична или роботизирана ръка за среден курс (долна степен) на обучение',
                '3' => 'Дейност 3 — Как да изработим механична или роботизирана ръка за среден курс (горна степен) на обучение'
            ]
        ],
        '6' => [
            'title'=>'App Inventor и разработването на приложения',
            'author'=>'от Розана Кърър',
            'text'=>'<p>Вижте видеоклипа, в който Розана Кърър (основател на CyberWayFinder) обяснява какво представлява  App Inventor, описва предимствата от разработването на приложения в клас и дава нагледни примери как учителите могат да интегрират App Inventor в клас и да превърнат пасивните ученици в ентусиазирани изобретатели на игри.</p>
<p>Всички ние използваме приложения, защото те осигуряват удобен и бърз начин за координиране на нашите дейности. Освен това приложенията все по-често се използват в образованието, тъй като дават възможност за персонализирано учене и достъп до информация, така че защо да не дадете възможност на вашите ученици да разработят образователно приложение за другите?</p>',
            'activities'=>[
                '1'=>'Дейност 1 – Title, for Primary School',
                '2'=>'Дейност 2 – Title, for Lower Secondary School',
                '3'=>'Дейност 3 – Title, for Upper Secondary School'
            ]
        ],
        '7' => [
            'title'=>'Майсторене и създаване',
            'author'=>'от Диого да Силва',
            'text'=>'<p>Работата и работните места се променят и образованието върви по техните стъпки. Когато подготвяме учениците за кариера през 21-и век, новите умения като майсторене, създаване на неща и хакерство са от съществено значение, тъй като смаляват дистанцията между училището и реалността. Когато превърнем класната стая в среда за сътрудничество с акцент върху решаването на проблеми, учениците имат възможност да се ангажират с дейностите и да се развиват. Дейностите стимулират дискусиите и така класната стая се превръща в място за комуникация, където всеки принос е важен.</p> 
<p>Вижте видеоклипа по-долу, в който учителят по наука, технологии, инженерство и математика (НТИМ) от Португалия Диого да Силва, член на Escola Global, обяснява подробно как да разработите урок, в който вашите ученици да майсторят, създават и хакерстват, за да намерят решение.</p>',
            'activities'=>[
                '1'=>'Дейност 1 – Title, for Primary School',
                '2'=>'Дейност 2 – Title, for Lower Secondary School',
                '3'=>'Дейност 3 – Title, for Upper Secondary School'
            ]
        ],
        '8' => [
            'title'=>'Програмиране за всички предмети',
            'author'=>'От М. Изабел Бланко, М. Консепсион Фернандес, Елисабета Нани, Дебора Кармела Ниутта, Стефания Алтиери',
            'text'=>'<p>Когато мислим за програмиране в клас, първото нещо, което си представяме, са компютри, технологии, математика или наука. Въпреки това, като се има предвид, че учениците имат редица интереси и предмети, защо да не използваме програмирането за всички предмети в учебната програма?</p> 
<p>Въвеждането на програмирането в клас има много предимства, тъй като помага на учениците да развиват своето критично мислене и уменията си за решаване на проблеми, да се превърнат в активни потребители и да ръководят собствения си процес на обучение, което е от съществено значение в училищата. Най-важното обаче е, че учениците ви ще учат, докато се забавляват!</p>
<p>Езици, музика или наука, технологии, инженерство и математика (НТИМ) са само някои от предметите, за които учителите могат да използват програмирането, за да възпитат бъдещи учени, музиканти, художници и всеки друг! Всички учители могат да интегрират програмирането и изчислителното мислене в класната стая. Използването на ИУПЧЕ урок за обяснение на обикновен алгоритъм, създаването на джойстик от филц в час по наука или използването на роботи за повишаване на мотивацията по математика са примери за дейности, които можете да извършвате в класната стая.</p> 
<p>Вижте видеоматериала по-долу, за да научите как учителите по музика, наука или езици могат лесно да интегрират програмирането и изчислителното мислене в клас, дори ако нямат предишен опит.</p>',
            'activities'=>[
                '1'=>'Дейност 1 Роботика и приобщаване на ученици в началния курс в областта на науката, технологиите, инженерството и математиката',
                '2'=>'Дейност 2 Музиката е програмиране',
                '3'=>'Дейност 3 Майсторене и програмиране с помощта на Makey Makey',
                '4'=>'Дейност 4 Обикновен алгоритъм за ИУПЧЕ урок'
            ]
        ],
        '9' => [
            'title'=>'Изработване на автомат с micro:bit',
            'author'=>'от Полин Маас',
            'text'=>'<p>
                   Използването на Micro:bit, лесно програмируемият компютър с джобни размери, може да бъде забавен и лесен начин за изработване на интересни творения — от роботи до музикални инструменти — с вашите ученици, като в същото време ги учите как да създават програми. Той е прост и лесен за използване дори от най-малките програмисти, като в същото време е достатъчно мощен и за по-напредналите ученици. Можете да го използвате за различни уроци — от история до математика и дори научни дисциплини. Възможностите са безкрайни. Micro:bit е ангажиращ и евтин начин да научите учениците на програмиране, докато формирате основните умения, като изчислително мислене, решаване на проблеми и креативност.
                   </p>
                   <p>
В този видеоклип Полин Маас, учител по компютърни науки в Koninklijke Visio, ще представи Micro:bit и няколко практически примера за това как учителите могат да го интегрират в класната стая, превръщайки неактивните ученици в ентусиазирани творци.                   
                </p>',
            'activities'=>[
                '1'=>'Морзов код с micro:bit за ученици в основен курс на обучение',
                '2'=>'Стая на загадките с micro:bit за среден курс (долна степен) на обучение',
                '3'=>'Изработване на автомат за среден курс (горна степен) на обучение',
            ]
        ],
        '10' => [
            'title'=>'Креативно програмиране с Python',
            'author'=>'от Ивана Везджак',
            'text'=>'<p>
Преминаването от визуално към текстово-базирано програмиране е естествено в курса на обучение по програмиране. Макар че визуалното програмиране често е чудесно за начинаещите, след известно време учениците могат да потърсят ново предизвикателство. Текстово-базираното програмиране е следващата стъпка за всеки, който иска да напредне в програмирането и в изчислителното мислене. 
                   </p>
                   <p>                   
В този видеоклип Ивана Везджак ви въвежда в основния синтаксис на Python. Днес Python е един от най-популярните езици за програмиране, използван в много области като науката за данните, изкуствения интелект (AI), машинното обучение, уеб разработки и др. Макар че Python е мощен език за програмиране, използван от опитни програмисти, той може да се използва дори и от тези, които нямат никакъв опит в програмирането, поради неговата простота и ясен синтаксис. 
                  
</p>
<p> 
С Python учениците могат да създават викторини за исторически събития, да решават математически задачи и да правят физически симулации, да създават игри, уебсайтове и да извършват анализ на данни за научни проекти, както и много други. Python има богата и обширна стандартна библиотека, голяма общност и голям брой уроци и проекти, достъпни онлайн, които могат да се използват за обучение, учене и упражняване. Чрез програмирането с Python, анализирането на програми и отстраняването на програмни грешки, учениците развиват своята креативност и се научават как да бъдат последователни, упорити и търпеливи. Те усвояват умения за аналитично мислене и за решаване на задачи чрез разбиване на дадена сложна задача на по-малки подзадачи. Тези компетенции ще им помогнат за това как да подхождат към проблемите във всяка друга област от живота.
                </p>',
            'activities'=>[
                '1'=>'Моята първа викторина за основен курс на обучение',
                '2'=>'Бесеница (Hangman) за среден курс (долна степен) на обучение',
                '3'=>'Познай знамето! за среден курс (горна степен) на обучение',
            ],
            'links'=>[
                'title' => '',
                '1' => [
                    "url"=>"https://docs.python.org/3/library/",
                    "title"=>"Стандартна библиотека на Python",
                    "description"=>"Колекция от предварително изградени кодове и модули (напр. модул turtle, модул math и т.н.).",
                ],
                '2' => [
                    "url"=>"https://codecombat.com/",
                    "title"=>"CodeCombat",
                    "description"=>"Образователна видео игра за изучаване на концепциите за програмиране.",
                ],
                '3' => [
                    "url"=>"https://projects.raspberrypi.org/en/codeclub",
                    "title"=>"Проекти с CodeClub",
                    "description"=>"От начинаещи до напреднали, проекти по програмиране стъпка по стъпка за деца.",
                ],
                '4' => [
                    "url"=>"https://inventwithpython.com/invent4thed/",
                    "title"=>"Измислете ваши собствени компютърни игри с Python (Invent your own computer games with Python)",
                    "description"=>"Книга, която ще ви научи как да програмирате ваши собствени компютърни игри с Python.",
                ],
                '5' => [
                    "url"=>"https://www.codewars.com/",
                    "title"=>"CodeWars",
                    "description"=>"Образователна общност, където учениците и учителите могат да се обучават чрез редица предизвикателства.",
                ],
                '6' => [
                    "url"=>"https://hourofpython.com/",
                    "title"=>"•	Един час с Python (Hour of Python)",
                    "description"=>"Колекция уводни уроци в програмния език Python (както за текстово-базирано, така и за блоково програмиране), която използва интерактивната среда Trinkets.",
                ],
            ]
        ],
        '11' => [
            'title'=>'Програмиране за приобщаване',
            'author'=>'от екипа на Седмицата на програмирането',
            'text'=>'<p>
                   Въвеждането на програмирането в клас може да бъде предизвикателство, особено ако имате ученици с определени увреждания в класа си. Но е важно да запомните, че всеки, независимо от способностите си, може да се научи как да програмира. Децата със специални потребности могат да се възползват значително от изучаването на аспектите на програмирането, защото то учи учениците на важни житейски умения, като решаване на проблеми, организиране и независимост. Програмирането може също да подобри междуличностните умения и социалните умения чрез сътрудничество и работа в екип, умения, с които много деца с увреждания имат затруднения. Най-важното е, че учениците се забавляват, докато учат заедно с връстниците си.
                   </p><p>
В този видеоклип екипът на Седмицата на програмирането ще ви покаже някои практични, лесни и забавни дейности по програмиране, специално пригодени за ученици със зрителни увреждания, със синдром на Даун и за ученици от аутистичния спектър, които учителите лесно могат да въведат в клас.                   
                </p>',
            'activities'=>[
                '1'=>'Кора за яйца ънплъгд (Egg carton Unplugged)',
                '2'=>'Много интелигентна мишка (A very smart mouse) ',
                '3'=>'Дейност 3 — Звезда създава звезди (A star making stars) ',
            ]
        ],
        "12" => [
            "title" => "Програмиране за целите за устойчиво развитие",
            "author" => "от Франсиско Хавиер Масеро, Кристина Николаита и Ервиола Кономи",
            "text" => [
                "1" => "Традиционното образование предоставя на учениците малко възможности да разбират и решават реални проблеми в света, като например свързаните с глобалните климатични промени, равенството между половете, глада, бедността или доброто здраве и благополучие.",
                "2" => "Целите за устойчиво развитие (ЦУР) са в основата на Програмата за устойчиво развитие до 2030 г., приета от всички държави-членки на ООН като пътна карта за постигане на мир и просперитет на планетата с насърчаване на глобалното развитие. Учителите могат да използват ЦУР в класната стая като инструмент за развиване на критичното мислене на учениците, а също така и като помагало за откриване на тяхната идентичност и цел. Комбинирането на основни елементи на програмирането и изчислителното мислене с ЦУР ще повиши увереността на вашите ученици и ще им помогне да развият своя творчески, предприемачески дух и уменията си за комуникация и решаване на проблеми.",
                "3" => "В дейностите по-долу студентите ще прилагат принципите Scratch, програмиране с ASCII и програмиране без компютър към теми от глобално и социално значение в наши дни. Учителите ще повишават осведомеността за целите на устойчивото развитие, като същевременно помагат на учениците да развият емпатия, активна гражданска позиция и про-социални умения по забавен и ангажиращ начин.",
                "4" => "Всеки от тези учебни планове се съсредоточава върху конкретна ЦУР:",
                "5" => "Цел за устойчиво развитие 3: Осигуряване на здравословен живот и насърчаване на благосъстоянието на всички и във всички възрасти",
                "6" => "Цел за устойчиво развитие 5: Постигане на равенство между половете и осигуряване на възможности на всички жени и момичета",
                "7" => "Цел за устойчиво развитие 13: Предприемане на спешни действия за борба с климатичните промени и тяхното въздействие",
            ],
            "activities" => [
                "1" => "Проект „Каратека“: Опознаване на карате чрез програмиране за начално и средно образователни училища",
                "2" => "Цели за устойчиво развитие и програмиране за климатичните промени за началното училище",
                "3" => "Програмиране за равенство между половете за средно образователни училища",
            ]
        ],
        "13" => [
            "title" => "Въведение в изкуствения интелект в класната стая",
            "author" =>"от Артур Коелю и Маряна Прифти Скендули",
            "text" => [
        "1" => "Изкуственият интелект (AI) има въздействие върху много области от ежедневието: той автоматично коригира текста, който въвеждате на телефона, избира музиката, която любимото ви музикално приложение пуска, и помни вашите пароли, когато ги забравите. AI се отнася до комбинация от машинно самообучение, роботика и алгоритми с приложения във всички области: от компютърните науки до производството и от медицината до модата. Именно затова той има неоспоримо място в живота и в нашите общества и играе ключова роля в развитието на науката. Като с всички други важни явления в живота ни, учениците ще имат полза, ако учат повече за него. Но как се преподава за такова сложно нещо като AI?",
        "2" => "Тази учебна част ще ви помогне да обясните на учениците какво е AI и каква роля играе в техния живот. Тези занимания са предназначени за неспециалисти, за да разберат лесно съдържанието и да могат ефективно да раздробят сложните термини на лесно разбираеми идеи. С тези планове за уроци можете да помогнете на учениците да научат приложенията на AI и някои от механизмите, които стоят зад него. Заниманията са предназначени да помагат на учениците да развият своите умения за аналитично и критично мислене: например, в дейността на Маряна студентите разработват процес за класифициране. Тези занимания също така ще помогнат на учениците да разберат разнообразните приложения на AI: в заниманието на Артур ще научат за връзката между AI и изкуството и как AI може да се използва за обогатяване на визуалното изразяване. С тези занимания учениците също така ще помислят за опасностите от AI и тяхното въздействие."
    ],
    "activities" => [
        "1" => "Човек-AI-изкуство, за основно училище",
        "2" => "Обучаване на машините да класифицират: Въведение в контролираното машинно самообучение за първата част на средното образование",
        "3" => "Обучаване на машините да класифицират: Въведение в контролираното машинно обучение за втората част на средното образование",
    ]
],

        '14' => [
            'title' => 'Учене в ерата на интелигентните машини',
            'author' => 'от Адил Тугиан, Георгия Ласкарис и Марко Невес',
            'text' => [
                '1' => 'Напредъкът на ИИ през последните години е впечатляващ, благодарение на бързия напредък в изчислителните мощности и наличието на големи количества данни. Това доведе до значителни инвестиции в изследвания на ИИ и бързо разширяване на индустрията, свързана с ИИ, което превръща ИИ в голямата технологична революция на нашето време. ИИ е навсякъде около нас. Той се превърна в част от нашето ежедневие, до степен, че понякога не мислим за него като за ИИ: използваме онлайн препоръки, разпознаване на лица, системи за сигурност и гласови асистенти почти всеки ден. Но какво става с образованието? ',
                '2' => 'ИИ има огромен потенциал да даде възможност за нови начини на преподаване и учене и да подобри обучението на учениците. Този урок ще ви помогне да включите реални дейности, свързани с ИИ, във вашето преподаване и ще ви помогне да подготвите учениците си за живот и кариера в един свят, оформен от ИИ. Тези дейности са предназначени за учениците, за да развият те своето любопитство, умения за решаване на проблеми и творчество: например в занятието на Адил учениците научават за алгоритмите и невронните мрежи и се насърчават да създадат своя собствена невронна мрежа, за да визуализират „мозъка“ на ИИ. Георгия ще насочва учениците ви стъпка по стъпка за разработване на чатбот. Учениците ще конфигурират свой собствен чатбот, ще подготвят набори от въпроси и отговори и ще го обучат да може да отговаря на въпроси за Covid-19. В дейността на Марко учениците ще проучат ползите и предизвикателствата на интелигентните машини в ежедневието и в работна среда. Какви са рисковете при ИИ, които трябва да разгледаме? Какви въздействия ще има ИИ върху бъдещето на работната заетост? Какви работни места ще им бъдат предложени, когато след време излязат на пазара на труда?'
            ],
            'activities' => [
                'title' => 'В учебните планове по-долу учениците ще научат повече за интелигентните машини по забавен и увлекателен начин.',
                '1' => 'ИИ и неговите невронни мрежи, за начално училище',
                '2' => 'Моят чатбот за Covid-19 – за ученици на възраст около 11-14 г.',
                '3' => 'Живот в ерата на „Интелигентните машини“: Предизвикателства и възможности за ученици на възраст около 14-16 години',
            ]
        ],

        "15" => [
            "title" => "Разработване на медийна грамотност",
            "author" => "от Марияна Смолчец, Теа Хорватич и Саня Божинович",
            "text" => [
                " Образованието по медийна грамотност никога не е било по-важно за днешните ученици. Учениците от всички възрасти трябва да придобият съответните умения, знания и нагласи, за да могат да се ориентират в нашия богат на медии свят. Уменията за медийна грамотност ще им помогнат да използват достоверно онлайн съдържание и да разпознават подвеждащите източници на информация. Те ще разберат как да проверяват фактите в информацията, която намират онлайн, и да я интерпретират критично. Те ще повишат осведомеността си за правилното използване на обекти на творчество и ще прилагат наученото при създаването на собствено творческо съдържание.",
                "Този учебен материал ще ви даде възможност да приложите различни стратегии и техники, за да дадете възможност на учениците си да придобият медийна грамотност. В заниманието на Марияна учениците се учат как да използват уеб съдържание безопасно и отговорно. Те се запознават с различните видове лицензи и разработват просто приложение, за да демонстрират как правилно да споделят творческа работа. В дейността на Tea учениците се впускат в търсене на информация за кликбейта. Чрез увлекателни задачи учениците проучват стратегии за идентифициране и разкриване на кликбейтове и научават как да ги избягват. Саня позволява на учениците да изследват и критично да анализират и оценяват уеб съдържание, неговата уместност, точност, произход и цел. Те научават как да намират надеждни източници онлайн и как да разпознават невярна онлайн информация.",
                " В плановете за уроци по-долу ще намерите вдъхновяващи и ангажиращи дейности за подобряване на медийната грамотност на учениците:",
            ],
            "activities" => [
                "1" => "Безплатно ли е, ако е в интернет?",
                "2" => "Да кликнеш или не",
                "3" => "Проверка на фактите",
            ]
        ],

    ],
    'download_video_script' => 'Изтеглете видео скрипта',
    'ready_to_share' => 'Готови ли сте да споделите какво сте научили с учениците си?',
    'choose_lessons' => 'Изберете един от плановете на уроци по-долу и организирайте дейност с учениците си.',
    'footer' => [
        'title' => 'Не забравяйте да добавите събитието си на картата на Седмицата на програмирането!',
        'text' => '<p>Лесно можете да организирате урок в клас, ден на отворените врати или събитие в училище. Просто изберете дата и регистрирайте вашето събитие на <a href="/events">картата на Седмицата на програмирането</a>. Всеки организатор на събитие ще получи сертификат за участие като награда за положените усилия.</p>

<p>Ако желаете да се свържете с международна група от учители ентусиасти, се присъединете към <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">групата за учители във Фейсбук на Европейската седмица на програмирането</a>! За да направите още една стъпка напред и да започнете сътрудничество с други училища във вашата страна или в чужбина — се присъединете към <a href="/codeweek4all">предизвикателството на Code Week 4 All</a>.</p>'
    ]

];
