<?php


return [
    'title' => 'Декларация на ценностите на Европейската седмица на програмирането',
    'description' => [
        1 =>
            [
                1 => 'Европейската седмица на програмирането инициатива, задвижвана от доброволци –',
                2 => 'посланици',
                3 => 'водещи преподаватели и ентусиасти на тема „програмиране“ от цял свят. Тя се подкрепя от',
                4 => 'Европейската комисия',
                5 => 'и министерства на образованието в Европейския съюз и страните от Западните Балкани.',
            ],

        2 => 'В ядрото на Европейската седмица на програмирането е общността от организатори на дейности на доброволни начала, които са преподаватели, ментори, клубове за програмиране, библиотеки, частни фирми, родители и неправителствени организации. Ние посвещаваме своите време, енергия и усилия, за да направим изчислителното мислене, програмирането, роботиката, заиграването с хардуер, компютърните науки и цифровите умения широко достъпни за колкото се може повече хора в Европа и по света.',
        3 => 'Европейската седмица на програмирането също така се представлява от своите милиони участници, които са хора на всякаква възраст, с всякакъв произход, култура и умения от цял свят.',
        4 => 'Гордеем се, че ние сме Европейската седмица на програмирането. Това са нашите ценности. Те винаги ръководят нашата работа и решения.',
    ],
    '1' => [
        'title' => 'Европейската седмица на програмирането е независима',
        'content' => 'Европейската седмица на програмирането е общност, задвижвана от доброволци. Ние не действаме от икономически интереси. Ние уважаваме и ценим идеите, убежденията и културите на другите хора. Ние участваме в Европейската седмица на програмирането, защото вярваме във важността на това, което правим. Именно това е нашата сила. Ние искаме да направим изчислителното мислене, програмирането, компютърните науки, роботиката, заиграването с хардуер и цифровите умения широко достъпни за всички.',
    ],
    '2' => [
        'title' => 'Европейската седмица на програмирането е за всички',
        'content' => 'Всеки може да организира дейности за Европейската седмица на програмирането. Разбираме, че е от съществено значение проявите в рамките на Европейската седмица на програмирането да бъдат организирани за всички, независимо от тяхната възраст, цвят, пол, културен произход или интелектуални способности. Дейностите могат да послужат като входна точка, която да стимулира интереса и любознателността, или пък да помогнат за по-нататъшното развитие на умения.  Нашите принципи са равенството, уважението, свободата и приобщаването. Искаме всички участници да се докоснат до технологиите и да ги използват за творчество по един забавен начин.',
    ],
    '3' => [
        'title' => 'Европейската седмица на програмирането е и глобална, и локална',
        'content' =>
            [
                1 => 'Европейската седмица на програмирането има амбицията да достигне до вас, без значение дали живеете в голям град, регионален център или отдалечено село. Ние отделяме особено внимание на подкрепата за местни организатори с',
                2 => 'материали',
                3 => 'на техния език, отговарящи на техните нужди.',
                4 => 'Картата на Европейската седмица на програмирането',
                5 => 'е ключовият инструмент, в който се регистрират всяка дейност и нейното точно местоположение. Същевременно Европейската седмица на програмирането е глобална и приветства хора от цял свят в своята общност. Ние сме „глокални“.',
            ]
    ],
    '4' => [
        'title' => 'Европейската седмица на програмирането насърчава съдействието',
        'content' => [
            1 => 'Членовете на общността на Европейската седмица на програмирането си взаимодействат, обменят информация, учат се едни от други и съвместно градят знанията си. Ние сме свързани и се подкрепяме едни други. Споделяме ресурси, идеи и добри практики. Насърчаваме партньорствата и споделянето на знания.',
            2 => ' Предизвикателството „Европейска седмица на програмирането за всички“',
            3 => 'цели да изгражда мостове през граници и между различни общности. То подпомага разпространението на положителна енергия и свързва хората, които могат да се учат едни от други.'
        ]
    ],
    '5' => [
        'title' => 'Европейската седмица на програмирането не търси печалба',
        'content' =>
            [
                1 => 'Всички дейности от Седмицата на програмирането са с нестопанска цел. Всички',
                2 => 'ресурси',
                3 => 'на уебсайта на Европейската седмица на програмирането са безплатни. Всички обучителни и онлайн курсове в рамките на Европейската седмица на програмирането са безплатни.'
            ]
    ],
    '6' => [
        'title' => 'Европейската седмица на програмирането насърчава креативността и иновациите',
        'content' => 'Европейската седмица на програмирането насърчава креативността, иновациите и далновидното мислене. Ние сме отворени към и благодарни за всяка обратна връзка и критика, за да можем да взимаме осведомени решения и да развиваме Европейската седмица на програмирането. Дори неуспехите ни помагат да растем – и като личности, и като общност.'
    ],
    '7' => [
        'title' => 'Европейската седмица на програмирането е благодарна на своята общност',
        'content' => 'Благодарни сме за подкрепата на преподаватели, треньори и други организатори на дейности, на учащи, родители, клубове за програмиране и на всички партньори, с които работим. Всички ние споделяме обща цел. Искаме да направим изчислителното мислене, програмирането, компютърните науки и цифровите умения широко достъпни за колкото се може по-голям брой хора.'
    ],

];
