<?php

return [   
    'webinars-text' => 'Открийте набор от безплатни уебинари, за да подобрите уменията и знанията си за кодиране. Настройте се и се учете от експерти със собствено темпо!',
    'webinars-sub-text1' => 'Организирана от екипа на Европейската седмица на програмирането, тази поредица от уебинари има за цел да подпомогне организирането на събития и дейности. Тази поредица обединява експерти, преподаватели и ентусиасти, за да изследват завладяващата пресечна точка на кодирането и дигиталното творчество.',
    'webinars-sub-text2' => "Независимо дали сте учител, който иска да обогати учебната си програма, ученик, който иска да разшири уменията си, или ентусиаст по програмиране, който се интересува от най-новите образователни тенденции, тази поредица има по нещо за всеки.",
    'recordings-youtube-list-title' => "Всички записи са налице и като плейлисти в YouTube:",
    '2024-webinar-series-title'=>"Поредица от уебинари за 2024 г.:",
    '2025-webinar-series-title'=>"Поредица от уебинари за 2025 г.:",
];