<?php

return [
    /*'when-title' => 'Во 2024 година ќе се одржи Европската недела на кодирање помеѓу 14 и 27 октомври.',
    'when-text' => '<p>Европската недела на кодирање е движење на пошироко членство што ја слави креативноста, решавањето проблеми и соработката преку програмирање и други технички активности. Идејата е да се направи програмирањето повидливо, да им се покаже на младите, возрасните и постарите како да ги оживеат идеите со кодирање, да се демистифицираат овие вештини и да се доведат мотивирани луѓе заедно да учат.</p>',
    'codeweek_in_numbers-title' => 'Недела на кодирање во бројки',
    'codeweek_in_numbers-text' => '<p>Во 2021 година, <a href="https://blog.codeweek.eu/4-million-people-created-code-with-the-help-of-eu-code-week-in-2021/">4 милиони луѓе</a> во повеќе од 80 земји низ светот учествуваа во Европската недела на кодирање.</p>
                    <p>Просечната возраст на учесниците беше 11 години, а 49% од учесниците во 2021 година беа жени или девојки. 88% од настаните на Европската недела на кодирањето се одвиваа во училишта, што покажува дека напорите за оспособување наставници за време на кампањата во 2021 година беа успешни.</p>
                    <p>Секој може да организира или да се придружи во некоја активност. Едноставно изберете тема и целна публика  <a href="/add">и додајте ја вашата активност</a> на <a href="/events">мапата</a>.</p>',
    'run_by_volunteers-title' => 'Управувана од волонтери',
    'run_by_volunteers-text' => '<p>Европската недела на кодирање е управувана од волонтери. Еден или повеќе, <a href="/ambassadors">Амбасадори на неделата на кодирање</a> ја координираат иницијативата во нивните земји, но секој може да организира своја сопствена активност и да ја додаде на мапата на <a href="/">codeweek.eu</a>.</p>',
    'supported_by_commission-title' => 'Поддржано од Европската комисија',
    'supported_by_commission-text' => '<p>Европската недела на кодирање стартуваше во 2013 година од Младите советници за Дигитална агенда за Европа. Европската комисија ја поддржува Европската недела на кодирање, како дел од стратегијата за <a href="http://ec.europa.eu/priorities/digital-single-market/">Дигитален единствен пазар</a>. Во <a href="https://education.ec.europa.eu/focus-topics/digital-education/action-plan">Акциониот план за дигитално образование</a> Комисијата особено ги охрабрува училиштата да се придружат на иницијативата..</p>',
    'schools-title' => 'Училишта',
    'schools-text' => '<p>Училишта од секое ниво и наставници по сите предмети се особено поканети да учествуваат во Европската недела на кодирање, да им дадат можност на своите ученици да ја истражуваат дигиталната креативност и кодирањето. Научете повеќе за иницијативата и како да ја организирате вашата активност преку веб-локацијата наменета за наставници: <a href="/schools">CodeWeek.eu/Schools</a></p>',
    'why_coding-title' => 'Зошто кодирање?',
    'why_coding-text' => '<p>Поради Пиа, која чувствуваше дека мора да студира право иако секогаш уживаше во математика и во играње со компјутери. Поради Марк, кој имаше идеја за подобра социјална мрежа, но сам не можеше да ја направи. Поради Алис, која сонуваше за правење роботи, бидејќи нејзините родители не ѝ дозволуваа да има мачка.</p>

                    <p>Поради сите вас што веќе помагате да се исполнат тие соништа.</p>

                    <p>Всушност, тоа е за сите нас. Нашата иднина. Технологијата ни го обликува животот, но ние дозволуваме малцинството да реши како и за што ќе ја користиме. Можеме да направиме повеќе отколку само споделување и да ни се допаѓаат нештата. Можеме да ги оживееме нашите луди идеи, да направиме нешта што ќе им носат радост на другите.</p>

                    <p>Никогаш не било полесно да направите сопствена апликација, да направите сопствен робот или да измислите летачки автомобили, зошто да не! Не е лесно патување, но е патување полно со креативни предизвици, заедница што дава поддршка и многу забава. Подготвени сте да го прифатите предизвикот и да станете творец?</p>

                    <p>Кодирањето исто така помага да се развијат способности како што е компјутерско мислење, решавање проблеми, креативност и тимска работа - навистина добри вештини за сите патеки во животот.</p>',*/
    'why_coding-quote' => '<p>Алесандро Бољоло, координатор на тим од амбасадори волонтери на Европската недела на кодирање вели:<blockquote>
                            <p>„Од почетокот на постоењето направивме многу нешта користејќи камен, железо, хартија и молив кои ни го трансформираа животот. Сега ние живееме во различна ера каде што светот е обликуван во код. Различните ери имаат различни барања за работни места и вештини. Во текот на Неделата на кодирање сакаме да му ја дадеме на секој Европеец шансата да го открие кодирањето и да се забавува со него. Ајде да учиме кодирање за да ја обликуваме нашата иднина\'.</p>
                        </blockquote>
                    </p>',
    /*'join_codeweek-title' => 'Придружете се на Европската недела на кодирање',
    'join_codeweek-text' => '<p>Придружете се на Европската недела на кодирање со <a href="/guide">организирање активност на кодирање</a> во вашиот град, придружувајќи се на <a href="/codeweek4all">Предизвикот Code Week 4 All</a> и на активности на поврзување преку заедници и граници или така што ќе ни помогнете да ја рашириме визијата за неделата на кодирање како <a href="/ambassadors">Амбасадор на европската недела на кодирање</a> за вашата земја!</p>',
    'partners_and_sponsors' => 'Партнери и спонзори',*/
];
