<?php

   /*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [

    'languages' => [
        'en' => 'Англиски',
        'fr' => 'Француски',
        'bg' => 'Бугарски',
        'mt' => 'Малтешки',
        'hr' => 'Хрватски',
        'de' => 'Германски',
        'pl' => 'Полски',
        'cs' => 'Чешки',
        'el' => 'Грчки',
        'pt' => 'Португалски',
        'da' => 'Дански',
        'hu' => 'Унгарски',
        'ro' => 'Романски',
        'nl' => 'Холандски',
        'ga' => 'Ирски',
        'sk' => 'Словачки',
        'it' => 'Италијански',
        'sl' => 'Словенечки',
        'et' => 'Естонски',
        'lv' => 'Латвиски',
        'es' => 'Шпански',
        'fi' => 'Фински',
        'lt' => 'Литвански',
        'sv' => 'Шведски',
        'al' => 'Албански',
        'ba' => 'Босански',
        'mk' => 'Македонски',
        'cnr'=> 'Црногорски',
        'sr' => 'Српски',
        'mt' => 'Малтешки',
        'tr' => 'Турски'
    ],

    'resources_local_title'=>'Ресурси за кодирање од',
    'are_you_a_teacher' => 'Наставник сте?',
    'get_involved_banner' => 'Кликнете овде за да дознаете како да се вклучите!',
    'days'=>'Денови',
    'hours'=>'Часови',
    'minutes'=>'Минути',
    'seconds'=>'Секунди'

];
