<?php

/*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [
    'languages' => [
        'en' => 'Англиски',
        'fr' => 'Француски',
        'bg' => 'Бугарски',
        'mt' => 'Малтешки',
        'hr' => 'Хрватски',
        'de' => 'Германски',
        'pl' => 'Полски',
        'cs' => 'Чешки',
        'el' => 'Грчки',
        'pt' => 'Португалски',
        'da' => 'Дански',
        'hu' => 'Унгарски',
        'ro' => 'Романски',
        'nl' => 'Холандски',
        'ga' => 'Ирски',
        'sk' => 'Словачки',
        'it' => 'Италијански',
        'sl' => 'Словенечки',
        'et' => 'Естонски',
        'lv' => 'Латвиски',
        'es' => 'Шпански',
        'fi' => 'Фински',
        'lt' => 'Литвански',
        'se' => 'Шведски',
        'sv' => 'Шведски',
        'al' => 'Албански',
        'ba' => 'Босански',
        'mk' => 'Македонски',
        'cnr' => 'Црногорски',
        'sr' => 'Српски',
        'tr' => 'Турски',
    ],

    'resources_local_title' => 'Ресурси за кодирање од',
    'days' => 'Денови',
    'hours' => 'Часови',
    'minutes' => 'Минути',
    'seconds' => 'Секунди',
    'still_have_question' => 'Сѐ уште имате прашања?',
    'drop_us_a_line' => 'Пишете ни!',
    'get_in_touch' => 'СТАПЕТЕ ВО КОНТАКТ',
    'footer_msg' => 'Движење на пошироко членство управувано од волонтери и поддржано од Европската комисија',
    'email' => 'Е-пошта',
    'display_email' => 'Прикажи е-пошта',
    'first_name' => 'Име',
    'last_name' => 'Презиме',
    'your_website' => 'Ваша веб-локација',
    'biography' => 'Биографија',
    'update' => 'Ажурирај',
    'delete' => 'Избриши',
    'choose a file' => 'Избери датотека',
    'learning_bits' => 'Делови за учење',
    'codeweek' => 'Недела на кодирање',
    'bring_codeweek_to_your_students' => 'Донеси ја неделата на кодирање кај твоите ученици',
    'or' => 'или',
    'newsletter' => 'Билтен',
];
