<?php

return [
    'chatbot' => [
        'title' => 'Создајте робот за разговор',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Кодирајте интерактивни загатки',
            'Користете кодови за да создадете дијалог помеѓу робот за разговор и корисник'
        ],
        'description' =>
            'Искодирајте разговор помеѓу робот за разговор и корисник којшто се обидува да одгатне некоја загатка. Обидете се да создадете робот за разговор којшто може да разговара како личност. Наместо загатка, може да создадете дијалог помеѓу роботот за разговор и корисникот.',
        'instructions' => [
            'Смислете загатка',
            'Најавете се на',
            'или создајте нова сметка. (При создавање нова сметка, имајте предвид дека на Pencil Code не е дозволено користење на вистински имиња поради приватност.)',
            'Кликнете на Imagine (Замислете) и Make your own (Создајте свое)',
            'Користете режим со блокови или текст за да ја напишете загатката',
            'Или може да го искористите',
            'овој код',
            'и да го приспособите на загатката или пак да изберете Answering a riddle (Одговарање на некоја загатка) од менито и да го уредите'
        ],
        'example' => 'Разгледајте го овој пример за загатка.',
        'more' => [
            'Кодов е приспособен од активност на Pencil Code',
            'Answering the Riddle'
        ]
    ],

    'paper-circuit' => [
        'title' => 'Кодирајте без струја: Создајте хартиено коло',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => ['Продлабочување на креативноста', 'Развивање вештини за решавање проблеми'],
        'description' => [
            'Нацртајте што сакате. Може да биде небо со ѕвезди, бубамара, робот, новогодишна елка или што и да замислите. Слободно персонализирајте си го проектот со визуелните помагала на Европската недела на кодирање: може да го истражите',
            'комплетот алатки на Европската недела на кодирање',
            'и да ги преземете сите логоа или визуелни помагала што ги сакате. Може да создадете дури и покана со хартиеното коло за Европската недела на кодирање. Додајте мотивациска порака на колото за да ги поттикнете и другите наставници да се приклучат на Неделата на кодирање и/или да ја разгледаат веб-страницата за училишта.'
        ],
        'instructions' => [
            'Нацртајте нешто и одлучете кои делови сакате да светат (на пр., ѕвездите).',
            'Направете дупче во хартијата со молив и вметнете лепенка со LED светло во секој осветлен дел.  ',
            'Нацртајте круг каде што ќе ја поставите батеријата во форма на копче.',
            'Нацртајте линија со + и - на другата страна на листот. Погрижете се подолгата страна на лепенката со колото од LED светла да биде поврзана со страната на батеријата означена со „+“, а пократката со страната на батеријата означена со „-“.',
            'Поставете ја бакарната лента на линиите.',
            'Превиткајте ја хартијата така што LED светлата ќе се вклучат штом хартијата ќе ја покрие батеријата. Може да користите спојница за да бидете сигурни дека ќе има добар контакт со бакарната лента.',
            'Направете слика од хартиеното коло и споделете ја на Instagram, објаснувајќи зошто сметате дека вреди да се учествува во оваа иницијатива.  '
        ],
        'example' => 'Видете некои примери за хартиени кола',
        'materials' => [
            'хартија или картон',
            'боички или маркер',
            'батерија во форма на копче',
            'бакарна лента',
            'лепенки со LED коло',
            'спојница'
        ]
    ],

    'dance' => [
        'title' => 'Создајте танц',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Учење основни концепти на кодирање',
            'Учење како се анимираат ликови'
        ],
        'description' =>
            'Во овој предизвик, ќе создадете група ликови коишто ќе танцуваат заедно. Ќе користите вградена библиотека на медиуми за да ги изберете ликовите и музичките клипови или може да создадете свои. Ќе ги анимирате ликовите да танцуваат и да разговараат едни со други.',
        'instructions' => [
            'Најавете се на',
            'како наставник. Создајте сметки за учениците и споделете ги со нив. Или може да споделите код за одделението, а вашите ученици да се регистрираат со нивната школска адреса на е-пошта. Ако сте ученик, може да се приклучите како ученик, но ќе ви биде побарано да ја наведете адресата на е-пошта на некој од родителите за да може да ја одобрат вашата сметка',
            'Кликнете на',
            'и напишете наслов',
            'Одете на',
            'за да додадете заднина со кликнување на иконата со запченик. Изберете заднина од Media Library (Библиотеката со медиуми), поставете слика од вас или направете нова и поставете ја. Изберете аудиоклип и додајте го на сцената (stage):',
            'Кликнете на копчето',
            'за да додадете ликови или предмети што ќе ги анимирате така што ќе можат да мрдаат, да разговараат и да влегуваат во интеракција едни со други. Додајте два или три лика по ваш избор. Може сами да си ги нацртате актерите или да ги измените постоечките. Додајте различни костуми на ликовите со кликнување на иконата со молив.',
            'Кликнувајте на секој актер и анимирајте го додавајќи ги следните блокови',
            'Додајте',
            'блок за зборување (say block)',
            'и направете актерите да разговараат меѓу себе. Менувајте ја формата на балончињата за разговор, како и фонтот и големината на текстот'
        ],
        'example' => [
            'Ѕирнете го',
            'овој пример',
            'за роботи што танцуваат. Слободно искористете го и изменете го.'
        ]
    ],

    'compose-song' => [
        'title' => 'Создајте музичка композиција',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Да се научи кодирање преку музика',
            'Да се прави разлика помеѓу музичките жанрови и инструменти',
            'Да се компонира песна со мешавина од звучни клипови'
        ],
        'description' =>
            'Во овој предизвик ќе создадете музичка композиција користејќи програмски јазик. Може да користите некои од вградените звучни клипови или да снимите свој и да ги смешате за да создадете музичка композиција. Пуштете го кодот во Работната станица за дигитален звук (Digital Audio Workstation) и слушнете ја музиката што ја искодиравте. Играјте си со различните звуци и ефекти за да ја менувате музиката.',
        'instructions' => [
            'Најавете се на',
            'Кликнете тука за да направите скрипта',
            'Именувајте ја скриптата и изберете',
            'како програмски јазик',
            'Започнете да го пишувате кодот помеѓу редовите',
            'и',
            '',
            'Прелистајте ги музичките клипови во',
            'Библиотеката со звуци (Sound Library)',
            'и изберете ги музичките жанрови, изведувачи и инструменти што ви се допаѓаат',
            'За да додадете звучен клип на песната, напишете',
            'Помеѓу заградите треба да ги има следните 4 параметри, одделени со запирки',
            'Sound clip (Звучен клип)',
            'Ставете го покажувачот помеѓу заградите, одете во Библиотеката со звуци, изберете клип и залепете го кликнувајќи на сината икона за лепење',
            'Број на запис',
            'записите ви помагаат да си ги организирате звуците според видот на инструмент (вокал, бас, тапани, клавијатура итн.). Додајте колку што сакате записи (инструменти). Записите се прикажуваат како редови низ Работната станица за дигитален звук (Digital Audio Workstation)',
            'Start measure (Почетен такт)',
            'покажува кога ќе се пушти звукот. Тактовите се музички временски единици. Во еден такт има 4 ритмички удари',
            'End measure (Краен такт)',
            'покажува кога ќе запре звукот',
            'Таквиот ред со код ќе изгледа вака',
            'Може да додавате различни ефекти, како на пример јачина на звукот за да го подобрите звукот на композицијата. Опсегот на јачината на звукот се протега од -60,0 децибели до 12,0 децибели, со тоа што 0,0 е првичната јачина.',
            'Напишете',
            'Во заградите напишете го бројот на записот, VOLUME, GAIN, нивото на јачината на звукот, почетниот такт, нивото на јачина и крајниот такт',
            'Ова е пример на ефектот за појачување',
            'и ефектот на снижување'
        ],
        'example' => [
            'Слушнете',
            'пример за песна искодирана со Earsketch',
            'Може да го увезете кодот и да го уредите'
        ],
    ],
    'sensing-game' => [
        'title' => 'Направете видеоигра со насетување',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Кодирање подвижни предмети',
            'Подобро разбирање на тоа како се контролираат дигиталните анимации со физички движења',
            'Компонирање песна со мешавина од звучни клипови'
        ],
        'description' =>
            'Во овој предизвик ќе создадете едноставна игра во која видеокамерата се користи како сензор за насетување движења, што значи дека ќе може да управувате со анимациите преку физички движења. Во оваа игра, задачата е да се соберат колку што е можно повеќе балончиња од Европската недела на кодирање во 30 секунди. Наместо да собирате балончиња, може да создадете игра каде што бркате некој лик или пукате балони со рацете.',
        'instructions' => [
            'Најавете се на',
            'Кликнете на',
            'Add an extension (Додај екстензија)',
            'и изберете',
            'Video Sensing (Видеонасетување)',
            'Ќе ја препознае брзината на движење на предметот. Ако бројката е пониска, ќе реагира на помали дразби при движење.',
            'Додајте сенка. Изберете звук и додајте го на сенката. Ако сакате, може да додадете',
            'Create a clone (Создај клон)',
            'за да ја удвоите сенката.',
            'Создајте две променливи: една за',
            'Score (Резултат)',
            'и друга за',
            'Timer (Одбројувач)',
            'и додајте ги на сенката. Поставете го одбројувачот на 30 и додајте',
            'Change Timer by -1 (Промени го одбројувачот за -1)',
            'Создајте нова сенка',
            'Game Over (Играта заврши)',
            'за да ја завршите играта. Може да создадете и сенка со насловот на вашата игра, на пример, „Соберете ги сите меурчиња на Европската недела на кодирање“.'
        ],
        'example' => [
            'Играјте ја видеоиграта со насетување наречена Соберете ги сите меурчиња на Европската недела на кодирање. Слободно изменете го',
            'овој проект'
        ]
    ],

    'calming-leds' => [
        'title' => 'Смирувачки LED светла: создајте едноставен уред со micro:bit',
        'author' => 'Образовна фондација Micro:bit',
        'duration' => '20 минути',
        'materials' => [
            'уред и батерија micro:bit (ако се достапни)',
            'лаптоп или таблет преку којшто може да одите на Microsoft MakeCode и Youtube',
            'microbit.org за материјалите поврзани со активноста'
        ],
        'description' =>
            'Учениците создаваат дигитален уред со LED светла што може да им помогне да си го регулираат дишењето и да се чувствуваат посмирени. Од нив ќе се побара да напишат едноставен код за да видат како функционираат анимациите и секвенците.',
        'instructions' => [
            'Целта е да се создаде функционален уред со смирувачки LED светла што ќе може да се користи за регулирање на дишењето. Уредот може да се создаде на физичка micro:bit табла или на симулаторот во уредувачот на MakeCode.',
            'Предизвикот може да се исполни преку уредувачот на MakeCode и со пишување на едноставна секвенца со код како што е прикажано на видеото/сликата од екранот.',
            'За да се прошири предизвикот, учениците може да ги истражат различните анимации и да ја покажат својата креативност со анимацијата што би сакале да ја видат за да се чувствуваат посмирени и среќни.',
            'Повеќе информации и видеоупатства може да најдете на',
            'оваа врска'
        ],
        'example' =>
            'Посетете ја страницава за да најдете упатства и видеа од исполнетиот предизвик, плус и како да кодирате',
        'purposes' => [
            'Дизајнирање едноставен дигитален артефакт што ќе биде корисен на некој начин',
            'Истражување на секвенците и анимациите и како функционираат',
            'Тестирање и отстранување грешки во едноставни кодови',
            'Повторно користење на некој дизајн за анимациите да бидат побавни или побрзи'
        ]
    ],
    'computational-thinking-and-computational-fluency' => [
        'title' =>
            'Компјутерско размислување и компјутерска писменост со ScratchJr',
        'author' => 'Стаматис Пападакис – Амбасадор на Грција на Европската недела на кодирање',
        'purposes' => [
            'Запознавање со новите команди и интерфејсот.',
            'Создавање едноставни програми со едноставни команди за причина-и-влијание.',
            'Едноставно отстранување грешки преку обиди и грешки.'
        ],
        'description' =>
            'Во овој предизвик децата ќе ги интегрираат концептите за CT во своите проекти користејќи ја апликацијата ScratchJr за приказните да ги направат повозбудливи, поемотивни и такви што и другите ќе сакаат да учествуваат.',
        'instructions' => [
            'Не е потребно децата да бидат описменети за да работат со ScratchJr. Сите упатства и опциите во менито се препознатливи преку симболи и бои. Предизвикот може да се исполни во училница, во лабораторија, па дури и на отворено бидејќи не е потребна интернет-врска.',
            'Децата го користат градот како заднина и користат блокови за кодирање за да направат еден автомобил да вози низ градот.'
        ],
        'example' => [
            'Децата може да користат звучни блокови и блокови за движење, како и блокови за почнување одново за да ги натераат своите ликови да танцуваат.',
            'Децата избираат заднина и лик и користат блок за движење за да направат еден автомобил да се движи низ градот. Децата може да искористат блок за брзина за да забрзаат или да забават некој од ликовите.'
        ],
        'materials' => [
            'Бесплатната апликација',
            'функционира со неколку различни оперативни системи и видови на паметни уреди',
            'Исто така, на веб-страницата',
            'се нудат голем број образовни материјали'
        ],
        'duration' => '90 минути'
    ],
    'ai-hour-of-code' => [
        'title' => 'Време за кодирање вештачка интелигенција',
        'author' => 'Едиција за образование на Minecraft',
        'purposes' => [
            'Создавање решенија за кодирање во кои се вклучени секвенци, настани, јамки и кондиционали',
            'Разглобување на чекорите што се потребни за да се реши некој проблем на концизна секвенца со упатства',
            'Истражување на концептите за кодирање'
        ],
        'description' =>
            'На едно село му се заканува пожар и вие треба да искодирате решение! Запознајте го вашиот помошник за кодирање, агентот Minecraft, а потоа испрограмирајте го агентот да се движи низ шумата и да собира податоци. Овие податоци ќе му помогнат на агентот да предвиди каде ќе има пожар. Потоа искодирајте го агентот да помогне во спречувањето на ширењето на пожарот, спасете го селото и вратете го животот во шумата. Дознајте ги основите на кодирањето и истражете вистински примери за вештачка интелигенција (AI).',
        'instructions' => 'Преземете го планот за лекцијата овде',
        'materials' => [
            'Инсталирајте Minecraft: Education Edition',
            'Откако ќе ја инсталирате Едицијата за образование со Minecraft, предизвикот ќе го најдете на',
            'оваа веб-страница'
        ]
    ],
    'create-a-dance' => [
        'title' => 'Создајте танц со одата на кодирањето Ode to Code!',
        'purposes' =>
            'Вежбање кодирање на смешен начин и поврзување со заедницата на Европската недела на кодирање.',
        'description' => [
            'Создајте танц со одата на кодирањето Ode to Code! Искористете го',
            'Туторијалот за забава со танцување',
            'за да искодирате танц на Ode to Code. Официјалната химна на Европската недела на кодирање е наведена како можен избор во Забавата со танцување.'
        ],
        'instructions' => [
            'Упатствата се прикажани како видеа во',
            'туторијалот',
            'и напишани на врвот на секое ниво'
        ],
        'example' =>
            'Вклучените креации на учениците може да се најдат на следната веб-страница',
        'materials' => 'Туторијалот Code.org'
    ],
    'create-a-simulation' => [
        'title' => 'Создајте симулација!',
        'purposes' => [
            'Учење за симулациите воведувајќи ги следните променливи: создавање група на луѓе, стапки на оздравување, носење маски и вакцини.',
            'Активирање претходни знаења за ширењето на некој вирус во реалниот свет што би биле применливи на фиктивно сценарио.'
        ],
        'description' =>
            'Напишете код за да создадете и да пуштите сопствена симулација за појавата на вирусот во Чудовишград (Monster Town). Дознајте како да кодирате и да правите претпоставки за тоа што ќе им се случи на соседите на Чудовишград (Monster Town).',
        'instructions' => [
            'Упатствата се прикажани како видеа во',
            'туторијалот',
            'и напишани на врвот на секое ниво'
        ],
        'example' =>
            'Кога ќе завршите, може да ја споделите симулацијата со други лица. Споделете ја пораката за тоа што мислите дека може да направиме за да ги зачуваме останатите здрави кога ќе се појави некој вирус.',
        'materials' => 'Туторијалот Code.org',
    ],
    'create-your-own-masterpiece' => [
        'title' => 'Создајте свое ремек-дело!',
        'audience' => 'Прифатливо за сите возрасти',
        'purpose' =>
            'Запознавање со концептите за компјутерската наука на визуелен начин и  инспирирање креативност',
        'description' =>
            'Создајте свое ремек-дело со уметник! Користете блокови за кодирање за да го натерате уметникот да создаде уникатно дело.',
        'instructions' => 'Упатствата се наведени на врвот на секое ниво',
        'example' => 'Примерите за уметници може да ги најдете на страницава во цртежите (drawing)',
        'materials' => ['Првото ниво на туторијалот може да го најдете', 'ОВДЕ']
    ],
    'cs-first-unplugged-activities' => [
        'title' => 'Активности за основите на компјутерските науки без интернет (CS First Unplugged)',
        'purposes' => [
            'Да се поддржат учениците што учат од дома',
            'Секој да направи пауза од екраните'
        ],
        'description' =>
            'CS First Unplugged е комплет активности што ги запознаваат учениците со концептите на компјутерските науки без компјутер. Ја создадовме оваа лекција за да покажеме дека компјутерските науки се многу повеќе од само кодирање.',
        'instructions' => [
            'Прирачникот со сите активности ќе го најдете на англиски јазик на овој',
            'линк',
            'како и во Планот за лекции на англиски јазик на овој',
            'Активностите во оваа лекција може да се исполнат засебно и по кој било редослед',
            'Наставникот/чката може да го фотографира процесот на учење и да го сподели на инстаграм со хаштагот #EUCodeWeekChallengeGoogle #GrowWithGoogle'
        ],
        'materials' => [
            'Покрај прирачникот со активности, за некои активности се потребни или пак би биле подобри со дополнителни материјали.',
            'Помагала за броење (како суви мешунки) за користење на мапата за создавање мрежа на соседства Network a Neighborhood.',
            'Ножички за да се исече тркалото со бројки за испраќање тајна порака Send a Secret Message.',
            'Картон и лепак за да се зацврсти тркалото со бројки за испраќање тајна порака Send a Secret Message.',
            'Игличка, чепкалка за заби или исправена спојница за поврзување на тркалото со бројки за испраќање тајна порака Send a Secret Message.'
        ]
    ],
    'family-care' => [
        'title' => 'Грижа за семејството',
        'experience' => 'Отворено за сите',
        'duration' => '5 до 10 часа',
        'author' => '',
        'purposes' => [
            'За пребарување на темата за грижа за семејството со којашто се соочуваме секојдневно;',
            'За да се гледа на проблемите како на можности и да се создаваат креативни решенија;',
            'За кодирањето да се користи за иновативно остварување на решенијата;',
            'За дизајнирање постери и претставување на решенијата на други луѓе;',
            'За користење на социјалните мрежи за да се создаде влијание на проектите.'
        ],
        'description' => [
            'На што помислувате кога се зборува за дом? На убава куќа? На обилна вечера подготвена од родителите? На тајно место само за вас? Топлиот дом е како бензинска станица за телото и духот. Сред брзиот модерен живот, родителите секогаш се зафатени. Кога се дружите со пријателите, не можете да ги оставите мачињата. Но како да се грижите за фирмата кога сте разделени? Темата на овој предизвик е',
            'Семејна грижа',
            'Врз основа на оваа тема, учениците се поттикнуваат да развијат идеја за пренесување љубов и грижа преку кодирањето и хардверот. Еве неколку прашања за коишто би сакале да размислите',
            'Колку членови на семејството има во вашиот дом? Кои се тие? Сте имале ли некаков проблем кога сте со нив? Каков вид на грижа им е потребна?',
            'Дали знаете некој на кого му е потребна семејна грижа повеќе од другите во вашата заедница? Како може да му помогнете на тоа лице?'
        ],
        'instructions' => [
            'Нафрлете идеи и истражете ја темата за семејната грижа',
            'Направете список на какви било проблеми',
            'Создајте можни решенија',
            'Изберете решение',
            'Програмирајте ја и изградете ја структурата',
            'Дизајнирајте постер за истакнување на проектот',
            'Претставете го на наставниците и членовите на семејството'
        ],
        'example' => ['Најдете некои примери оттука', 'и'],
        'materials' => [
            'Алатка за кодирање:',
            'или преземете ја',
            'верзијата за компјутер',
            'mBlock е програмски јазик заснован на Scratch',
            'Предизвикот е приспособен и од натпреварот MakeX Global Spark Competition, програма за креативен дизајн заснована на проекти за млади лица на возраст од 6 до 13 години.',
            'Учесничкиот тим ќе треба да се фокусира на конкретната тема и да најде решение преку програмирање на софтвер и градење на хардвер.',
            'Учениците може слободно да го исполнат предизвикот во Неделата на кодирање и да го пренесат на меѓународно ниво за да го споделат со други ученици и да освојат награди.',
            'За повеќе информации, видете на:',
            'или контактирајте нè на'
        ],
    ],
    'virtual-flower-field' => [
        'title' => 'Одгледувајте виртуелно поле со цвеќиња',
        'author' =>
            'Јагда Хуегле – Обучувач на Meet and Code и дел од тимот на SAP Snap!',
        'duration' => '30 – 60 минути',
        'purposes' => [
            'Запознавање со програмирањето преку едноставен проект што паѓа во очи.',
            'Да се научи дека кодирањето може да биде уметничко доживување и да доведе до прекрасни резултати.',
            'Да се обои есента со светли бои и цвеќиња во Европската недела на кодирање.',
            'Да се покаже диверзитетот на цвеќиња на Земјата.',
            'Да се придонесе за Целите за одржлив развој (SDG), особено SDG13 – Климатски промени, создавајќи настани за кодирање што го подобруваат учењето за климатските промени преку подигнување на свеста за темата.'
        ],
        'description' =>
            'Развијте програма во Snap! преку која ќе одгледувате виртуелно поле со цвеќиња од различни видови и различен број на ливчиња.',
        'instructions' => [
            'Ако ви треба инспирација за да започнете со предизвикот, видете го',
            'ова видео',
            'или искористете го',
            'овој документ',
            'за да проследите',
            'Предизвикот може да се исполни со програмирање виртуелно поле со цвеќиња во Snap! (или Scratch) и со објавување фотографија од резултатот онлајн.',
            'Полето со цвеќиња треба да содржи различни видови цвеќиња со различен број ливчиња. Идеално би било цвеќињата да бидат програмирани, што значи дека се создадени со отпечатоци и вртење (или со цртање и вртење) на ливчињата.',
            'Објавете слика од виртуелната градина со цвеќиња со хаштагот #MeetandCode.'
        ],
        'materials' => [
            'Ви препорачуваме да користите',
            'но проектот функционира и со'
        ]
    ],
    'haunted-house' => [
        'title' => 'Haunted House in Hedy (Опседната куќа во Хеди)',
        'author' =>
            'Фелиен Херманс, Универзитетот во Лејден – Рамон Морлаг, I&I – Недела на кодирање, Холандија',
        'audience' => 'Учители и обучувачи',
        'duration' => '1 час или 2 часа во зависност од претходните познавања',
        'purposes' => [
            'Да се направи интерактивна приказна за опседната куќа.',
            'Да се научи програмирање со Hedy.'
        ],
        'description' =>
            'Со Hedy, ќе создадете приказна за опседната куќа со интерактивни елементи. Секогаш кога кодот ќе се пушти, ќе се создаде нова приказна. Може и компјутерот да ја чита приказната наглас и да се сподели онлајн.',
        'instructions' => [
            'Започнете така што ќе го отворите прелистувачот и ќе отидете на hedycode.com.',
            'Следете ги упатствата за нивоата 1-4. Користете ги јазичињата ‘Level’ (ниво) и ‘Haunted house’ (опседната куќа).’',
            'Со помош на овие нивоа, ќе напишеме интерактивна приказна за опседната куќа.',
            'Наставници, може да најдете и план за лекцијата со Hedy',
            'овде',
            'Може да најдете снимка од Фелиен Херманс како ја претставува Hedy на',
            'овој линк'
        ],
        'example' => 'Пример за опседната куќа на ниво',
        'materials' => ['Hedy на', 'ниво од 1 до 4'],
    ],
    'inclusive-app-design' => [
        'title' => 'Дизајнирање на инклузивна апликација',
        'author' => 'Apple Education',
        'duration' => '60 минути + незадолжителни дополнителни активности',
        'purposes' => [
            'Нафрлување идеи, планирање, создавање прототип и споделување на идеја за апликација до којашто секој ќе може да пристапи и да ја разбере.'
        ],
        'description' =>
            'Одличните апликации започнуваат од одлични идеи. Во оваа активност, учениците ќе смислат идеја за апликација на тема којашто им се допаѓа, а потоа ќе откријат како да дизајнираат апликација имајќи ги предвид инклузијата и пристапноста.',
        'instructions' => [
            'Сите упатства ќе ги најдете на оваа врска',
            'Со овој едночасовен план за лекција, обучувачите може да ги насочат учениците да',
            'научат како се дизајнираат инклузивни апликации',
            'нафрлуваат идеи за теми коишто им се допаѓаат и да најдат идеја за апликација',
            'ги наведат идеите за апликација и да ги испланираат активностите на корисниците',
            'создадат еден дел од апликацијата во Keynote',
            'споделат демо од прототипот и да опишат како ги поддржуваат корисниците со различни искуства и способности'
        ],
        'materials' => [
            'Истражете ја активноста Дизајн на инклузивна апликација во центарот Apple Teacher Learning Center',
            'Се препорачува Keynote на iPad или Mac, но не е задолжително.'
        ]
    ],
    'silly-eyes' => [
        'title' => 'Смешни очи',
        'author' => 'Raspberry Pi Foundation',
        'duration' => '25 минути',
        'purposes' => [
            'Создавање проект со интеракција на корисниците.',
            'Персонализиран проект со бои и графички ефекти.',
            'Учење за дизајнот во дигиталната сфера.'
        ],
        'description' =>
            'Во овој проект ќе дизајнирате и создадете лик со смешни очи. Големите смешни очи на ликот ќе го следат покажувачот од глувчето за да го оживеат ликот.',
        'instructions' => 'Пристапете до целосниот опис на проектот овде',
        'example' => 'Видете ги Gobo, Under the sea и Don\'t eat donut'
    ],
    'train-ai-bot' => [
        'title' => 'Обучете робот со вештачка интелигенција!',
        'purposes' =>
            'Учење поврзано со вештачка интелигенција (AI), машинско учење, обучување податоци и пристрасност при истражување етнички проблеми и како AI може да се користи за справување со проблеми во светот.',
        'description' =>
            'Обучете робот со вештачка интелигенција за океаните. Во оваа активност, ќе програмирате или обучите вештачка интелигенција како да препознава риби или ѓубре. Ајде да го исчистиме океанот!',
        'instructions' => [
            'Упатствата се прикажани како видеа во туторијалот',
            'и напишани на врвот на секое ниво'
        ],
        'materials' => [
            'Туторијалот може да го најдете овде',
            'Овој туторијал е достапен на повеќе од 25 јазици'
        ],
    ],
    'build-calliope' => [
        'title' => 'Изградете го вашиот сопствен Calliope mini фитнес тренер.',
        'author' => 'Amazon Future Engineer | Meet and Code feat. Calliope gGmbH.',
        'purposes' => [
            'Разиграно запознавање секвенци, анимации, повторувања и варијабли.',
            'Да се дизајнира структурална шема.',
            'За тестирање и отстранување грешки на кодот.',
            'Да се оптимизира програма преку низа на проби, проверка и прилагодување на употребливоста.'
        ],
        'duration' => '20-30 минути',
        'description' =>
            'Учесниците ќе развијат дигитално контролиран прототип кој користи шарена светлечка ЛЕД за да репродуцира однапред смислена фитнес вежба од 10 единици.',
        'materials' => [
            'Calliope mini StarterBox (ако е достапно)',
            'Лаптоп или таблет со кој можете да go посетите <a href="https://makecode.calliope.cc">https://makecode.calliope.cc</a></a>или <a href="https://calliope.cc">https://calliope.cc</a> и YouTube за да пристапите до ресурси за активноста.'
        ],
        'instructions' => [
            'За да започнете, направете план и одредете го распоредот на единиците на вежбата. Користејќи го распоредот, програмирајте го RGB LED на Calliope mini за да прикаже една од 5-те бои со претходно дефинирано темпо. Потоа креирајте варијабла за темпото и повторувањата на програмите користејќи јамки.',
            "Запомнете, ако сте ја имплементирале програмата на начин кој вас ви се допаѓа може да го споделите со нас на info@calliope.cc - би биле презадоволни да видиме како сте ја направиле. Патем, подаруваме 30 mini Calliope меѓу прилозите!",
            "Споделете го QR-кодот на вашиот проект на Инстаграм, додајте го хаштагот #EUCodeWeekChallenge и спомнете @CodeWeekEU.",
        ],
        'example' => [
            'Додека седите на вашиот компјутер: можете и вие да се чувствувате спортски.',
            'Креирајте фитнес прототип со Calliope mini кој исто така може да биде тестиран на симулатор. Предизвикот е направен во MakeCode едиторот со програмирање на низа од едноставен код (видете слика на екран).',
            'Изберете 5 различни бои и доделете фитнес вежба на секоја од нив, на пр. чучњеви или скокање. Тогаш боите може да се наредат по кој било редослед и да се вежбаат.'
        ],

    ],
    'common' => [
    'share' => 'Споделете го линкот или QR кодот на вашиот проект на Instagram или на Facebook, додајте хаштаг #EUCodeWeekChallenge and mention @CodeWeekEU.',
    'audience' => [
        'Учители и обучувачи',
        'Ученици од основно училиште (од 6 до 12 години)',
        'Ученици во пониски години од средно училиште (од 12 до 16 години)',
        'Ученици во повисоки години од средно училиште (од 16 до 18 години)',
    ],
],
    'code-a-dice' => [
    'title' => 'Кодирајте Јамб (фрлање коцки)',
    'author' => 'Fabrizia Agnello',
    'purposes' => [
        'Кодирајте интерактивни загатки',
        'За да кодирате симулација на предмет што произволно се движи за да се користи ако нема на располагање вистински предмет'
    ],
    'description' =>
        'Во предизвикот ќе кодирате коцка којашто произволно ќе ја фрлате на ваша наредба. Можете да изберете каков било тип коцка со онолку лица колку што сакате, како оние што се користат во игрите за играње улоги, а исто така и да додадете звуци.',
    'instructions' => [
        'Најавете се на Scratch',
        'Изберете платно за позадина',
        'Креирајте ваша самовила за фрлање коцки или побарајте една на интернет и вчитајте ja во вашата програма',
        'Креирајте онолку костуми за самовилата колку што ќе изберете страници на коцката, секојa од нив покажувајќи различен број',
        'Изберете како сакате да почнете со фрлање на коцката (со притискање копче на тастатурата, со кликнување на самовилата итн.) и запишете го кодот',
        'Кодирајте ја самовилата така за произволно да го менува костумот на крајот од фрлањето',
        'Додајте звучни ефекти',
    ],
    'example' => 'Фрлајте Д-20 коцка'
],
    'personal-trainer' => [
    'title' => 'Личен тренер со micro:bit',
    'author' => '',
    'purposes' => [
        'За да кодирате micro:bit за употреба на аларм и лед панел',
        'За да креирате личен уред којшто ќе ја контролира вашата физичка активност',
        'За да кодирате micro:bit за да го подобрите вашето здравје преку спорт',
    ],
    'description' =>
        'Овој предизвик ви овозможува да го кодирате вашиот micro:bit за контрола на времињата на повторување на физичките вежби во комбинација со преостанатото време. Ќе ја следите вашата физичка активност на училиште, дома или во парк.'
    ,
    'instructions' => [
        'Кога имате А+Б, креирајте тајмер што одбројува 3 секунди со звук на музичка нота при секоја секунда и го прикажува зборот GO! (ОДИ!)',
        'За време на првата вежба, прикажете квадрат 2х2 што трепка во траење од 20 секунди. Потоа пуштете звук и одржувајте го квадратот фиксен. За преостанатото време, мора да се прикаже друга слика што трепка во траење од 10 секунди. Кога ќе заврши, се огласува звук.',
        'Потоа, повторете го истото дејство, но прикажете панел 3х3 за времето на вежбата. Повторете ги овие дејства додека се прикажува 5х5.',
    ],
    'duration' => '30-40 минути'
],
    'create-a-spiral' => [
    'title' => 'Создајте спирала',
    'author' => 'Lydie El-Halougi',
    'purposes' => [
        'За да учите и практикувате јамки и варијабли.',
        'За да ја зголемите креативноста во кодирањето.'],
    'description' => 'Во овој предизвик, ќе пишувате проект со Scratch за да создадете спирала, користејќи ги блоковите со пенкала, јамка и варијабла.',

    'instructions' => [
        'Блокови со пенкала',
        'Креирајте нов проект и наречете го Спирала.',
        'Кликнете на виолетовата икона „Додај екстензија“ на долната лева страна од прозорецот',
        'Изберете „пенкало“: блоковите со пенкала сега се достапни за вашиот проект!',
        'За да започнете со вашиот проект, повлечете го и испуштете го блокот „кога ќе кликне зеленото знаменце“:',
        'Потребно е да започнете со празна страница: во рамките на блоковите со пенкала, додајте “избриши ги сите“ блокови:',
        'Сакате да започнете со цртање во центарот на сцената, што значи дека вашата самовила треба да оди до центарот на сцената (0,0):',
        'Вашата самовила може да се движи без цртање или движење и цртање:',
        'кога сакате да ја нацртате, може да го користите блокот за спуштање на пенкалото',
        'кога не го сакате тоа, може да го користите блокот за подигање на пенкалото',
        'Сега, сакате да цртате! Додајте го блокот „спушти пенкало“:',
        'Шестоаголник',
        'Додајте ги блоковите подолу на вашиот проект:',
        'Сега имате една шестина од вашиот шестоаголник. Оваа секвенца треба да ја повторите 6 пати:',
        'Спирала',
        'За да создадете спирала, потребно е да додадете 2 на должината на секоја следна страна.',
        'За да го направите тоа, ќе користите <strong>variable.</strong>',
        'Во блоковите на варијаблата, кликнете на Направи варијабла',
        'Именувајте ја како должина, а потоа кликнете ОК:',
        'Спиралата ќе започне да расте, ќе треба да започнете од мала: поставете ја првата должина на 10, а потоа вметнете го овој блок пред јамката.',
        'Вметнете ја варијаблата „должина“ во блокот „движи ...чекори',
        'За да расте спиралата, исто така потребно е да расте и должината во секоја јамка: додајте го блокот подолу на крајот на јамката:',
        'Еве го вашиот тековен проект:',
        'Убава спирала',
        'Вие нацртавте спирала! За да продолжи понатаму, заменете ја јамката „повтори 6“ со јамката „засекогаш“:',
        'За да нацртате шарена спирала, додајте го следниот блок во јамката:',
        'Кога ќе започнете одново, самовилата црта несакана линија. За да го спречите тоа, додајте го блокот „подигни пенкало“ на почетокот на проектот.',
        'Еве го вашиот конечен проект:',
        'Честитки! Создадовте прекрасна спирала!',
    ],

],
    'play-against-ai' => [
    'title' => 'Создавајте и играјте против ВИ - Играта камен, ножици, хартија',
    'author' => 'Kristina Slišurić',
    'purposes' => [
        'за да сфатите како функционира циклусот на машинско учење.',
        'за да изградите модел на машинско учење со помош на Машина што може да учи',
        'за да се запознаете со алатката Пиктоблокс и за да го увезете создадениот модел во проектот',
        'за да ја поставите сцената и ликовите, да создавате и иницирате варијабли во Пиктоблокс',
        'за да иницирате игра, да идентификувате движења на играчот, за да програмирате произволни движења на ВИ',
        'за да креирате и тестирате игра која вклучува вештачка интелигенција како противник во играта камен, хартија, ножици.'

    ],
    'description' => 'Ќе создадеме модел со помош на Машината способна за учење од слики користејќи три класи: Камен, ножици и хартија. Моделот ќе се вчита во Пиктоблокс и ќе се користи за креирање игра што можеме да ја играме против ВИ.',
    'duration' => '90 минути',
    'instructions' => [
        'Креирајте нов проект во слики на машина способна да учи со 3 класи наречени Камен, Хартија и Ножици. За секоја класа, направете со камерата најмалку 400 слики. Позадината треба да биде јасна. Обучете го и извезете го моделот. Поставете го моделот и копирајте го линкот.',
        'Создадете бесплатна сметка на страницата на Пиктоблокс. Додајте екстензија за машинско учење и поставете модел. Поставете ги сцената, варијаблите и самовилите. Иницирајте ја играта, утврдете ги движењата на играчот и движењата на ВИ и кој победува во рундата.',
        'Обучете ги податоците за играта.',
        'Тестирајте го моделот.',
        'Извезете го моделот.',
        'Додајте екстензија за машинско учење и вчитајте го моделот.',
        'Поставете ги сцената, варијаблите и самовилите.',
        'Стартување на играта.',
        'Утврдете ги движењата на играчот.',
        'Утврдете произволни движења на ВИ.',
        'Емитувајте произволни движења на ВИ.',
        'Направете три блокови. Кој победува во рундата?',
        'Проверете дали играчот победува во рундата.',
        'Проверете дали ВИ победува во рундата.',
        'Проверете дали рундата е цртање.',
        'Програмирајте блокови.',
        'Камен Хартија Ножици Самовила',
    ]
],
    'air-drawing-with-AI' => [
    'title' => 'Цртање во воздух со ВИ',
    'author' => 'Kristina Slišurić',
    'purposes' => [
        'за да напишете програма користејќи ја екстензијата за детекција на човечко тело за препознавање на движењата на прстите пред камерата.',
        'за да кодирате со едноставни блокови во код од неколку редови.',
        'за да видите пример на користење ВИ'
    ],
    'description' => 'Создавање програма што му овозможува на корисникот да црта во воздух со неговата рака (показалец) пред камерата и сé што црта автоматски да се прикажува на сцената на Пиктоплокс',
    'instructions' => [
        'Создадете сметка на Пиктоблокс',
        'следете ги визуелните упатства за да:',
        'додадете екстензии за Детекција на човечко тело и Пенкало;',
        'ја поставите сцената и да додадете самовила (молив) и дополнителни самовили за: Спушти пенкало, Подигни пенкало, Избриши сé;  ',
        'напишете код за самовила за молив којашто ќе го следи прстот',
        'напишете код за копчиња: Подигни пенкало, Спушти пенкало и Избриши сé и исто така за Пенкало',
        'Сега сé ви поставено за да цртате свои цртежи и да играте со различните бои и големини на пенкалото.',
    ],
    'materials' => [
        'Лаптоп или компјутер со камера',
        'Преземена е последната верзија на ПиктоБлокс (препорачана) или онлајн Пиктоблокс (бесплатна)',
        'Сметка на Пиктоблокс (бесплатна)',
        'Добра интернет врска'
    ]
],
    'emobot-kliki' => [
    'title' => 'Емобот Клики',
    'author' => 'Margareta Zajkova',
    'purposes' => [
        'За да ги научите основните концепти на машинското учење и препознавање текст.',
        'За да ја сфатите улогата на емоциите во комуникациите.',
        'За да користите кодови за создавање дијалог помеѓу робот за разговор и корисник.',
        'За да сфатите како компјутерите можат да ги препознаат емоционалните тонови преку анализа на текст и да одговорат соодветно.'
    ],
    'description' => [
        'За да создадете емоционален робот во Scratch којшто може да прикаже среќно лице за позитивни пораки (ако му кажете убави работи), налутено лице за негативни пораки (ако му кажете лоши работи) и збунето лице ако пораката не е јасна.',
        'Нашиот Емобот Клики ќе ги препознае комплиментите и навредите за да видите како компјутерите можат да се обучат за да препознаваат емоционални тонови.',
    ],
    'instructions' => [
        'За да започнете, програмирајте листа на правила за тоа што е фино или љубезно и што е лошo или злонамерно.',
        'Најавете се на https://machinelearningforkids.co.uk/ или создајте нова сметка.',
        'Направете нов модел за машинско учење додавајќи 3 нови ознаки, првата наречете ја „фино“, втората наречете ја „лошо“ и изборно, ако сакате да го препознава вашето име, направете трета ознака наречена „име“.',
        'Обучете то новиот модел на машинско учење, тестирајте го и користете го за да направите Емобот во Scratch.',
        'Стартувајте го уредникот Scratch 3, избришете ја самовилата мачка, внесете ги 3 нови самовили направени од Microsoft Bing Image Creator (карикатура на среќен, лут и несигурен компјутер) или создајте нова самовила со кликање на иконата Боење, цртајќи три копии на костуми за среќно, луто и несигурно лице.',
        'Кликнете на картичката „Кодирај“ и внесете ја следната самовилa.']
    ,
    'example' => [
        'Споделете го Емоботот Клики со своите другари и научете уште повеќе за ВИ и емоциите!',
        "Наместо компјутерска карикатура, можете да пробате нешто друго, на пример, животно. Наместо љубезно и злонамерно, можете да го обучите ликот да препознава други видови пораки.",
    ],

],
    'craft-magic' => [
    'title' => 'Направете магија со гестикулации на дланките со ВИ',
    'author' => 'Georgia Lascaris',
    'purposes' => [
        'За развивање на вештините за кодирање кај учениците, овозможувајќи им да ги корситат основните команди.',
        'За развивање вештини за алгоритамско размислување, расчленувајќи ги сложените задачи на чекори што можат полесно да се решат.',
        'За поттикнување на креативното решавање на проблемите при изнаоѓањето уникатни примени на гестикулациите со дланки за цртање и пишување.',
        'За поттикнување на разбирањето на концептите на ВИ, особно како ВИ им овозможува на компјутерите да ги препознаваат и толкуваат гестикулациите со дланките.',
        'За подигање на свесноста за тоа колку е значајна технологијата за лицата со посебни потреби.',
        'За промовирање решавање проблеми преку соработка и тимска работа меѓу учениците, додека работат заедно на подобрување на нивните програми за гестиклација со дланки.',
        'За поврзување на вештините за кодирање и компјутерско размислување со нивната примена во реални ситуации, нагласувајќи го значајното влијание на технологијата врз животот на луѓето и усогласување со Целите на одржливиот развој.'
    ],
    'duration' => [
        '90 минути за ученици 10-12',
        '45 минути за ученици 12-15'
    ],
    'description' => 'Создајте програма базирана на блокови од Scratch користејќи ја екстензијата на ВИ „Човечко тело“ на креативен и интересн начин, за да цртате на екран без да имате потреба од традиционалното глувче или екранот на допир.',
    'instructions' => [
        "Поврзете се со https://ai.thestempedia.com and create a teacher & students accounts.",
        "Увезете ги екстензиите „Детекција на човечко тело\", 'Пенкало', 'Текст во говор'.",
        "Додајте ја самовилата 'Молив' од библиотеката и создајте 7 самовили ('пишувај', 'бриши', 'црно', 'црвено', 'сино', 'зелено', 'розово').",
        "Напишете команди за да проверите што се случува кога самовилата 'молив' ќе допре некоја од другите самовили.",
        "Напишете команди за да ѝ овозможите на камерата да препознава Поза на дланка и движете го моливот до координатите x и y на вашиот показалец.",
        "Сменете го костумот на крајот од фрлањето.",
        "Додајте звучни ефекти.",
    ],
    'materials' => [
        'Платформа за програмирање https://ai.thestempedia.com (free)',
        'сметка на наставник (бесплатна)',
        'сметка на ученик (бесплатна)',
        'Компјутери со камера',
        'Интернет врска',
    ]
],
    'circle-of-dots' => [
    'title' => 'Круг со точки',
    'author' => 'Marin Popov',
    'purposes' => [
        'За да напишете код за цртање линија со точки.',
        'За да напишете код за цртање линија со цртички.',
        'За да напишете код за цртање круг.',
        'За да напишете код за цртање круг со точки (цртички).',
    ],
    'description' => 'Нацртајте круг со точки или цртички.',
    'duration' => '40 минути',
    'instructions' => [
        'Градење блок за точки.',
        'Градење блок за цртички.',
        'Градење круг со точки.',
        'Градење круг со цртички.',
    ]
],
    'coding-escape-room' => [
    'title' => 'Создавање просторија за бегство при кодирање',
    'author' => 'Стефанија Алтиери и Елиза Барагини',
    'purposes' => [
        'За да ги научите и за да размислуваат за концептите на кодирањето.',
        'За да користите едноставни алатки за кодирање.',
        'За да развиете компјутерски начин на размислување и решавање проблеми.'
    ], 'description' => [
        'За да создадете искуство на бегство од кодирање како ова:',
        'Можете да користите google образец, генијално, google презентација, или која било друга алатка за да создадете раскажување приказна врз база на кодирање ;).'

    ],
    'duration' => '90 минути',
    'instructions' =>
        'Можете да ги поделите учениците во мала група, можат да играат, а потоа да создадат друг предизвик со образецот:'
    ,

    'materials' => [
        'Може да се користи која било алатка (платформа на Google и Microsoft за создавање и споделување документи, презентации и табели). Што било за кодирање, алатка или ликови поврзани со ИКТ и кодирањето.'
    ],
    'example' => [
        'Некои ликови коишто имале многу важна улога во историјата на ИКТ и основните концепти на кодирањето и програмирањето се претставуваат преку игра. Ова е најдобар начин на учење и активно учество. Оваа игра може да се игра во тимови или индивидуално, како предизвик или натпревар. Учениците можат да создадат нешто слично и да ги развијат своите компетенции, како на пример, креативност и вештини за кодирање.',
        'Ова е многу практичен ресурс што може повторно да се користи и лесно да се пресоздаде. Google обрасците се една од можните алатки. Исто така, можете да користите Google слајдови, Genial.ly или Emaze или која било друга алатка за да создадете прказни што се вкрстуваат и ваши сопствени авантури.',
        'Предизвикот на бегство е поделен на сесии. Ако погодите, продолжувате понатаму. Учениците треба да создадат квизови за кодирање.',
    ],
],
    'let-the-snake-run' => [
    'title' => 'Нека трча змијата',
    'author' => 'Ágota Klacsákné Tóth',
    'purposes' => [
        'За да го кодирате движењето на змијата во нејзиниот сопствен micro:bit',
        'За да утврдите точна поставеност и време за заедничка анимација.'
    ],
    'description' => 'Учениците мора да напишат кодови за да ја наведуваат змијата низ micro:bits еден до друг. Тоа мора да се направи на начин што ќе изгледа како змијата да трча од еден micro:bit до друг.',
    'duration' => '30 минути',
    'instructions' => [
        'Дизајнирајте патека што поминува низ неколку micro:bits еден до друг (на пр., формирање квадрат 2х2).',
        'Напишете кодови змијата се движи по патека.',
        'Работете на својот уред, а потоа поврзете ги и пуштете го кодот.',
        'Размислете за времето и поставеноста: Ако змијата излезе од еден micro:bit, ќе се појави на следниот micro:bit.',
        'Дополнителни предизвици: Со micro:bit v2, пуштете музика додека змијата го напушта вашиот уред.',
        'Дизајнирајте ја змијата преку менување на осветленоста на ЛЕД-овите.',
        'Обидете се со подолги змии или пак со повеќе змии.'
    ],
    'example' => [
        'Ова е пример за змија долга 6 пиксели со 4 micro:bits формирајќи квадрат 2х2:',
        'Кодирање на почетен micro:bit (ова може да го направи наставникот)',
        'Сите кодови се иницираат со овој micro:bit, којшто испраќа радиосигнал до другите micro:bits кога ќе се притисне копчето А.',
        'Кодирање на движење на змијата',
        'Секој micro:bit мора да биде во иста радиогрупа како и почетниот micro:bit.',
        'Сите анимации започнуваат кога ќе го примат радиосигналот.',
        'Анимацијата на првиот micro:bit веднаш станува видлива, другите чекаат додека змијата не стигне таму.',
        'Времето меѓу двете фази ја утврдува брзината на змијата.',
    ], 'materials' => [
        'micro:bitѕ (за секој ученик, ако е можно)',
        'лаптоп или компјутер за makecode.microbit.org editor'
    ]
],
    'illustrate-a-joke' => [
    'title' => 'Илустрирајте шега со bitsy',
    'author' => 'Margot Schubert',
    'purposes' => 'За да создадете мала игра во којашто корисникот го пронаоѓа одговорот на шеговито прашање.',
    'description' => 'Учениците создаваат игра во којашто корисникот го пронаоѓа одговорот на шеговито прашање кога фигурата ќе удри во предмет на теренот за игра. Учениците користат основни функции на bitsy за да го завршат предизвикот.',
    'instructions' => [
        'Смислете шеговито прашање. Одете во bitsy и започнете нов проект. Што ќе ви биде потребно:',
        'аватар - самовила што може да ја движите наоколу',
        'Бела мачка на виолетова позадина',
        'Автоматски генериран опис',
        'предмет кон којшто аватарот треба да оди',
        'просторија - позадина на вашата програма',
        'две пораки: прашање и одговор',
        'Завршената игра може да се презема како html датотека.'
    ],
    'example' => 'На оваа веб-страница може да видите пример за шега и има линк до дигитална бела табла:',
    'materials' => 'bitsy функционира во прелистувач'
],
    'app-that-counts-in-several-languages' => [
    'title' => 'Апликација што брои на неколку јазици',
    'author' => 'Samuel Branco',
    'purposes' => [
        'За да научите како да создадете едноставна апликација.',
        'За да научите да програмирате преку блокови.',
        'За да научите да додавате ознаки, копчиња, слики, сензори и медиуми.',
        'За да научите како да ги организирате елементите на екранот на апликацијата.'
    ],
    'description' => 'Апликацијата ви овозможува да броите на повеќе јазици со притискање на копче. Секогаш кога корисникот ќе го затресе паметниот телефон, броењето се враќа на нула. Предизвикот е да додадете друг јазик.',
    'instructions' => [
        'За да го завршите предизвикот, потребно е да го дефинирате другиот јазик на којшто сакате апликацијата да брои.',
        'Потоа, потребно е од интернет (на пр., Pixabay или Unsplash) да го преземете знамето на таа земја и да го вчитате во платформата MIT APP Inventor преку елементот наречен знаме, во имотот на Picture.',
        'Потоа, треба да најдете како се пишува името на таа земја на англиски јазик и како да кажете напушти и притисни ме, на јазикот на таа земја.',
        'На крај, треба да ги додадете неопходните блокови за апликацијата да функционира на новиот јазик.',
    ],
    'materials' => [
        'За да развиете апликација, потребен ви е компјутер или лаптоп со пристап до интернет.',
        'Создајте сметка на платформата MIT APP Inventor, достапна преку <a href=\'https://ai2.appinventor.mit.edu\'>https://ai2.appinventor.mit.edu</a>',
        'Исто така, неопходно е да ја инсталирате апликацијата MIT AI2 Companion app на паметниот телефон за да ја тестирате развиената апликација'
    ]
],
    'coding-with-art-through-storytelling' => [
    'title' => 'Кодирање со уметност преку Раскажување приказни',
    'author' => 'Марија Цапара и Анти Аркули',
    'purposes' => [
        'За да ги негувате вештините на набљудување, толкување и поставување прашања преку уметноста.',
        'За да бидете креативни и да соработувате со другите заради заедничка цел',
        'За да создадете алгоритам за прераскажување прказната.',
    ],
    'description' => 'Во овој предизвик, учениците ќе бидат инспирирани од уметничко дело, ќе создадат приказна и ќе ја илустрираат. Потоа, ќе се обидат да ја прераскажат приказната со помош на роботски комплет што може да се програмира/или како активност во живо.',
    'materials' => [
        'Оваа активност може да се спроведе како активност во живо или пак со помош на робот што може да се програмира, како на пример, робот пчела/син робот/робот глувче.',
        'картички со стрелки на роботот пчела или картички со стрелки за активност во живо',
        'на грчки јазик',
        'За да научите повеќе за Проектот Нула \ Алатник за рутина на размислување, може да ја посетите страницата'

    ],
    'example' => [
        'Наставникот работи со учениците за да осмисли модел како да создадат алгоритам со картичките коишто ќе му даваат упатства на роботот пчела или на друг робот за да отиде до првиот настан од приказната. Учениците работат во тимови од по 3-4 за да создадат алгоритам за роботот да се движи до следната секвенца. Учениците ги тестираат нивните алгоритми на час и ги решаваат проблемите, ако е потребно.',
        'Тие продолжуваат да се движат напред низ настаните на приказната, како што умеат',
        'Оваа активност исто така може да се спроведе како активност во живо.',
        'Едно дете е роботот - друго дете е програмерот. Програмерот создава алгоритамска патека користејќи ги картичките со стрелки за да му помогне на роботот да се движи од една слика до дуга и да ја прераскажува приказната. Секој пат кога роботот ќе се најде во слика, ќе биде замолен да раскаже дел од приказната.',
    ],
    'instructions' => [
        'Наставникот ги замолува учениците да набљудуваат уметничка слика/фотографија.',
        'Тие ја користат рутината на размислување „Почеток, Средина, Крај“ (Проект Нула на Харвардското училиште) за да создадат приказна.',
        'Настаникот ги прашува “Ако ова уметничко дели е почеток/средина/крајна една приказна, што би можело да се случи следно/пред/на крај?',
        'Учениците ги илустрираат настаните од приказната.',
        'Учениците си приспомнуваат за приказната и ги поставуваат настаните во табела. Користејќи ги картичките со стрелки, тие создаваат алгоритам којшто му помага на роботот пчела да ја прераскаже приказната.',
    ],
],
    'coding-with-legoboost' => [
    'title' => 'Кодирање и програмирање со LegoBoost - екстензија на Scratch',
    'author' => 'Lidia Ristea',
    'purposes' => [
        'за градење модели со помош на LegoBoost.',
        'за развивање вештини за програмирање во Scrath.',
        'за програмирање роботи со помош на команди, од едноставни до сложени.'
    ],
    'description' => 'Во овој предизвик, учениците ќе ја користат екстензијата на Scratch-LegoBoost и ќе внесуваат кодови во апликацијата за роботите да се движат напред, назад, да избегнуваат препреки и гласовни команди.',
    'duration' => '120 минути',
    'instructions' => [
        'Најавете се на апликацијата Scratch.mit.edu.',
        'Стартувајте го линкот на Scratch и активирајте го Блутутот на лаптопот.',
        'Кликнете Додај екстензија од Scratch и изберете LegoBoost.',
        'Додајте слика за Европската недела на кодирање.',
        'Двата АБ мотори треба да се ВКЛУЧЕНИ, а кога ќе наидат на црвена препрека, да се ИСКЛУЧАТ.',
        'Во зелена боја, моторот А е ВКЛУЧЕН, а во црна боја, моторот Б е ВКЛУЧЕН.',
        'По патот ќе бидат поставени зелени, црвени и црни препреки.',
        'Додајте команди за движење и свртувања од стрелките и текст-во-говор кога ќе наиде на препрека.',
        'Тестирајте го!'
    ]
]


];