<?php

return [
    'title' => 'ПРЕДИЗВИЦИ ЗА ЕВРОПСКАТА НЕДЕЛА НА КОДИРАЊЕ',
    'date' => '9–24 октомври 2021 г.',
    'common' => [
        'target-audience' => 'Целна публика',
        'pre-primary' => 'Ученици на претшколска возраст',
        'experience' => 'Искуство',
        'duration' => 'Времетраење',
        'materials' => 'Препорачани материјали',
        'purpose' => 'Цел',
        'description' => 'Опис',
        'instructions' => 'Упатства',
        'example' => 'Пример',
        'written-by' => ['Овој предизвик е напишан од', 'и е дел од'],
        'teachers' => 'Наставници',
        'students' => 'Ученици',
        'beginner' => 'Почетно ниво',
        'intermediate' => 'Средно ниво',
        'advanced' => 'Напредно ниво',
        '1-hour' => '1 час'
    ],
    'main' => [
        'За време на Европската недела на кодирање, од 9-ти до 24-ти октомври 2021 г., ве покануваме да исполните еден или повеќе од предизвиците на Европската недела на кодирање.',
        'Што се предизвиците на Европската недела на кодирање 2021?',
        'Предизвиците на Европската недела на кодирање се активности што може да ги правите сами, во училница, со колегите или со пријателите. Би сакале да учествувате на Неделата на кодирање но немате идеја што да организирате? Не размислувајте повеќе! Ние и нашите партнери на Неделата на кодирање направивме избор на предизвици кои лесно се организираат и во кои се вклучени конкретни примери за тоа како да ги користите во училница или во група. Има и насоки за тоа како да ги исполните предизвиците, но може да ги приспособите за да одговараат на потребите, интересите и возраста на учесниците. Може да користите какви било алатки и технологии што ви се допаѓаат, но ние препорачуваме бесплатно достапни материјали со отворен код.',
        'Изберете еден или повеќе предизвици, приспособете ги на групата или одделението и споделете ги резултатите на Instagram за да поттикнете и други колеги и пријатели да се вклучат во забавата во текот на Неделата на кодирање!',
        'Кликнете на предизвикот за да дознаете нешто повеќе за него:',
        'Кој може да се приклучи?',
        'Секој (училишта, наставници, библиотеки, клубови за кодирање, бизниси, јавни власти) е поканет да ја прослави Европската недела на кодирање 2021 така што ќе исполни некој од предизвиците #CodeWeekChallenge.',
        'Како да учествувате на некој од предизвиците на Европската недела на кодирање 2021?',
        'Изберете предизвик што би сакале да го исполните.',
        'Спојте ги учесниците во парови или во групи. Тимската работа и соработката се клучни за успешно исполнување на предизвиците, без разлика дали организирате активност на лице место или онлајн и дали се работи за национална или меѓународна активност за соработка.',
        'Споделете го предизвикот',
        'Дали би сакале да освоите некои од наградите на Неделата на кодирање? Ако е така, прикажете што сте сработиле пред светот!',
        'Откако ќе го исполните предизвикот, споделете на Instagram.',
        'Добитниците ќе се избираат секој ден во текот на Неделата на кодирање од 9 – 24 октомври и ќе се објавуваат на нашиот канал на Instagram, па не заборавајте редовно да си ги проверувате известувањата.'
    ],
    'share' => [
        'Како да ги споделите исполнетите предизвици на Instagram?',
        'Притиснете на копчето Edit profile (Уредување на профилот)',
        'Додајте го линкот од сработеното во полето за веб-страница и зачувајте',
        'Создајте нова објава',
        'Додајте слика од екранот од сработеното',
        'Напишете опис што ќе ги охрабри и другите',
        'Не заборавајте да наведете дека линкот се наоѓа во кратката биографија ‘Link in Bio’',
        'Додајте го хаштагот #CodeWeekChallenge',
        'Спомнете ја Неделата на кодирање, така што ќе ја означите со @CodeWeekEU',
        'Повеќе би сакале да ги споделувате предизвиците на Facebook?',
        'На',
        'Facebook',
        'страницата на Европската недела на кодирање секој ден ќе се поставува нова објава со предизвик и ќе се избира победник што ќе ја освои наградата од коментарите под објавата.',
        'Како функционира?',
        'Едноставно оставете коментар на објавата со линкот од она што сте го сработиле.'
    ],
    'share-box' => [
        'Споделете го линкот од сработеното во',
        'делот за кратка биографија на Instagram',
        'притиснете на копчето',
        'Edit Profile (Уредување на профилот)',
        'на профилот на Instagram и додајте го линкот од сработеното во полето за веб-страница. Потоа, создајте нова објава, додајте слика од екранот од сработеното, напишете ',
        'Link in Bio (линкот е во кратката биографија)',
        'додајте го хаштагот #CodeWeekChallenge и означете @CodeWeekEU',
        'Повеќе би сакале да ги споделувате предизвиците на',
        'Европската недела на кодирање ќе објавува',
        'нова објава со предизвик на',
        'Facebook страницата',
        'Потоа, едноставно оставете коментар на објавата со врската од она што сте го сработиле',
        'Добитниците ќе се избираат секој ден во текот на Неделата на кодирање од 9-24 октомври и ќе добиваат награди од Неделата на кодирање, а ќе се објавуваат на нашите канали на Instagram и Facebook, па не заборавајте редовно да си ги проверувате известувањата'
    ],
    'take-part' => [
        'Зошто да учествувате на некој од предизвиците на Европската недела на кодирање?',
        'За да се вклучите во активности за решавање проблеми и за кодирање.',
        'За да соработувате со лица со слични интереси.',
        'За да ја споделите пораката за важноста на кодирањето.'
    ],
    'download' => [
        'Кликнете',
        'овде',
        'за да го преземете предизвикот како документ во Word-формат'
    ],
    'bingo' => [
        'Исполнете ги сите предизвици',
        'Го исполнивте предизвикот? Отпечатете ја',
        'картичката за бинго',
        'и означете го малото бело меурче на горната лева страна',
        'Споделете го предизвикот на социјалните мрежи и освојте супер награди од Неделата на кодирање',
        'Едноставно поставете слика со завршените редови, колони или – уште подобро – целото бинго на',
        'Facebook, Instagram или Twitter',
        'Не зборавајте да искористите'
    ]
];
