<?php

return [
    'chatbot' => [
        'title' => 'Создајте робот за разговор',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Кодирајте интерактивни загатки',
            'Користете кодови за да создадете дијалог помеѓу робот за разговор и корисник'
        ],
        'description' =>
            'Искодирајте разговор помеѓу робот за разговор и корисник којшто се обидува да одгатне некоја загатка. Обидете се да создадете робот за разговор којшто може да разговара како личност. Наместо загатка, може да создадете дијалог помеѓу роботот за разговор и корисникот.',
        'instructions' => [
            'Смислете загатка',
            'Најавете се на',
            'или создајте нова сметка. (При создавање нова сметка, имајте предвид дека на Pencil Code не е дозволено користење на вистински имиња поради приватност.)',
            'Кликнете на Imagine (Замислете) и Make your own (Создајте свое)',
            'Користете режим со блокови или текст за да ја напишете загатката',
            'Или може да го искористите',
            'овој код',
            'и да го приспособите на загатката или пак да изберете Answering a riddle (Одговарање на некоја загатка) од менито и да го уредите'
        ],
        'example' => 'Разгледајте го овој пример за загатка.',
        'more' => [
            'Кодов е приспособен од активност на Pencil Code',
            'Answering the Riddle'
        ]
    ],

    'paper-circuit' => [
        'title' => 'Кодирајте без струја: Создајте хартиено коло',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => ['Продлабочување на креативноста', 'Развивање вештини за решавање проблеми'],
        'description' => [
            'Нацртајте што сакате. Може да биде небо со ѕвезди, бубамара, робот, новогодишна елка или што и да замислите. Слободно персонализирајте си го проектот со визуелните помагала на Европската недела на кодирање: може да го истражите',
            'комплетот алатки на Европската недела на кодирање',
            'и да ги преземете сите логоа или визуелни помагала што ги сакате. Може да создадете дури и покана со хартиеното коло за Европската недела на кодирање. Додајте мотивациска порака на колото за да ги поттикнете и другите наставници да се приклучат на Неделата на кодирање и/или да ја разгледаат веб-страницата за училишта.'
        ],
        'instructions' => [
            'Нацртајте нешто и одлучете кои делови сакате да светат (на пр., ѕвездите).',
            'Направете дупче во хартијата со молив и вметнете лепенка со LED светло во секој осветлен дел.  ',
            'Нацртајте круг каде што ќе ја поставите батеријата во форма на копче.',
            'Нацртајте линија со + и - на другата страна на листот. Погрижете се подолгата страна на лепенката со колото од LED светла да биде поврзана со страната на батеријата означена со „+“, а пократката со страната на батеријата означена со „-“.',
            'Поставете ја бакарната лента на линиите.',
            'Превиткајте ја хартијата така што LED светлата ќе се вклучат штом хартијата ќе ја покрие батеријата. Може да користите спојница за да бидете сигурни дека ќе има добар контакт со бакарната лента.',
            'Направете слика од хартиеното коло и споделете ја на Instagram, објаснувајќи зошто сметате дека вреди да се учествува во оваа иницијатива.  '
        ],
        'example' => 'Видете некои примери за хартиени кола',
        'materials' => [
            'хартија или картон',
            'боички или маркер',
            'батерија во форма на копче',
            'бакарна лента',
            'лепенки со LED коло',
            'спојница'
        ]
    ],

    'dance' => [
        'title' => 'Создајте танц',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
            'Учење основни концепти на кодирање',
            'Учење како се анимираат ликови'
        ],
        'description' =>
            'Во овој предизвик, ќе создадете група ликови коишто ќе танцуваат заедно. Ќе користите вградена библиотека на медиуми за да ги изберете ликовите и музичките клипови или може да создадете свои. Ќе ги анимирате ликовите да танцуваат и да разговараат едни со други.',
        'instructions' => [
            'Најавете се на',
            'како наставник. Создајте сметки за учениците и споделете ги со нив. Или може да споделите код за одделението, а вашите ученици да се регистрираат со нивната школска адреса на е-пошта. Ако сте ученик, може да се приклучите како ученик, но ќе ви биде побарано да ја наведете адресата на е-пошта на некој од родителите за да може да ја одобрат вашата сметка',
            'Кликнете на',
            'и напишете наслов',
            'Одете на',
            'за да додадете заднина со кликнување на иконата со запченик. Изберете заднина од Media Library (Библиотеката со медиуми), поставете слика од вас или направете нова и поставете ја. Изберете аудиоклип и додајте го на сцената (stage):',
            'Кликнете на копчето',
            'за да додадете ликови или предмети што ќе ги анимирате така што ќе можат да мрдаат, да разговараат и да влегуваат во интеракција едни со други. Додајте два или три лика по ваш избор. Може сами да си ги нацртате актерите или да ги измените постоечките. Додајте различни костуми на ликовите со кликнување на иконата со молив.',
            'Кликнувајте на секој актер и анимирајте го додавајќи ги следните блокови',
            'Додајте',
            'блок за зборување (say block)',
            'и направете актерите да разговараат меѓу себе. Менувајте ја формата на балончињата за разговор, како и фонтот и големината на текстот'
        ],
        'example' => [
            'Ѕирнете го',
            'овој пример',
            'за роботи што танцуваат. Слободно искористете го и изменете го.'
        ]
    ],

    'compose-song' => [
        'title' => 'Создајте музичка композиција',
        'author' => 'Тимот на Европската недела на кодирање',
        'purposes' => [
    'Да се научи кодирање преку музика',
    'Да се прави разлика помеѓу музичките жанрови и инструменти',
    'Да се компонира песна со мешавина од звучни клипови'
],
        'description' =>
            'Во овој предизвик ќе создадете музичка композиција користејќи програмски јазик. Може да користите некои од вградените звучни клипови или да снимите свој и да ги смешате за да создадете музичка композиција. Пуштете го кодот во Работната станица за дигитален звук (Digital Audio Workstation) и слушнете ја музиката што ја искодиравте. Играјте си со различните звуци и ефекти за да ја менувате музиката.',
        'instructions' => [
    'Најавете се на',
    'Кликнете тука за да направите скрипта',
    'Именувајте ја скриптата и изберете',
    'како програмски јазик',
    'Започнете да го пишувате кодот помеѓу редовите',
    'и',
    '',
    'Прелистајте ги музичките клипови во',
    'Библиотеката со звуци (Sound Library)',
    'и изберете ги музичките жанрови, изведувачи и инструменти што ви се допаѓаат',
    'За да додадете звучен клип на песната, напишете',
    'Помеѓу заградите треба да ги има следните 4 параметри, одделени со запирки',
    'Sound clip (Звучен клип)',
    'Ставете го покажувачот помеѓу заградите, одете во Библиотеката со звуци, изберете клип и залепете го кликнувајќи на сината икона за лепење',
    'Број на запис',
    'записите ви помагаат да си ги организирате звуците според видот на инструмент (вокал, бас, тапани, клавијатура итн.). Додајте колку што сакате записи (инструменти). Записите се прикажуваат како редови низ Работната станица за дигитален звук (Digital Audio Workstation)',
    'Start measure (Почетен такт)',
    'покажува кога ќе се пушти звукот. Тактовите се музички временски единици. Во еден такт има 4 ритмички удари',
    'End measure (Краен такт)',
    'покажува кога ќе запре звукот',
    'Таквиот ред со код ќе изгледа вака',
    'Може да додавате различни ефекти, како на пример јачина на звукот за да го подобрите звукот на композицијата. Опсегот на јачината на звукот се протега од -60,0 децибели до 12,0 децибели, со тоа што 0,0 е првичната јачина.',
    'Напишете',
    'Во заградите напишете го бројот на записот, VOLUME, GAIN, нивото на јачината на звукот, почетниот такт, нивото на јачина и крајниот такт',
    'Ова е пример на ефектот за појачување',
    'и ефектот на снижување'
],
        'example' => [
    'Слушнете',
    'пример за песна искодирана со Earsketch',
    'Може да го увезете кодот и да го уредите'
],
    ],
    'sensing-game' => [
    'title' => 'Направете видеоигра со насетување',
    'author' => 'Тимот на Европската недела на кодирање',
    'purposes' => [
        'Кодирање подвижни предмети',
        'Подобро разбирање на тоа како се контролираат дигиталните анимации со физички движења',
        'Компонирање песна со мешавина од звучни клипови'
    ],
    'description' =>
        'Во овој предизвик ќе создадете едноставна игра во која видеокамерата се користи како сензор за насетување движења, што значи дека ќе може да управувате со анимациите преку физички движења. Во оваа игра, задачата е да се соберат колку што е можно повеќе балончиња од Европската недела на кодирање во 30 секунди. Наместо да собирате балончиња, може да создадете игра каде што бркате некој лик или пукате балони со рацете.',
    'instructions' => [
        'Најавете се на',
        'Кликнете на',
        'Add an extension (Додај екстензија)',
        'и изберете',
        'Video Sensing (Видеонасетување)',
        'Ќе ја препознае брзината на движење на предметот. Ако бројката е пониска, ќе реагира на помали дразби при движење.',
        'Додајте сенка. Изберете звук и додајте го на сенката. Ако сакате, може да додадете',
        'Create a clone (Создај клон)',
        'за да ја удвоите сенката.',
        'Создајте две променливи: една за',
        'Score (Резултат)',
        'и друга за',
        'Timer (Одбројувач)',
        'и додајте ги на сенката. Поставете го одбројувачот на 30 и додајте',
        'Change Timer by -1 (Промени го одбројувачот за -1)',
        'Создајте нова сенка',
        'Game Over (Играта заврши)',
        'за да ја завршите играта. Може да создадете и сенка со насловот на вашата игра, на пример, „Соберете ги сите меурчиња на Европската недела на кодирање“.'
    ],
    'example' => [
        'Играјте ја видеоиграта со насетување наречена Соберете ги сите меурчиња на Европската недела на кодирање. Слободно изменете го',
        'овој проект'
    ]
],

    'calming-leds' => [
    'title' => 'Смирувачки LED светла: создајте едноставен уред со micro:bit',
    'author' => 'Образовна фондација Micro:bit',
    'duration' => '20 минути',
    'materials' => [
        'уред и батерија micro:bit (ако се достапни)',
        'лаптоп или таблет преку којшто може да одите на Microsoft MakeCode и Youtube',
        'microbit.org за материјалите поврзани со активноста'
    ],
    'description' =>
        'Учениците создаваат дигитален уред со LED светла што може да им помогне да си го регулираат дишењето и да се чувствуваат посмирени. Од нив ќе се побара да напишат едноставен код за да видат како функционираат анимациите и секвенците.',
    'instructions' => [
        'Целта е да се создаде функционален уред со смирувачки LED светла што ќе може да се користи за регулирање на дишењето. Уредот може да се создаде на физичка micro:bit табла или на симулаторот во уредувачот на MakeCode.',
        'Предизвикот може да се исполни преку уредувачот на MakeCode и со пишување на едноставна секвенца со код како што е прикажано на видеото/сликата од екранот.',
        'За да се прошири предизвикот, учениците може да ги истражат различните анимации и да ја покажат својата креативност со анимацијата што би сакале да ја видат за да се чувствуваат посмирени и среќни.',
        'Повеќе информации и видеоупатства може да најдете на',
        'оваа врска'
    ],
    'example' =>
        'Посетете ја страницава за да најдете упатства и видеа од исполнетиот предизвик, плус и како да кодирате',
    'purposes' => [
        'Дизајнирање едноставен дигитален артефакт што ќе биде корисен на некој начин',
        'Истражување на секвенците и анимациите и како функционираат',
        'Тестирање и отстранување грешки во едноставни кодови',
        'Повторно користење на некој дизајн за анимациите да бидат побавни или побрзи'
    ]
],
    'computational-thinking-and-computational-fluency' => [
    'title' =>
        'Компјутерско размислување и компјутерска писменост со ScratchJr',
    'author' => 'Стаматис Пападакис – Амбасадор на Грција на Европската недела на кодирање',
    'purposes' => [
        'Запознавање со новите команди и интерфејсот.',
        'Создавање едноставни програми со едноставни команди за причина-и-влијание.',
        'Едноставно отстранување грешки преку обиди и грешки.'
    ],
    'description' =>
        'Во овој предизвик децата ќе ги интегрираат концептите за CT во своите проекти користејќи ја апликацијата ScratchJr за приказните да ги направат повозбудливи, поемотивни и такви што и другите ќе сакаат да учествуваат.',
    'instructions' => [
        'Не е потребно децата да бидат описменети за да работат со ScratchJr. Сите упатства и опциите во менито се препознатливи преку симболи и бои. Предизвикот може да се исполни во училница, во лабораторија, па дури и на отворено бидејќи не е потребна интернет-врска.',
        'Децата го користат градот како заднина и користат блокови за кодирање за да направат еден автомобил да вози низ градот.'
    ],
    'example' => [
        'Децата може да користат звучни блокови и блокови за движење, како и блокови за почнување одново за да ги натераат своите ликови да танцуваат.',
        'Децата избираат заднина и лик и користат блок за движење за да направат еден автомобил да се движи низ градот. Децата може да искористат блок за брзина за да забрзаат или да забават некој од ликовите.'
    ],
    'materials' => [
        'Бесплатната апликација',
        'функционира со неколку различни оперативни системи и видови на паметни уреди',
        'Исто така, на веб-страницата',
        'се нудат голем број образовни материјали'
    ],
    'duration' => '90 минути'
],
    'ai-hour-of-code' => [
    'title' => 'Време за кодирање вештачка интелигенција',
    'author' => 'Едиција за образование на Minecraft',
    'purposes' => [
        'Создавање решенија за кодирање во кои се вклучени секвенци, настани, јамки и кондиционали',
        'Разглобување на чекорите што се потребни за да се реши некој проблем на концизна секвенца со упатства',
        'Истражување на концептите за кодирање'
    ],
    'description' =>
        'На едно село му се заканува пожар и вие треба да искодирате решение! Запознајте го вашиот помошник за кодирање, агентот Minecraft, а потоа испрограмирајте го агентот да се движи низ шумата и да собира податоци. Овие податоци ќе му помогнат на агентот да предвиди каде ќе има пожар. Потоа искодирајте го агентот да помогне во спречувањето на ширењето на пожарот, спасете го селото и вратете го животот во шумата. Дознајте ги основите на кодирањето и истражете вистински примери за вештачка интелигенција (AI).',
    'instructions' => 'Преземете го планот за лекцијата овде',
    'materials' => [
        'Инсталирајте Minecraft: Education Edition',
        'Откако ќе ја инсталирате Едицијата за образование со Minecraft, предизвикот ќе го најдете на',
        'оваа веб-страница'
    ]
],
    'create-a-dance' => [
    'title' => 'Создајте танц со одата на кодирањето Ode to Code!',
    'purposes' =>
        'Вежбање кодирање на смешен начин и поврзување со заедницата на Европската недела на кодирање.',
    'description' => [
        'Создајте танц со одата на кодирањето Ode to Code! Искористете го',
        'Туторијалот за забава со танцување',
        'за да искодирате танц на Ode to Code. Официјалната химна на Европската недела на кодирање е наведена како можен избор во Забавата со танцување.'
    ],
    'instructions' => [
        'Упатствата се прикажани како видеа во',
        'туторијалот',
        'и напишани на врвот на секое ниво'
    ],
    'example' =>
        'Вклучените креации на учениците може да се најдат на следната веб-страница',
    'materials' => 'Туторијалот Code.org'
],
    'create-a-simulation' => [
    'title' => 'Создајте симулација!',
    'purposes' => [
        'Учење за симулациите воведувајќи ги следните променливи: создавање група на луѓе, стапки на оздравување, носење маски и вакцини.',
        'Активирање претходни знаења за ширењето на некој вирус во реалниот свет што би биле применливи на фиктивно сценарио.'
    ],
    'description' =>
        'Напишете код за да создадете и да пуштите сопствена симулација за појавата на вирусот во Чудовишград (Monster Town). Дознајте како да кодирате и да правите претпоставки за тоа што ќе им се случи на соседите на Чудовишград (Monster Town).',
    'instructions' => [
        'Упатствата се прикажани како видеа во',
        'туторијалот',
        'и напишани на врвот на секое ниво'
    ],
    'example' =>
        'Кога ќе завршите, може да ја споделите симулацијата со други лица. Споделете ја пораката за тоа што мислите дека може да направиме за да ги зачуваме останатите здрави кога ќе се појави некој вирус.',
        'materials' => 'Туторијалот Code.org',
    ],
    'create-your-own-masterpiece' => [
        'title' => 'Создајте свое ремек-дело!',
        'audience' => 'Прифатливо за сите возрасти',
        'purpose' =>
            'Запознавање со концептите за компјутерската наука на визуелен начин и  инспирирање креативност',
        'description' =>
            'Создајте свое ремек-дело со уметник! Користете блокови за кодирање за да го натерате уметникот да создаде уникатно дело.',
        'instructions' => 'Упатствата се наведени на врвот на секое ниво',
        'example' => 'Примерите за уметници може да ги најдете на страницава во цртежите (drawing)',
        'materials' => ['Првото ниво на туторијалот може да го најдете', 'ОВДЕ']
    ],
    'cs-first-unplugged-activities' => [
        'title' => 'Активности за основите на компјутерските науки без интернет (CS First Unplugged)',
        'purposes' => [
            'Да се поддржат учениците што учат од дома',
            'Секој да направи пауза од екраните'
        ],
        'description' =>
            'CS First Unplugged е комплет активности што ги запознаваат учениците со концептите на компјутерските науки без компјутер. Ја создадовме оваа лекција за да покажеме дека компјутерските науки се многу повеќе од само кодирање.',
        'instructions' => [
            'Прирачникот со сите активности ќе го најдете на англиски јазик на овој',
            'линк',
            'како и во Планот за лекции на англиски јазик на овој',
            'Активностите во оваа лекција може да се исполнат засебно и по кој било редослед',
            'Наставникот/чката може да го фотографира процесот на учење и да го сподели на инстаграм со хаштагот #CodeWeekChallengeGoogle'
        ],
        'materials' => [
    'Покрај прирачникот со активности, за некои активности се потребни или пак би биле подобри со дополнителни материјали.',
    'Помагала за броење (како суви мешунки) за користење на мапата за создавање мрежа на соседства Network a Neighborhood.',
    'Ножички за да се исече тркалото со бројки за испраќање тајна порака Send a Secret Message.',
    'Картон и лепак за да се зацврсти тркалото со бројки за испраќање тајна порака Send a Secret Message.',
    'Игличка, чепкалка за заби или исправена спојница за поврзување на тркалото со бројки за испраќање тајна порака Send a Secret Message.'
]
    ],
    'family-care' => [
    'title' => 'Грижа за семејството',
    'experience' => 'Отворено за сите',
    'duration' => '5 до 10 часа',
    'author' => '',
    'purposes' => [
        'За пребарување на темата за грижа за семејството со којашто се соочуваме секојдневно;',
        'За да се гледа на проблемите како на можности и да се создаваат креативни решенија;',
        'За кодирањето да се користи за иновативно остварување на решенијата;',
        'За дизајнирање постери и претставување на решенијата на други луѓе;',
        'За користење на социјалните мрежи за да се создаде влијание на проектите.'
    ],
    'description' => [
        'На што помислувате кога се зборува за дом? На убава куќа? На обилна вечера подготвена од родителите? На тајно место само за вас? Топлиот дом е како бензинска станица за телото и духот. Сред брзиот модерен живот, родителите секогаш се зафатени. Кога се дружите со пријателите, не можете да ги оставите мачињата. Но како да се грижите за фирмата кога сте разделени? Темата на овој предизвик е',
        'Семејна грижа',
        'Врз основа на оваа тема, учениците се поттикнуваат да развијат идеја за пренесување љубов и грижа преку кодирањето и хардверот. Еве неколку прашања за коишто би сакале да размислите',
        'Колку членови на семејството има во вашиот дом? Кои се тие? Сте имале ли некаков проблем кога сте со нив? Каков вид на грижа им е потребна?',
        'Дали знаете некој на кого му е потребна семејна грижа повеќе од другите во вашата заедница? Како може да му помогнете на тоа лице?'
    ],
    'instructions' => [
        'Нафрлете идеи и истражете ја темата за семејната грижа',
        'Направете список на какви било проблеми',
        'Создајте можни решенија',
        'Изберете решение',
        'Програмирајте ја и изградете ја структурата',
        'Дизајнирајте постер за истакнување на проектот',
        'Претставете го на наставниците и членовите на семејството'
    ],
    'example' => ['Најдете некои примери оттука', 'и'],
    'materials' => [
        'Алатка за кодирање:',
        'или преземете ја',
        'верзијата за компјутер',
        'mBlock е програмски јазик заснован на Scratch',
        'Предизвикот е приспособен и од натпреварот MakeX Global Spark Competition, програма за креативен дизајн заснована на проекти за млади лица на возраст од 6 до 13 години.',
        'Учесничкиот тим ќе треба да се фокусира на конкретната тема и да најде решение преку програмирање на софтвер и градење на хардвер.',
        'Учениците може слободно да го исполнат предизвикот во Неделата на кодирање и да го пренесат на меѓународно ниво за да го споделат со други ученици и да освојат награди.',
        'За повеќе информации, видете на:',
        'или контактирајте нè на'
    ],
],
    'virtual-flower-field' => [
    'title' => 'Одгледувајте виртуелно поле со цвеќиња',
    'author' =>
        'Јагда Хуегле – Обучувач на Meet and Code и дел од тимот на SAP Snap!',
    'duration' => '30 – 60 минути',
    'purposes' => [
        'Запознавање со програмирањето преку едноставен проект што паѓа во очи.',
        'Да се научи дека кодирањето може да биде уметничко доживување и да доведе до прекрасни резултати.',
        'Да се обои есента со светли бои и цвеќиња во Европската недела на кодирање.',
        'Да се покаже диверзитетот на цвеќиња на Земјата.',
        'Да се придонесе за Целите за одржлив развој (SDG), особено SDG13 – Климатски промени, создавајќи настани за кодирање што го подобруваат учењето за климатските промени преку подигнување на свеста за темата.'
    ],
    'description' =>
        'Развијте програма во Snap! преку која ќе одгледувате виртуелно поле со цвеќиња од различни видови и различен број на ливчиња.',
    'instructions' => [
        'Ако ви треба инспирација за да започнете со предизвикот, видете го',
        'ова видео',
        'или искористете го',
        'овој документ',
        'за да проследите',
        'Предизвикот може да се исполни со програмирање виртуелно поле со цвеќиња во Snap! (или Scratch) и со објавување фотографија од резултатот онлајн.',
        'Полето со цвеќиња треба да содржи различни видови цвеќиња со различен број ливчиња. Идеално би било цвеќињата да бидат програмирани, што значи дека се создадени со отпечатоци и вртење (или со цртање и вртење) на ливчињата.',
        'Објавете слика од виртуелната градина со цвеќиња со хаштагот #MeetandCode.'
    ],
    'materials' => [
        'Ви препорачуваме да користите',
        'но проектот функционира и со'
    ]
],
    'haunted-house' => [
    'title' => 'Haunted House in Hedy (Опседната куќа во Хеди)',
    'author' =>
        'Фелиен Херманс, Универзитетот во Лејден – Рамон Морлаг, I&I – Недела на кодирање, Холандија',
    'audience' => 'Учители и обучувачи',
    'duration' => '1 час или 2 часа во зависност од претходните познавања',
    'purposes' => [
        'Да се направи интерактивна приказна за опседната куќа.',
        'Да се научи програмирање со Hedy.'
    ],
    'description' =>
        'Со Hedy, ќе создадете приказна за опседната куќа со интерактивни елементи. Секогаш кога кодот ќе се пушти, ќе се создаде нова приказна. Може и компјутерот да ја чита приказната наглас и да се сподели онлајн.',
    'instructions' => [
        'Започнете така што ќе го отворите прелистувачот и ќе отидете на hedycode.com.',
        'Следете ги упатствата за нивоата 1-4. Користете ги јазичињата ‘Level’ (ниво) и ‘Haunted house’ (опседната куќа).’',
        'Со помош на овие нивоа, ќе напишеме интерактивна приказна за опседната куќа.',
        'Наставници, може да најдете и план за лекцијата со Hedy',
        'овде',
        'Може да најдете снимка од Фелиен Херманс како ја претставува Hedy на',
        'овој линк'
    ],
    'example' => 'Пример за опседната куќа на ниво',
    'materials' => ['Hedy на', 'ниво од 1 до 4'],
],
    'inclusive-app-design' => [
    'title' => 'Дизајнирање на инклузивна апликација',
    'author' => 'Apple Education',
    'duration' => '60 минути + незадолжителни дополнителни активности',
    'purposes' => [
        'Нафрлување идеи, планирање, создавање прототип и споделување на идеја за апликација до којашто секој ќе може да пристапи и да ја разбере.'
    ],
    'description' =>
        'Одличните апликации започнуваат од одлични идеи. Во оваа активност, учениците ќе смислат идеја за апликација на тема којашто им се допаѓа, а потоа ќе откријат како да дизајнираат апликација имајќи ги предвид инклузијата и пристапноста.',
    'instructions' => [
        'Сите упатства ќе ги најдете на оваа врска',
        'Со овој едночасовен план за лекција, обучувачите може да ги насочат учениците да',
        'научат како се дизајнираат инклузивни апликации',
        'нафрлуваат идеи за теми коишто им се допаѓаат и да најдат идеја за апликација',
        'ги наведат идеите за апликација и да ги испланираат активностите на корисниците',
        'создадат еден дел од апликацијата во Keynote',
        'споделат демо од прототипот и да опишат како ги поддржуваат корисниците со различни искуства и способности'
    ],
    'materials' => [
        'Истражете ја активноста Дизајн на инклузивна апликација во центарот Apple Teacher Learning Center',
        'Се препорачува Keynote на iPad или Mac, но не е задолжително.'
    ]
],
    'silly-eyes' => [
    'title' => 'Смешни очи',
    'author' => 'Raspberry Pi Foundation',
    'duration' => '25 минути',
    'purposes' => [
        'Создавање проект со интеракција на корисниците.',
        'Персонализиран проект со бои и графички ефекти.',
        'Учење за дизајнот во дигиталната сфера.'
    ],
    'description' =>
        'Во овој проект ќе дизајнирате и создадете лик со смешни очи. Големите смешни очи на ликот ќе го следат покажувачот од глувчето за да го оживеат ликот.',
    'instructions' => 'Пристапете до целосниот опис на проектот овде',
    'example' => 'Видете ги Gobo, Under the sea и Don\'t eat donut'
],
    'train-ai-bot' => [
    'title' => 'Обучете робот со вештачка интелигенција!',
    'purposes' =>
        'Учење поврзано со вештачка интелигенција (AI), машинско учење, обучување податоци и пристрасност при истражување етнички проблеми и како AI може да се користи за справување со проблеми во светот.',
    'description' =>
        'Обучете робот со вештачка интелигенција за океаните. Во оваа активност, ќе програмирате или обучите вештачка интелигенција како да препознава риби или ѓубре. Ајде да го исчистиме океанот!',
    'instructions' => [
        'Упатствата се прикажани како видеа во туторијалот',
        'и напишани на врвот на секое ниво'
    ],
    'materials' => [
        'Туторијалот може да го најдете овде',
        'Овој туторијал е достапен на повеќе од 25 јазици'
    ],
]
];

