<?php

return [

    'title' => 'Предизвик Code Week 4 All',
    'text' => 'Предизвикот Code Week 4 All ве охрабрува да ги поврзете вашите активности со други активности организирани од пријатели, колеги и познаници и заедно да го добиете Сертификатот за извонредност на неделата на кодирање.',
    'what' => [
        'title' => 'Што е тоа?',
        'content' => '<p>Покрај поднесувањето на вашата активност на мапата на Европската недела на кодирањето, исто така можете да ангажирате и други лица во вашата мрежа да го направат истото. Ако вие и вашиот сојуз достигнете еден од следните прагови, сите ќе го добиете Сертификатот за извонредност на Европската недела на кодирањето.</p>
                            <p>Критериуми за стекнување Сертификат за извонредност:</p>',
        'criteria1' => 'Учество на 500 ученици',
        'criteria2' => '10 поврзани активности (10 различни организатори)',
        'criteria3' => '3 вклучени земји',
        'andor' => 'и / или',
    ],
    'howto' => [
        'title' => 'Како да учествувате?',
        'content' => 'Посетете ја страницата <a href="/add">Додај активност</a> и пополнете ги потребните детали за вашата активност на кодирање.',
        'first_alliance' => [
            'title' => 'Ако сте првиот во вашиот сојуз:',
            '1' => 'Кликнете на Поднеси.',
            '2' => 'Штом вашата активност ќе биде прифатена, ќе добиете е-пошта за потврда со вашиот единствен код за Code Week 4 All.',
            '3' => 'Копирајте го кодот и споделете го со вашите колеги и други во вашата мрежа кои исто така организираат активност на кодирање. Споделете ги информациите за да ги охрабрите другите да учествуваат!',
            '4' => 'По завршувањето на кампањата, од сите организатори на активност ќе се побара да дадат повратен извештај за тоа колку учесници вклучиле. Ако сте биле успешни во достигнувањето на прагот, вие и колегите кои биле дел од вашата мрежа ќе добиете Сертификат за извонредност!'
        ],
        'existing_alliance' => [
            'title' => 'Ако се придружувате на постоен сојуз:',
            '1' => 'Залепете го кодот за пристап што сте го добиле од иницијаторот, првиот што го изградил сојузот во полето на ќелијата со КОД ЗА CODE WEEK 4 ALL',
            '2' => 'Кликнете на Поднеси.',
            '3' => 'Споделете ги информациите (и кодот!) за да добиете повеќе организатори кои ќе му се придружат на вашиот сојуз.',
            '4' => 'По завршувањето на кампањата, од сите организатори на активност ќе се побара да дадат извештај за тоа колку учесници вклучиле. Ако сте биле успешни во достигнувањето на прагот, вие и колегите кои биле дел од вашата мрежа ќе добиете Сертификат за извонредност!'
        ]
    ],
    'why' => [
        'title' => 'Зошто да се придружите на предизвикот?',
        '1' => 'За да ја споделите пораката за важноста на кодирањето.',
        '2' => 'За да видите голем број на вклучени ученици.',
        '3' => 'За да изградите врски со организации и/или училишта во вашата заедница или на меѓународно ниво.',
        '4' => 'За да најдете поддршка од други организатори и наставници.',
        '5' => 'За да стекнете <strong>Сертификат за извонредност.</strong>'
    ]

];
