<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Прашања',
    'material' => [
        'required' => 'Потребен материјал',
        'chequered' => 'шаховска табла',
        'footprint' => 'плочки со слики од стапалки',
    ],
    'intro' => [
        'title' => 'Вовед во „Кодирање од дома“',
    ],
    'explorer' => [
        'title' => 'Истражувачот',
        'text' => '„Истражувачот“ е првата активност во „Кодирање од дома“. Придвижете го истражувачот по таблата за да стигне до целта при што ќе посети колку што може повеќе квадратчиња. ',
        'questions' => [
            'content' => [
                1 => 'П1. Со почетната и крајната позиција што се прикажани на видеото, дали е можно истражувачот да ги посети сите полиња на таблата?',
                2 => 'П2. Кои почетни и крајни позиции го спречуваат истражувачот да посети најмногу полиња на таблата?',
            ],

        ],

    ],

    'right-and-left' => [
        'title' => 'Десно и лево',
        'text' => '„Десно и лево“ е натпреварувачка игра што бара соработка. Двата тима соработуваат за да направат патека кон целта, при што се натпреваруваат да искористат што е можно повеќе плочки од тие што им се доделени: жолтиот тим се обидува да вметне колку што може повеќе кривина налево, а црвениот тим се обидува да вметне колку што може повеќе кривина надесно.',
        'questions' => [
            'content' => [
                1 => 'П1. Со стартната и крајната позиција распоредени онака како што е прикажано во првата игра во видеото, дали е можно да победи еден од двата тима?',
                2 => 'П2. Со стартната и крајната позиција распоредени онака како што е прикажано во играта во којашто победи Ана, дали може да се добие реми?',
                3 => 'П3. Дали има стартни и крајни позиции кои се распоредени така што едниот тим е во предност?',
                4 => 'П4. Со оглед на распоредот на стартни и крајни позиции, дали може да се предвиди каква ќе биде разликата меѓу победникот и губитникот?',
            ],

        ],

    ],

    'keep-off-my-path' => [
        'title' => 'Тргни ми се од патот',
        'text' => '„Тргни ми се од патот“ е натпреварувачка игра со два тима. Тимовите почнуваат од спротивните краеви на таблата и прават патеки со цел да си го попречат патот. Тимот којшто ќе го спречи другиот тим да ја продолжи патеката победува.',
        'questions' => [
            'content' => [
                1 => 'П1. Дали има некои почетни точки со кои едниот тим би имал предност?',
                2 => 'П2. Дали може да има реми?',
                3 => 'П3. Дали играчот кој почнува прв има предност?',
                4 => 'П4. Дали има некоја несоборлива стратегија во играта што играчот кој почнува прв може да ја усвои за да биде сигурен дека никогаш нема да изгуби?',
            ],

        ],

    ],

    'tug-of-war' => [
        'title' => 'Борба',
        'text' => '„Борба“ е натпреварувачка игра што бара соработка. Почнувајќи од средината на долниот дел од таблата, два тима (жолт и црвен) соработуваат за да стигнат до горниот дел од таблата. Жолтиот тим се обидува да стигне до полињата лево, додека црвениот тим се обидува да стигне до полињата десно.',
        'questions' => [
            'content' => [
                1 => 'П1. Дали има стратегија што секогаш ќе води до победа?',
                2 => 'П2. Дали играчот кој почнува прв има предност?',
                3 => 'П3. Ако и двата играчи се подеднакво внимателни, дали играта секогаш завршува реми, т.е. во центарот?',
            ],

        ],

    ],

    'explorer-without-footprints' => [
        'title' => 'Истражувач без траги од стапки',
        'text' => 'Истражувачот оди по таблата од почетната точка до целта обидувајќи се да ги посети сите полиња. Како што оди, истражувачот остава стапалки во боја што му овозможуваат на роботот да ги следи чекорите толкувајќи ја бојата. Играта станува уште поинтересна кога истражувачот ќе ги избрише стапалките и ќе ги остави само боите. ',
        'material' => 'како и црвен, жолт и сив маркер (или пенкало)',
        'questions' => [
            'content' => [
                1 => 'П1. Која е разликата меѓу таблата полна со стапалки во боја и таа со бои но без стапалки?',
                2 => 'П2. Која табла нуди поголема слобода на движење при што важат истите правила на вртење како што покажуваат боите?',
                3 => 'П3. Дали има некои можни патеки на таблата со бои кои не се можни на таблата со стапалки во боја? ',
                4 => 'П4. Дали има некои можни патеки на таблата со стапалки во боја кои не се можни на таблата на која има само бои?',
            ],

        ],

    ],

    'walk-as-long-as-you-can' => [
        'title' => 'Оди сè додека можеш',
        'text' => 'Во оваа активност предизвикот е да се остане колку што е можно подолго време на таблата користејќи бои наместо стапки. Активноста станува потешка кога слободата на движење стане поголема',
        'coloured-cards' => 'картички во боја или црвени, жолти или сиви маркери',
        'questions' => [
            'content' => [
                1 => 'П1. Кога двете патеки се судираат и меѓусебно се блокираат?',
                2 => 'П2. Оваа игра е игра за двајца? Дали може да се игра со 3 или 4 играчи? Дали е потребно да ги менуваме правилата?',
            ],

        ],

    ],

    'ada-charles-roby' => [
        'title' => 'Aдa, Чарлс и Роби',
        'text' => 'Приказната за Ада Лавлејс и Чарлс Бебиџ е интересна. Тие ги осмислија и програмираа компијутерите сто години пред да бидат навистина измислени',
        'material' => 'глина за моделирање и краток молив',
        'questions' => [
            'content' => [
                1 => 'П1. Пробајте да замислите дека роботот што сте го направиле со глина за моделирање и молив може да се движи по таблата и да досегне која било позиција, а доколку е потребно, и да ја пронајде својата патека. Кои инструкции би користеле за да го програмирате?',
            ],

        ],

    ],

    'cody-and-roby' => [
        'title' => 'Коди и Роби',
        'text' => 'Ова е игра на играње улоги со програмерот Коди и роботот Роби. Видеото ги воведува картичките на „Коди Роби“, кои ќе ги користиме отсега натаму. Коди ќе ги користи овие картички за на Роби да му даде инструкции како да се движи по таблата',
        'material' => 'табла со полиња со ознаки, картички со инструкции (лево, десно, напред) и какви било бројачи кои ќе се поставуваат на таблата',
        'starter-kit' => '„ Коди Роби “ почетен комплет',
        'questions' => [
            'content' => [
                1 => 'П1. Каде Роби пристигнува ако, почнувајќи од позицијата C2 свртен кон југ, ја изврши последната низа инструкции прикажани во видеото?',
                2 => 'П2. Дали движењата кои Роби ги прави извршувајќи ја последната низа инструкции прикажани во видеото би можеле да се опишаат применувајќи ги инструкциите од „CodyFeet“ или „CodyColor“ на таблата?',
                3 => 'П3. Трите видови инструкции кои се воведени во видеото, претставени со зелени, црвени и жолти картички, претставуваат сет на инструкции кои Роби можат да го одведат каде било на таблата. Дали можете да смислите сет на инструкции кој ќе содржи помалку од 3 инструкции за да го направите истото?',
            ],

        ],

    ],

    'the-tourist' => [
        'title' => 'Туристот',
        'text' => 'Со „ Коди Роби“ картичките, тимовите се предизвикуваат еден со друг да ја најдат, колку што е можно побрзо, низата инструкции кои ќе го водат туристот до спомениците кои сака да ги посети на таблата',
        'material' => 'Поголемите картички може да бидат корисни за играње на под',
        'questions' => [
            'content' => [
                1 => 'П1. Која низа инструкции би го одвеле туристот до статуата на Рафаело во првиот пример прикажан во видеото?',
                2 => 'П2. Која низа инструкции би го одвеле туристот до кулите на Дукалната палата во вториот пример прикажан во видеото?',
                3 => 'П3. Дали можете да смислите забавен начин да направите некоја вежба секојпат кога еден од двата тима избере картичка за да ја додаде во програмата? Измислете некој начин земајќи ја во предвид штафетната трка прикажана во видеото',
            ],

        ],

    ],

    'material2' => [
        'chequered-with-labels' => 'карирана табла со етикети',
        'cards' => '24 картички ‘Оди напред’, 8 картички ‘Врти лево’ и 8 картички ‘Врти десно’',
        'larger-cards' => 'Поголеми картички се препорачуваат за верзијата на под',
        'video' => 'Исто така видеото објаснува како се игра без купот на картички',
        'pieces-of-paper' => '24 парчиња хартија се исто така потребни за да се стават на квадратите кои се веќе посетени',
        'card-alternative' => 'Како алтернатива на купот на CodyRoby картичките, може да ги користите иконите картички кои се достапни тука',
        'small-drawings' => 'Како надополнување може да се користат мали цртежи за разкажување на приказната. Тие кои се користени во видеото се наоѓаат тука',
        'rest-of-cards' => 'За преостанатото ги користиме картичките на CodyRoby, CodyFeet или CodyColour.',
    ],

    'catch-the-robot' => [
        'title' => 'Фати го роботот',
        'text' => '‘Фати го роботот’ е натпреварувачка игра на маса или на под. Играчот кој ќе го фати роботот на противничката екипа со преземање на нивниот квадрат победува. Случајноста на картичките за играње бара и двете екипи во континуитет да ги прилагодуваат нивните стратегии.',
        'questions' => [
            'content' => [
                1 => 'П1. Ако розовиот пиун Roby е во централниот квадрат C3 кон Север, а розовата екипа има 2 картички ‘Оди напред’, 2 картички ‘Врти лево’ и 1 картичка ‘Врти десно’, кон кои квадрати тој може да се движи?',
            ],

        ],

    ],

    'the-snake' => [
        'title' => 'Змијата',
        'text' => '‘Змијата’ е вид на пасијанс кој се игра со CodyRoby картички. Целта на играта е да се води змијата низ квадратите на таблата без да ја каснува опашката.',
        'questions' => [
            'content' => [
                1 => 'П1. Дали има почетни точки кои овозможуваат посетување на сите квадрати без да се каснува опашката на змијата?',
            ],

        ],

    ],

    'storytelling' => [
        'title' => 'Раскажување приказна',
        'text' => 'Денешната тема е разкажување приказна! Користете ги упатствата од CodyRoby, отисоците од ногата на CodyFeet, или боите на CodyColour, за упатување на пиуните низ таблата за да се разкажува приказна. Кажувајте разни делови на приказната низ таблата.',
        'questions' => [
            'content' => [
                1 => 'П1. Која алатка е најразноврсна за да се упати Roby да разкажува приказна?',
                2 => 'П2. Може ли да ги наредете деловите на приказната која сакате да ја кажувате на табла во позиции кои ќе го направат невозможно враќањето на истите места со CodyFeet?',
            ],

        ],

    ],

    'two-snakes' => [
        'title' => 'Две змии',
        'text' => 'Со помош на картите CodyRoby две змии се движат по таблата. Целта е да се блокира движењето на противникот. Основното правило е едноставно: не смее да се стапне на полето преку кое веќе преминала некоја змија. Победник е оној чијашто змија подолго ќе се движи слободно.',
        'material' => 'Карти CodyRoby, табла 5 × 5, две фигури и плочки (можат да се исечат од хартија) за покривање на поминатите полиња.',
        'questions' => [
            'content' => [
                1 => 'П1. Во првата ситуација прикажана во видеото, ако играчите не извлечат жолти карти („сврти се налево“), кои карти би било добро да ги добијат?',
            ],

        ],

    ],

    'round-trip' => [
        'title' => 'Повратно патување',
        'text' => 'Тимовите ги менуваат улогите наизменично. Првиот тим го програмира почетното патување, а вториот треба да го врати Роби на почетната точка. Изгледа лесно, но всушност не е, особено ако играте напамет без да го движите Роби...',
        'material' => 'Карти CodyRoby, табла 5 × 5, две фигури и плочки (можат да се исечат од хартија) за покривање на посетените полиња.',
        'questions' => [
            'content' => [
                1 => 'П1. Дали би можела програмата за враќање на Роби на почетната точка да биде пократка (да содржи помалку инструкции) од програмата за почетното патување?',
            ],

        ],

    ],

    'meeting-point' => [
        'title' => 'Место за средба',
        'text' => 'Сега ќе ги испланираме чекорите пред да почнеме со движење. Двата тима редат карти со инструкции за своите роботи, но роботите не почнуваат со движење додека еден од играчите не рече „Тргни!“. Во тој момент се запира со програмирање и се почнува со акција. Играчот кој викнал „Тргни!” победува само ако двата роботи се сретнат на исто поле по извршување на инструкциите што ги составил нивниот тим.',
        'material' => 'Карти CodyRoby, табла 5 × 5, две фигури.',
        'questions' => [
            'content' => [
                1 => 'П1. Ако мислите дека постои можност двата роботи никогаш да не се сретнат, измислете правила за сите можни ситуации.',
            ],

        ],

    ],

    'follow-the-music' => [
        'title' => 'Следи ја музиката',
        'text' => 'Кога секвенците со инструкции за програмирање периодично се повторуваат, можеме да забележиме ритам. Ако на секоја инструкција и доделиме одреден звук, ќе можеме да го движиме Роби со музика. Точно тоа и ќе го правиме овој пат. Ќе составам програма од звуци коишто ќе претставуваат различни инструкции, а вие ќе треба да го движите Роби по таблата според звучните инструкции.',
        'material' => 'Карти CodyRoby, табла, фигура и предмети за правење три различни звуци. Јас користев три чаши наполнети со различна количина вода, а вие?',
        'questions' => [
            'content' => [
                1 => 'П1. При гледање на видеото обидете се само да ги слушате звуците што ги прават чашите без да ги гледате картите. Можете ли да ги препознаете и извршите звучните инструкции?',
                2 => 'П2. Одберете по еден звук за секоја од трите основни инструкции. Составете секвенца од звуци којашто можете бескрајно да ја повторувате без да го одведете Роби надвор од таблата...',
            ],

        ],

    ],

    'colour-everything' => [
        'title' => 'Обојте сé',
        'text' => 'Може ли да ги водиме роботите на таблата така што од трагите што ги оставаат да добиеме цртеж? Кај оваа активност си играме со кодирање пиксел-уметност, формирајќи слики преку боење на коцките на таблата, како пиксели на екран.',
        'material' => 'Карти CodyRoby, табла и пион. За боење на коцкичките користете парчиња хартија или обојте ги со маркери.',
        'questions' => [
            'content' => [
                1 => 'Можно ли е да се нацртаат двете срца како на крајот на видеото, насочувајќи го роботот на сите неопходни коцкички без двапати да поминете на исто место?',
            ],

        ],

    ],

    'codyplotter-and-codyprinter' => [
        'title' => 'Cody-плотер и Cody-печатач',
        'text' => 'Што е разликата меѓу плотер и печатач? Откријте играјќи ја оваа активност со кодирање.',
        'material' => 'покрај CodyRoby сетот, користев зелен маркер и нов робот од глина за моделирање, но тоа е по избор.',
        'questions' => [
            'content' => [
                1 => 'Можете ли да ја објасните разликата меѓу плотер и печатач?',
                2 => 'Каков дизајн ќе произведе Roby-печатачот движејќи се по линиите на таблата, доколку го следи редоследот на командите дадени на крајот на видеото?',
            ],

        ],

    ],

    'boring-pixels' => [
        'title' => 'Досадни пиксели!/Користење броеви',
        'text' => 'Со упатување на Roby да нацрта цртеж, коцкичка по коцкичка, пиксел по пиксел, откриваме дека кога многу коцкички по ред имаат иста боја, можеме да користиме и броеви за да го направиме поинтересно. Истото го прават и компјутерите...',
        'material' => 'тетратка со коцки, или табла 5 × 5 нацртана на хартија со пенкало. За претставување на кодот на цртањето, може да користите пенкало и хартија.',
        'questions' => [
            'content' => [
                1 => 'Обидете се да направите табла-дизајн и преставете со RLE-шифрирање. Големината на дизајнот е еднаква на бројот на коцкичките, но која е големината на RLE-презентацијата?',
            ],

        ],

    ],

    'turning-code-into-pictures' => [
        'title' => 'Претворање на кодот во цртежи',
        'text' => [
            1 => 'Сега видовме дека можеме да создадеме код кој ни овозможува да нацртаме цртеж. Помислив на цртеж и употребив код за да претворам во букви и бројки, коишто ви ги дадов. Забележете ги буквите и броевите и користете го кодот за да го реконструирате цртежот.',
            2 => 'Ова е сликата на којашто помислив, нека се појави во вашата тетратка и во тетратките на сите оние кои го знаат кодот!',
        ],
        'material' => 'хартија (пожелно со коцки) и пенкало.',
        'questions' => [
            'content' => [
                1 => 'Обидете се да го декодирате и нацртајте ги цртежите што ги споменувам на крајот на видеото.',
            ],

        ],

    ],

    'texts' => [
        1 => '„Кодирање од дома“ е збирка кратки видеа со материјали за самостојна работа, сложувалки, интерактивни игри и предизвици за кодирање за секојдневна употреба во семејството и на училиште. Не ви се потребни никакви претходни знаења за кодирање и не ви требаат никакви електронски уреди за да ги работите активностите. Со активностите ќе се стимулира компјутерско размислување и ќе се негуваат вештините на учениците, родителите и наставниците дома или на училиште.',
        2 => 'Серијата „Кодирање од дома“ на Европската недела на кодирање се надоврзува на иницијативата  <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">„Кодирање во семејството”</a> од Универзитетот во Урбино и Асоцијацијата CodeMOOCnet во соработка со Rai Cultura. Активностите ги презентира Алесандро Бољоло, кој е професор по системи за обработка на информации при Универзитетот во Урбино,  <a href="/ambassadors?country_iso=IT" target="_blank">Амбасадор на Европската недела на кодирање во Италија</a> и координатор на сите амбасадори, како и член на Органот на управување на Коалицијата за дигитални вештини и работни места. ',
        3 => 'Ако сте заинтересирани за повеќе активности за кои не е потребен уред или активности во различни програмски јазици, роботика, микробит, итн., проверете ги <a href="/training">Модулите на Европската недела на кодирање</a> со видеа и наставни планови за основни и средни училишта. Исто така, погледнете ја страницата со ресурси за <a href="/resources/learn">ученици</a> и <a href="/resources/teach">наставници</a> на Европската недела на кодирање.',
    ],
];
