<?php

return [

    'title' => 'Coding@Home',
    'questions' => 'Прашања',
    'material' => [
        "required" => "Потребен материјал",
        "chequered" => "шаховска табла",
        "footprint" => "плочки со слики од стапалки"
    ],
    'intro' => [
        'title' => 'Вовед во „Кодирање од дома“',
    ],
    'explorer' => [
        'title' => 'Истражувачот',
        'text' => '„Истражувачот“ е првата активност во „Кодирање од дома“. Придвижете го истражувачот по таблата за да стигне до целта при што ќе посети колку што може повеќе квадратчиња. ',
        'questions' => [
            'content' =>
                [
                    1 => 'П1. Со почетната и крајната позиција што се прикажани на видеото, дали е можно истражувачот да ги посети сите полиња на таблата?',
                    2 => 'П2. Кои почетни и крајни позиции го спречуваат истражувачот да посети најмногу полиња на таблата?'
                ]

        ]

    ],

    'right-and-left' => [
        'title' => 'Десно и лево',
        'text' => '„Десно и лево“ е натпреварувачка игра што бара соработка. Двата тима соработуваат за да направат патека кон целта, при што се натпреваруваат да искористат што е можно повеќе плочки од тие што им се доделени: жолтиот тим се обидува да вметне колку што може повеќе кривина налево, а црвениот тим се обидува да вметне колку што може повеќе кривина надесно.',
        'questions' => [
            'content' =>
                [
                    1 => 'П1. Со стартната и крајната позиција распоредени онака како што е прикажано во првата игра во видеото, дали е можно да победи еден од двата тима?',
                    2 => 'П2. Со стартната и крајната позиција распоредени онака како што е прикажано во играта во којашто победи Ана, дали може да се добие реми?',
                    3 => 'П3. Дали има стартни и крајни позиции кои се распоредени така што едниот тим е во предност?',
                    4 => 'П4. Со оглед на распоредот на стартни и крајни позиции, дали може да се предвиди каква ќе биде разликата меѓу победникот и губитникот?'
                ]

        ]

    ],


    'keep-off-my-path' => [
        'title' => 'Тргни ми се од патот',
        'text' => '„Тргни ми се од патот“ е натпреварувачка игра со два тима. Тимовите почнуваат од спротивните краеви на таблата и прават патеки со цел да си го попречат патот. Тимот којшто ќе го спречи другиот тим да ја продолжи патеката победува.',
        'questions' => [
            'content' =>
                [
                    1 => 'П1. Дали има некои почетни точки со кои едниот тим би имал предност?',
                    2 => 'П2. Дали може да има реми?',
                    3 => 'П3. Дали играчот кој почнува прв има предност?',
                    4 => 'П4. Дали има некоја несоборлива стратегија во играта што играчот кој почнува прв може да ја усвои за да биде сигурен дека никогаш нема да изгуби?'
                ]

        ]

    ],

    'tug-of-war' => [
        'title' => 'Борба',
        'text' => '„Борба“ е натпреварувачка игра што бара соработка. Почнувајќи од средината на долниот дел од таблата, два тима (жолт и црвен) соработуваат за да стигнат до горниот дел од таблата. Жолтиот тим се обидува да стигне до полињата лево, додека црвениот тим се обидува да стигне до полињата десно.',
        'questions' => [
            'content' =>
                [
                    1 => 'П1. Дали има стратегија што секогаш ќе води до победа?',
                    2 => 'П2. Дали играчот кој почнува прв има предност?',
                    3 => 'П3. Ако и двата играчи се подеднакво внимателни, дали играта секогаш завршува реми, т.е. во центарот?',
                ]

        ]

    ],

    'explorer-without-footprints' => [
        'title' => 'Истражувачот',
        'text' => 'Истражувачот оди по таблата од почетната точка до целта обидувајќи се да ги посети сите полиња. Како што оди, истражувачот остава стапалки во боја што му овозможуваат на роботот да ги следи чекорите толкувајќи ја бојата. Играта станува уште поинтересна кога истражувачот ќе ги избрише стапалките и ќе ги остави само боите. ',
        'material' => 'како и црвен, жолт и сив маркер (или пенкало)',
        'questions' => [
            'content' =>
                [
                    1 => 'П1. Која е разликата меѓу таблата полна со стапалки во боја и таа со бои но без стапалки?',
                    2 => 'П2. Која табла нуди поголема слобода на движење при што важат истите правила на вртење како што покажуваат боите?',
                    3 => 'П3. Дали има некои можни патеки на таблата со бои кои не се можни на таблата со стапалки во боја? ',
                    4 => 'П4. Дали има некои можни патеки на таблата со стапалки во боја кои не се можни на таблата на која има само бои?'
                ]

        ]

    ],

    'texts' => [
        1 => '„Кодирање од дома“ е збирка кратки видеа со материјали за самостојна работа, сложувалки, интерактивни игри и предизвици за кодирање за секојдневна употреба во семејството и на училиште. Не ви се потребни никакви претходни знаења за кодирање и не ви требаат никакви електронски уреди за да ги работите активностите. Со активностите ќе се стимулира компјутерско размислување и ќе се негуваат вештините на учениците, родителите и наставниците дома или на училиште.',
        2 => 'Серијата „Кодирање од дома“ на Европската недела на кодирање се надоврзува на иницијативата  <a href="https://www.raicultura.it/speciali/codinginfamiglia/" target="_blank">„Кодирање во семејството”</a> од Универзитетот во Урбино и Асоцијацијата CodeMOOCnet во соработка со Rai Cultura. Активностите ги презентира Алесандро Бољоло, кој е професор по системи за обработка на информации при Универзитетот во Урбино,  <a href="/ambassadors?country_iso=IT" target="_blank">Амбасадор на Европската недела на кодирање во Италија</a> и координатор на сите амбасадори, како и член на Органот на управување на Коалицијата за дигитални вештини и работни места. ',
        3 => 'Ако сте заинтересирани за повеќе активности за кои не е потребен уред или активности во различни програмски јазици, роботика, микробит, итн., проверете ги <a href="/training">Модулите на Европската недела на кодирање</a> со видеа и наставни планови за основни и средни училишта. Исто така, погледнете ја страницата со ресурси за <a href="/resources/learn">ученици</a> и <a href="/resources/teach">наставници</a> на Европската недела на кодирање.'
    ]
];