<?php

return [
    'titles' => [
        'Заедница',
        'Aмбасадори',
        'Главни наставници',
        'Еду координатори',
        'Волонтирајте за Европската недела на кодирање (EU Code Week)',
    ],
    'intro' => [
        'Европската недела на кодирање (EU Code Week) е успешна благодарение на огромната, меѓународна заедница на волонтери. На оваа страница можете да ги запознаете членовите кои се активни во вашата земја.',
        'Столбот на Европската недела на кодирање (EU Code Week) се амбасадорите, главните наставници и претставници на министерствата за образование во земјите на ЕУ и западен Балкан – координаторите на Еду.',
        'Дознајте повеќе за вашата локална заедница така што ќе ја изберете вашата земја:',
    ],
    'ambassadors' => 'Амбасадорите на Европската недела на кодирање (EU Code Week) се главната точка на контакт за Неделата на кодирање во секоја земја и помагаат во ширењето на визијата за Неделата на кодирање на локално ниво. Амбасадорите ги поврзуваат луѓето, компаниите и заедниците кои се заинтересирани за поддршка на Европската недела на кодирање (EU Code Week). Тие ги охрабруваат организаторите да ги регистрираат активностите за кодирање на мапата на Неделата на кодирање и да го промовираат целокупното учество на Европската недела на кодирање (EU Code Week). Исто така, амбасадорите ги разгледуваат и одобруваат активностите во нивната земја. Покрај тоа, амбасадорите работат со своите колеги во други земји и редовно се среќаваат за да разговараат за тоа како понатаму да ја развиваат иницијативата.',
    'leading-teachers' => 'Главните наставници претставуваат активна заедница со повеќе од 450 едукатори од цела Европа. Тие помагаат да се поврзат училиштата, наставниците и учениците кои се заинтересирани да учествуваат во Неделата на кодирање и ги охрабруваат да организираат активности и да ги регистрираат на мапата на Неделата на кодирање. Главните наставници одржуваат вебинари за професионален развој на нивниот јазик и се референтна точка за другите наставници во земјата, но исто така и во Европа. Тие исто така ја промовираат иницијативата локално.',
    'cta' => 'Доколку сте наставник, на мапата можете да најдете Главни наставници во ваша близина со кои ќе се поврзете.',
    'edu' => 'Еду координаторите на Европската недела на кодирање (EU Code Week) се кореспонденти во Министерствата за образование или други образовни органи и организации кои учествуваат во Европската недела на кодирање (EU Code Week). Еду координаторите ги зајакнуваат основите на иницијативата преку пружање поддршка на наставниците и училиштата ширум земјата. Ова вклучува комуникација со училиштата кои веќе учествуваат во Европската недела на кодирање (EU Code Week) за да дознаат за нивните најдобри пракси и да го споделат искуството. Еду координаторите исто така ги поддржуваат училиштата кои сакаат да учествуваат во иницијативата, преку обезбедување на расположиви ресурси, материјал за учење и можности во рамките на заедницата.',
    'volunteer' => [
        'Не треба да заземате официјална улога во заедницата на Европската недела на кодирање (EU Code Week) за да бидете дел од движењето. Секој може да организира активности за да ги научи и инспирира луѓето да кодираат, да се занимаваат со роботика, да работат со хардвер, 3Д-печатење, итн. и да ја прикачат својата активност',
        'на мапата',
        'Меѓутоа, ако сакате доброволно да одвоите од своето време за да промовирате кодирање и ако верувате во',
        'визијата',
        'и',
        'вредностите',
        'на Европската недела на кодирање, потенцијално би можеле да станете главен наставник или амбасадор.',
        'Доколку сте едукатор кој е страствен во врска со предавањето и учењето за тоа како се кодира, онолку колку што сме и ние, можете да дознаете повеќе за улогата и придобивките на Главните наставници',
        'овде',
        'Потоа можете да аплицирате за да станете Главен наставник пополнувајќи го на овој',
        'формулар за онлајн пријавување.',
        'Ве молиме да имате предвид дека бројот на Главни наставници по земја е фиксен, што значи дека апликациите се отворени само за некои специфични земји во одреден момент',
        'IАко сакате да промовирате кодирање во вашата земја, проверете ги',
        'одговорностите на амбасадорите',
        'и брзо погледнете го списокот на амбасадори на Европската недела на кодирање',
        'Доколку има амбасадори во вашата земја, ве молиме да стапите во контакт директно со нив и да видите како најдобро можете да ја поддржите иницијативата. Доколку нема никој во вашата земја, можете да контактирате на info@codeweek.eu.',
    ],
    'slider_info' => 'Жива мрежа на едукатори, волонтери и амбасадори кои ја придвижуваат EU Code Week напред. Поврзете се, соработувајте и инспирирајте ја следната генерација дигитални иноватори во вашата земја — и пошироко.',
];
