<?php


return [
    'title' => 'Известување за авторски права',
    'training' => [
        0 => 'Веб-страницата на Европската недела за кодирање за училишта',
        1 => 'е услуга поддржана од Европската Комисија'
    ],
    'licence' => [
        0 => 'Освен во случаите кога не е експлицитно наведено поинаку, содржините на оваа веб-страница се',
        1 => 'https://creativecommons.org/licenses/by-nc-sa/4.0/deed.en',
        2 => 'лиценцирани според лиценцата на Криејтив Комонс Наведи извор – Некомерцијално – СподелиПодИстиУслови 4.0 Меѓународен'
    ],
    'creative-commons' => 'Лиценцирањето според лиценците Криејтив Комонс само по себе не влијае на сопственоста на авторското право',
    'third-party' => 'Содржината од други веб-страници подлежи на нивни сопствени ограничувања на авторските права. Ве молиме посетете ја оригиналната страницата за повеќе информации'


];




