<?php

return [
    'common' => [
        'resources' => 'Потребни ресурси',
        'soundtrack' => 'Саундтрек Недела на Кодирање ',
        'moves' => 'Движења',
        'dance-example' => 'Еден пример од Танцот на Неделата на Кодирање',
        'organizer-guide' => 'Водич за организаторот',
    ],
    'title' => [
        'EU Code Week',
        'Издание на 2020 година ',
    ],

    'intro' => 'Ова година го прославуваме кодирањето од 10 до 25 октомври 2020 година! Како последица на моменталната здраствена ситуација, ова година активностите на Неделата на Кодирањето ќе ги реализираме онлајн. Ќе лансираме нови забавни и интересни активности во кои може да се приклучите од дома или од училиште',
    'online-activities' => [
        'title' => 'Истакнати отворени онлајн активности',
        'subtitle' => [
            'За да биде полесно учеството од далечина во активностите на Неделата на Кодирање ние лансираме ',
            'календар',
            'на истакнати онлајн активности',
        ],
        'section1' => [
            'title' => 'Што претставува една онлајн активност ?',
            'content' => 'Онлајн активност може да биде било која активност која типично ќе  ја додадете или регистрирате на вебстраницата на Неделата на Кодирање– единствената разлика е тоа што ќе се случува онлајн. Идејата е да биде полесно за луѓето да учествуваваат во сесиите и работилниците на кодирање целосно онлјан без да се ризикува нивното здраство ',
        ],
        'section2' => [
            'title' => ' Истакнати отворени активности ',
            'content' => 'Ако сакате, вашите онлајн активности може да бидат достапни за сите. Луѓето од целиот свет ќе можат да учествуваат на отворените онлајн активности, било на англиски јазик или на локален јазик.  Ќе ги избереме највозбудливите онлајн активности кои се отворени и ќе ги истакнеме во календарот на настани на нашата вебстраница',
        ],
        'section3' => [
            'title' => 'Што значи ова за учесниците',
            'content' => [
                'Секој ден на Неделата на Кодирање, ќе можете да го пребарувате',
                'календарот',
                'и да учествувате во активности кои најмногу ве интересираат. Темите на овие истакнати настани се разликуваат од работилниците за роботика, курсевите за е-учење, вебинарите за туторство за кодирање и многу други. Така, направете го вашиот избор',
            ],
        ],
    ],

    'dance' => [
        'title' => '',
        'subtitle' => 'Кој рече дека програмерите не знаат да танцуваат? За прославувањето на изданието во 2020 година на Неделата на Кодирање, ние лансираме нова активност  - #Предизвикот CodeWeekDance',
        'section1' => [
            'title' => 'Кој може да се приклучи?',
            'content' => [
                'Секој од училиштата, библиотеките па до клубовите за кодирање, бизнисите и јавните авторитети  се покануваат да ја прославуваат Неделата на Кодирање на ЕУ во 2020 година со организирање на  #активноста CodeWeekDance и додајќи го тоа на',
                'мапата на Неделата на Кодирање',
            ],
        ],
        'section2' => [
            'title' => 'Како да се учествува?',
            'content' => 'Изберете од петте видови на активностите или излезете со ваша активност. Без обзир на тоа која актвиност ќе ја изберете, не заборавајте да ја додадете на нашата мапа',
        ],
        'activity1' => [
            'title' => 'Програмирајте пријател или родител – не  е потребен компјутер',
            'subtitle' => 'Кодирањето ви овозможува да давате команди на еден електронски уред. Но технички, не ви е потребен компјутер за да можете да кодирате. Наместо тоа, зграпчете партнер – може да биде соученик, пријател, родител или дури и наставник, и дадете му упатства како да перформираат #EUCodeWeekDance, кои треба да го следаат прецизно',
            'resources' => [
                'Упатство од  Code.org за организирање на неповрзана (со интернет) забава за танцување',
                'Малку учење како да го програмирате вашиот човек-робот',

            ],
        ],

        'activity2' => [
            'title' => 'Визуелно програмирање',
            'subtitle' => 'Кодирајте го вашиот Танц на Неделата на Кодирање во скреч (Scratch). Користете ги ликовите на Неделата на Кодирање или направете ваши во Scratch и програмирајте ги нив за да го направите  #EUCodeWeekDancе (танцот на неделата на кодирање).',
            'resources' => [
                'Еден пример од проектот #EUCodeWeekDance на скреч ',
                'Упатство како да направите ремикс на Танцот на Неделата на Кодирање во Scratch',
                'Ликовите на Неделата на Кодирање',
                'Упатство од Code.org како да се анимира еден лик ',
                'Упатство од Code.org за организирање на вашата Забава за Танцување',
                'Споделете го вашиот проект со нас во ова студио за Scratch',
            ],
        ], 'activity3' => [
            'title' => 'Програмирање со текст',
            'subtitle' => 'Направете тема за #EUCodeWeekDance со Python или JavaScript, користејќи платформи со кодови за креирање на музика како што е EarSketch или Sonic Pi',
            'resources' => [
                'Туторство како да де направи музика со EarSketch',
                'Туторство како да се креира музика со Sonic Pi',

            ],
        ],
        'activity4' => [
            'title' => 'Роботика',
            'subtitle' => 'Програмирајте го вашиот робот да ги следи упатствата и да перформира Танцот на Неделата на Кодирање ',
            'resources' => [
                'Туторство за програмирање роботи',
            ],
        ], 'activity5' => [
            'title' => 'Предизвикот за танцување во живо',
            'subtitle' => 'Сниметете се самите себеси, вашата екипа или вашиот робот перформирајќи танцување #EUCodeWeekDance, споделете го на инстаграм и обидете се да станете вирален и да добиете воодушевувања на Неделата на Кодирање? Следете ги овие чекори:',
            'resources' => [
                'Снимете го видеото користејќи настани во инстаграм (Instagram Stories)',
                'Следи',
                '@CodeWeekEU на Инстаграм',
                'Спомнетего  @CodeWeekEU во вашиот настан со танцувањето и осигурете се да го користете хаштагот #EUCodeWeekDance',
            ],
        ],
        'outro' => [
            'Победниците ќе бидат избрани секој ден и ќе објавуваат на нашиот Инстрагам канал преку настани  (Stories), така не заборавете да ги проверите редовно известувањата, можеби денеска ќе имате среќа',
            ' #EUCodeWeekDance е базиран на',
            'Ода на кодирање (Ode to Code)',
            'композирано од Брендан Паолини, и танцувањето развиено од Бианка Мариа Берарди во 2015 година, од идејата на Алесандро Боглиоло, професор по компјутерски системи во универзитетот во Урбино',
        ],

    ],
    'treasure-hunt' => [
        'title' => 'Потрага по богатство на Неделата на Кодирање',
        'subtitle' => [
            'Тоа е игра на Telegram која е доста едноставна за почетниците, но исто така ги предизвикува и искусните учесници да бидат внимателни',
            ' Потрага по богатство на Неделата на Кодирање ',
            'е игра која најдобро се игра на вашиот компјутер со мобилниот телефон на рака. Играта ќе побара од вас да решите предизвици за кодирање и ќе ве упати низ историјата на кодирањето, компјутерската наука и технологија во Европа ',
        ],
        'section' => [
            'title' => 'За да почнете да играте треба да',
            'content' => [
                'ја симнете апликацијата Телеграм (Telegram). Која е достапна за',
                'Десктоп компјутер',
                'Можете да играте било на вашиот компјутер или лаптоп, или на вашиот смарт телефон. Ви препорачуваме да играте не компјутер за да ги добиете упатствата и да ги решите предизвиците на кодирање на апликацијата Telegram на вашиот телефон',
                'За да играте',
                'отворете ја играта',
                'и скенирајте го QR кодот (баркодот)  кој ќе ве носи на апликацијата Telegram и ќе ви го дадед првиор сет на упатства',
                'За да победите, треба да решите 10 предизвици за кодирање и да најдете 10 локации на мапата на Европа кои се поврзани со развојот на кодирањето и технологијата',
                'Откако ќе ја завршите играта, споделете го вашиот резултат со пријателите користејќи го #EUCodeWeek и предизвикувајте ги нив да играат и научат и за историјата на кодирањето. Да видиме кој ќе бележи најдобри резултати ',
                ' Потрагата по богатство на Неделата на Кодирање е виртуална верзија за година на оригиналната Потрага по богатство на Неделата на Кодирање на ЕУ која за прв пат било развиено од Алесандро Боглиоло, професор по компјутерски системи во универзитетот во Урбино. За да дознавате повеќе за неговата оригинална игра, посетете го нашиот ',
                'блог',

            ],
        ],
    ],
    'kick-off' => [
        'title' => 'Почетниот настан: 8 октомври 2020 година',
        'content' => [
            'Виртуалниот почеток на Неделата на Кодирање за 2020 година ќе се случи на 8 октомври во 17 часот според времето  на Берлин/Брисел/Париз. Овој настан ќе се прикажува во живо на  Facebook Live, Instagram TV и YouTube Live',
            'Нашата возбудлива постава вклучува гости говорници',
            'EУ комисионерот за Внатрешниот пазар',
            'EУ комисионерот за Иновации, Истражување, Култура, Образование и Млади',
            'Креаторот на Scratch и професорот по Истражување во учењето во лабораторијата MIT Media Lab',
            'авторот и илустраторот на Hello Ruby',
            'и',
            'Претседателот на француската непрофитна организација E-MMA која промовира родова разнодивидност во технологијата',
            'Ако ова не е доволно, екипата на Неделата на Кодирање исто така ќе изложува нови карактеристики на вебстраницата, ресурсите и предизвиците',
            'Професорот по компјутерски системи во универзитетот во Урбино и координатор на ',
            'амбасадорите на Неделата на Кодирање',
            'ќе ви каже повеќе за Виртуелната Потрага по Богатство на Неделата на Кодирање',
            'а xxx ќе ви даде главни насоки за предизвикот #EUCodeWeekDance ',
            'Исто така ќе се поврзуваме со училиштата и учениците од цела Европа кои ќе ги споделат нивните настани за кодирање и ќе разменуваат идеи со гостите говорници',
            'Исто така ќе имате можност да споделите ваши мислења, идеи и да поставувате прашања. Се што треба да направите е да се приклучите на нашиот пренос во живо',
            'или',
            'на 8 октомври 2020 година во 17:00-18.30 CET и да коментирате или да твитирате со хаштагот #EUCodeWeek',
        ],
    ],
    'get-involved' => [
        'title' => 'Како да де приклучите',
        'subtitle' => 'Не можете да чекате да почнете со кодирање? Ако сакате да се придружите на заедницата на Неделата на Кодирање на ЕУ но не знаете каде да почнете, погледнете ги ресурсире за прославата на годишнината кои ќе ви помогнат да започнете, навреме за нашата прослава за годишнината во октомври',
        'content' => [
            'Започнете со Неделата на Кодирање',
            'Како да додадете атктивност на Неделата на Кодирање',
            'Малку учење',
            'Масивен отворен онлајн курс за Длабоко нуркање (Deep Dive)',
            'Сериите Кодирање Дома (Coding@Home)',
        ]]];
