<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'title' => 'Уредете го вашиот #codeEU настан',
    'required_fields' => 'Потребните полиња се означени со * ѕвездичка. Слободно додадете список на настани на вашиот локален јазик.',
    'description' => 'Опис',
    'audience' => 'Публика',
    'theme' => 'Тема',
    'location' => 'Локација',
    'website' => 'Веб-страница',
    'contact' => 'Контакт',
    'tags' => 'Ознаки',
    'image' => 'Слика',
    'help' => 'Поголемите слики ќе бидат намалени на 256 x 512 пиксели. Максимална големина на поставување е 256 x 1024.',
    'aspect' => 'Кој аспект на кодирање ќе го покрива вашиот настан?',
    'address' => 'Напишете адреса или кликнете на мапата подолу да поставите локација.',
    'privacy_disclaimer' => [
        'header' => 'Ваши информации за контакт',
        'text_1' => 'Оваа информација ќе биде видлива само за ',
        'link_1' => 'Амбасадорите на Европската недела на кодирање',
        'text_2'=> ' и организаторите на
        Неделата на кодирање, кои
        ќе го проверат вашиот настан пред да се појави на мапата и може да ве контактираат ако се потребни
        уредувања или
        за администрирање на анкети за статистички цели по настанот.',
        'contact_email' => 'Ваша адреса за е-пошта за контакт'
    ], 
    'edit' => 'Уреди настан'
];
