<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'main_title' => 'Додадете го вашиот #EUCodeWeek настан',
    'button' => 'Додадете Настан',
    'howto' => 'Како да го организирате вашиот сопствен настан',
    'required' => 'Потребните полиња се означени со * ѕвездичка. Слободно додадете список на настани на локалниот јазик.',
    'audience_title' => 'Публика',
    'theme_title' => 'Тема',
    'scoreboard_by_country' => 'табла со резултати',
    'get_involved' => 'Вклучете се',
    'organize_or_support_events' => 'Организирајте или поддржете настани во вашиот град',
    'or_contact_your' => 'или контактирајте со',
    'eu_code_week_ambassadors' => 'Амбасадорите на Европската недела на кодирање',
    'show_events_for' => 'Покажи настани за ',
    'who' => 'За кого е настанот?',
    'tags' => 'Ознаки',
    'image' => 'Слика',
    'start' => [
        'label' => 'Датум на почеток',
        'placeholder' => 'Кога започнува активноста?',
    ],
    'end' => [
        'label' => 'Датум на завршување',
        'placeholder' => 'Кога завршува активноста?',
    ],
    'organizer' => [
        'label' => 'Име на организација',
        'placeholder' => 'Организација во која работите или волонтирате',
    ],
    'website' => [
        'label' => 'Веб-страница на организаторот(-ите)',
        'placeholder' => 'Дали имате веб-локација со повеќе информации ?',
    ],
    'description' => [
        'label' => 'Опис',
        'placeholder' => 'Кратко опишете ја планираната активност.',
    ],
    'contact' => [
        'label' => 'Е-пошта за контакт',
        'placeholder' => 'Оваа е-пошта ќе се користи за важна коресподенција за Европската недела на кодирање',
        'explanation' => 'Вашата е-пошта за контакт ќе биде видлива само за Амбасадорите на Европската недела на кодирање и за организаторите на Неделата на кодирање, кои ќе го проверат вашиот настан пред да се појави на мапата и може да контактираат со вас ако се потребни уредувања или за администрирање на анкети за статистички цели по настанот.',
    ],
    'public' => [
        'label' => 'Јавна е-пошта',
        'placeholder' => 'Сакате да ја прикажете е-поштата за контакт?',

    ],
    'title' => [
        'label' => 'Наслов на активност',
        'placeholder' => 'Кое е името на активноста?',
    ],
    'address' => [
        'label' => 'Адреса',
        'placeholder' => 'Каде ќе се одржува активноста?',
    ],

    'organizertype' => [
        'label' => 'Тип на организација',
        'placeholder' => 'Изберете тип на организатор',
        'school' => 'Училиште',
        'library' => 'Библиотека',
        'non profit' => 'Непрофитна организација',
        'private business' => 'Приватен бизнис',
        'other' => 'Друго',
    ],
    'audience' => [
        'Pre-school children' => 'Претшколски деца',
        'Elementary school students' => 'Ученици од основно училиште',
        'High school students' => 'Ученици од средно училиште',
        'Graduate students' => 'Дипломирани студенти',
        'Post graduate students' => 'Студенти на постдипломски студии',
        'Employed adults' => 'Вработени возрасни',
        'Unemployed adults' => 'Невработени возрасни',
        'Other (see description)' => 'Друго (види опис)',
        'Teachers' => 'Наставници',
    ],
    'theme' => [
        'AI & Generative AI' => 'Вештачка интелигенција и генеративна AI',
        'Robotics, Drones & Smart Devices' => 'Роботика, дронови и паметни уреди',
        'Web, App & Software Development' => 'Веб, апликации и софтверски развој',
        'Game Design' => 'Дизајн на игри',
        'Cybersecurity & Data' => 'Кибер-безбедност и податоци',
        'Visual/Block Programming' => 'Визуелно/блок програмирање',
        'Art & Creative Coding' => 'Уметност и креативно кодирање',
        'Internet of Things & Wearables' => 'Интернет на нештата и носливи уреди',
        'AR, VR & 3D Technologies' => 'AR, VR и 3D технологии',
        'Digital Careers & Learning Pathways' => 'Дигитални кариери и патишта за учење',
        'Digital Literacy & Soft Skills' => 'Дигитална писменост и меки вештини',
        'Unplugged & Playful Activities' => 'Активности без технологија и преку игра',
        'Promoting Diversity & Inclusion' => 'Промовирање на разновидност и инклузија',
        'Awareness & Inspiration' => 'Подигнување на свеста и инспирација',
        'Other' => 'Друго',
    ],
    'codeweek_for_all_participation_code' => [
        'title' => 'КОД ЗА CODE WEEK 4 ALL ',
        'explanation' => 'Ако сте добиле код за Code Week 4 all од колега од училиште или пријател, тогаш залепете го овде, а во спротивно оставете го полето празно. Достапни се повеќе информации за Code Week 4 All',
        'link' => 'тука',
    ],
    'thanks_page' => [
        'title' => 'Ви благодариме што го додадовте вашиот настан!',
        'phrase1' => 'Еден од нашите локални амбасадори сега ќе го прегледа вашиот настан',
        'phrase2' => 'за да се увери дека се изгледа во ред.',
        'phrase3' => 'Ако имате некакви прашања, обратете се кај еден од нашите',
        'phrase4' => 'национални амбасадори',
        'phrase5' => 'или испратете ни',
        'phrase6' => 'е-порака',
        'phrase7' => 'Може да го споделите вашиот код за Недела на кодирање за сите со други луѓе:',
    ],
    'activitytype' => [
        'label' => 'Вид на активност',
        'placeholder' => '',
        'open-online' => 'Отворена онлајн активност',
        'invite-online' => 'Онлајн активност само со покана',
        'open-in-person' => 'Отворена активност во живо',
        'invite-in-person' => 'Активност во живо само со покана',

    ],
    'privacy' => 'Ги прочитав и ги прифатив условите за практиките за приватност опишани во овој документ.',
    'country' => 'Земја',
    'loading' => 'Вчитување...',
    'add_activity' => 'Додај активност',
    'edit_activity' => 'Уреди активност',
    'update_activity' => 'Ажурирај активност',
    'delete_activity' => 'Избриши активност',
    'total_pending_events' => 'Вкупно претстојни настани:',
    'no_pending_events' => 'Не е пронајден претстоен настан за',
    'all_countries' => 'Сите земји',
    'current_status' => 'Тековен статус',
    'actions' => 'Дејства',
    'certificate_ready' => 'Вашиот сертификат за неделата на кодирање е готов. Слободно преземете го или директно споделете го.',
    'view_your_certificate' => 'Погледнете го вашиот сертификат овде',
    'submit_event_and_report' => 'Поднесете извештај за овој настан и барајте го вашиот сертификат за неделата на кодирање.',
    'report_and_claim' => 'Известете за настан и побарајте сертификат',

];
