<?php

return [

    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Оживејте ги идеите!',
    'sections' => [
        1 => [
            'title' => '6 хакатони, 6 предизвици',
            'content' => [
                1 => 'Живеете во Летонија, Ирска, Италија, Романија, Словенија или Шпанија? Еве ви можност да ги искористите креативноста, љубопитноста, еланот и техничките вештини. Придружете се на еден од хакатонитена Европската недела на кодирање и развијте иновативно решение што ќе му помогне на општеството.',
                2 => 'Во 2020 година, Европската недела на кодирање организира шест исклучителни хакатони за шест земји на ЕУ и ги поканува средношколците од погорните класови (на возраст од 16 до 19 години) да ги употребат своите вештини за кодирање за 36 часа да изнајдат решенија за локален предизвик.'
            ]
        ],
        2 => [
            'title' => 'Како може да учествувам?',
            'content' => [
                1 => 'Изберете го хакатонот во вашата земја и следете неколку едноставни чекори за да се регистрирате. Ако сакате да се придружите со пријатели или соученици, не заборавајте да го наведете името на тимот. Секој хакатон ќе биде отворен за регистрација одделно.'
            ]
        ],
        3 => [
            'title' => 'Кои се организаторите?',
            'content' => [
                1 => 'Хакатоните во рамките на Европската недела на кодирање се во коорганизација на Европската комисија и локалните ',
                2 => 'амбасадори на неделата на кодирање',
                3 => ' на ЕУ, а ги финансира Европскиот парламент. Целта е да се покаже како се доаѓа до конкретни решенија со помош на креативноста, ентузијазмот, свежите идеи и вештините за кодирање на младите луѓе.'
            ]
        ],
        4 => [
            'title' => 'Како изгледа еден хакатон?',
            'content' => [
                1 => 'Секој хакатон ќе вклучи 60 средношколци што се натпреваруваат во тимови во рок од 36 часа. На крајот, секој тим ќе го презентира своето решение пред стручно жири. Тимовите ќе ги подучуваат искусни ментори и ќе има работилници што им нудат можности на учесниците да научат нови вештини и да се забавуваат. Хакатоните се исто така одлична можност за поврзување и социјализирање на учесниците со луѓето од локалниот технички сектор.',
                2 => 'Победничкиот тим од секој локален хакатон ќе добие разни награди, вклучувајќи ја и можноста да оди во Брисел и да го претстави своето решение пред меѓународна публика на 12 октомври 2020 година.',
            ]
        ],
        5 => [
            'title' => 'Не знам да кодирам - што можам да сторам околу тоа?',
            'content' => [
                1 => 'Паралелно со хакатонот, ќе има работилници за почетници за кодирање, обиди за поправање хардвер, роботика итн. за учесниците да стекнат основи на компјутерско размислување и кодирање. На локалната страница може да најдете повеќе информации во врска со начинот на регистрација.'
            ]
        ],

        6 => [
            'title' => 'Партнери',
        ],

    ],

    'cities' => [

        1 => [
            'city' => "",
            'country' => "Ирска",
            'date' => "април 2020"
        ],
        2 => [
            'city' => "",
            'country' => "Словенија",
            'date' => "мај 2020"
        ],
        3 => [
            'city' => "",
            'country' => "Романија",
            'date' => "мај 2020"
        ],
        4 => [
            'city' => "",
            'country' => "Шпанија",
            'date' => "јуни 2020"
        ],
        5 => [
            'city' => "",
            'country' => "Летонија",
            'date' => "септември 2020"
        ],
        6 => [
            'city' => "",
            'country' => "Италија",
            'date' => "септември 2020"
        ],
    ],


];
