<?php

return [
    'title' => 'EU Code Week HACKATONS',
    'subtitle' => 'Оживејте ги идеите!',
    'sections' => [
        1 => [
            'title' => '6 хакатони, 6 предизвици',
            'content' => [
                1 => 'Дали живееш во Грција, Латвија, Ирска, Италија, Романија или Словенија? Дали си креативна и амбициозна личност заинтересирана за иднината на технологијата? Сега е твојата шанса! Земи учество на „хакатоните“ во неделата на кодирање на ЕУ и развивај иновативни решенија со кои можеш да станеш предводник во технолошката револуција!',
                2 => 'Во 2021, EU Code Week (Неделата на кодирање на ЕУ) носи шест неверојатно хакатони, каде што се поканети сите ученици помеѓу 15 и 19-годишна возраст од средно образование да формираат тимови и да ги применат своите вештини на кодирање за да решат локален предизвик. По 24 часа хакирање, секој тим ќе ги понуди своите идеи пред панел од експерти од кои ќе бидат избрани 10-те финални тимови. За да го завршат предизвикот, сите тимови ќе добијат исто време, исти ресурси и ист пристап до ментори и експертски знаења, но само 10 тима ќе добијат шанса да продолжат кон следната рунда, да развијат свој прототип, да добијат експертска обука и да учествуваат во финалниот хакатон на есен. Таму, тимовите ќе се натпреваруваат за кул опрема од информатичката технологија, но и шанса да добијат менторство и обука за натамошен развој на нивниот прототип.',
            ],
        ],
        2 => [
            'title' => 'Како може да учествувам?',
            'content' => [
                1 => 'Избери хакатон во твојата земја и регистрирај се во неколку едноставни чекори. Учествувањето е можно и за поединци и за тимови, кои треба да бројат шест члена. Ако решиш да учествуваш како дел од тим составен од пријателите или соучениците, не заборавај да го наведеш името на тимот кога ќе се регистрирате. За секој ќе има посебна регистрација, затоа следи го хакатонот што ќе се одржува во твојата земја!',
            ],
        ],
        3 => [
            'title' => 'Кои се организаторите?',
            'content' => [
                1 => 'Хакатоните во рамките на Европската недела на кодирање се во коорганизација на Европската комисија и локалните ',
                2 => 'амбасадори на неделата на кодирање',
                3 => ' на ЕУ, а ги финансира Европскиот парламент. Целта е да се покаже како се доаѓа до конкретни решенија со помош на креативноста, ентузијазмот, свежите идеи и вештините за кодирање на младите луѓе.',
            ],
        ],
        4 => [
            'title' => 'Како изгледа еден хакатон?',
            'content' => [
                1 => 'EU Code Week Hackathon претставува патешествие, кое започнува со онлајн 24-часовен хакатон. Тимовите ќе бидат обучувани од искусни ментори, а ќе има и работилници каде учесниците ќе можат да научат нови вештини и да се забавуваат. Хакатонот е исто така одлична можност за учесниците да се вмрежат и социјализираат со луѓе од европскиот технички сектор. На крајот од хакатонот, секој тим ќе понуди свое решение пред експертско жири. ',
                2 => 'Најдобрите десет тимови ќе продолжат со своето хакатонско патешествие и ќе добијат обука и менторство низ летниот период. Потоа, победниците ќе учествуваат во финалниот 12-часовен национален хакатон, лице в лице, кој ќе се одржи во септември или октомври (онлајн, ако ситуацијата со јавното здравје и понатаму не дозволува физички средби).',
            ],
        ],
        5 => [
            'title' => 'Не знам да кодирам - што можам да сторам околу тоа?',
            'content' => [
                1 => 'Паралелно со хакатонот, ќе има работилници за почетници за кодирање, обиди за поправање хардвер, роботика итн. за учесниците да стекнат основи на компјутерско размислување и кодирање. На локалната страница може да најдете повеќе информации во врска со начинот на регистрација.',
            ],
        ],

        6 => [
            'title' => 'Партнери',
        ],
        7 => [
            'title' => 'Приклучи се на забавата!',
        ],
    ],

    'cities' => [
        1 => [
            'city' => '',
            'country' => 'Романија',
            'date' => '25-26 септември 2021',
        ],
        2 => [
            'city' => '',
            'country' => 'Ирска',
            'date' => '23-24 септември 2021',
        ],
        3 => [
            'city' => '',
            'country' => 'Италија',
            'date' => '24-25 септември 2021',
        ],
        4 => [
            'city' => '',
            'country' => 'Грција',
            'date' => '9 октомври 2021 год.',
        ],
        5 => [
            'city' => '',
            'country' => 'Словенија',
            'date' => '18-19 септември 2021',
        ],
        6 => [
            'city' => '',
            'country' => 'Латвија',
            'date' => '1 октомври 2021 год.',
        ],
    ],
    'final' => [
        1 => 'Финале во',
        2 => 'септември/октомври 2021 год.',
    ],
];
