<?php

return [
    'about' => 'Европската недела на кодирање е иницијатива на пошироко членство чија цел е да го приближи кодирањето и дигиталната писменост до секого на забавен и интересен начин.',
    'when' => 'Придружете ни се за празнична забава!',
    'when_text' => 'Учењето да кодираме ни помага да ја согледаме смислата на светот што рапидно се менува околу нас, да го прошириме разбирањето за тоа како функционира технологијата и да развиваме вештини и способности да истражуваме нови идеи и да иновираме.',
    'xmas_text' => 'Направете оваа празнична сезона да блесне со иновација и креативност! Придружете се на нашата \'Coding@Christmas\' забава додавајќи ја вашата активност за кодирање на нашата мапа и стекнете шанса да освоите micro:bit комплет за вашите ученици. Да ги прославиме празниците со зајакнување на следната генерација мислители и креатори. Додајте ја вашата активност денес и помогнете да инспирираме посветла иднина!',
    'button_text' => 'Get Involved!',
    'school_banner_title' => 'Вклучете се!',
    'school_banner_text' => 'Наставник сте?',
    'school_banner_text2' => 'Кликнете овде за да дознаете како да се вклучите!',
    'organize_activity_title' => 'Организирајте или придружете се на активност',
    'organize_activity_text' => 'Секој е добредојден да организира или да се придружи на активност. Само изберете тема и целна публика и <a href="/add">додаjте ваша активност</a> на <a href="/events">мапата</a> или пребарајте настани во вашата област.',
    'get_started_title' => 'Започнете',
    'get_started_text' => 'Не сте сигурни како да започнете? Погледнете на <a href="/guide">страницата како да</a>, преземете ги нашите <a href="/toolkits">комплети за организатори</a> за да се подготвите и да ги распространите вестите.',
    'access_resources_title' => 'Пристап до ресурси и обука',
    'access_resources_text' => 'Ако не сте сигурни како да организирате активност, посетете ја нашата <a href="/resources/teach">страница со ресурси за подучување</a> и <a href="/training">за обука за учење на делови</a> материјали за насочување и приспособени наставни планови.',
    'download_brochure_btn' => 'Преземи брошура 2025',
    'banner3_title' => 'Ви благодариме за учеството на Неделата на кодирање 2025',
];
