<?php

return [

    'about' => 'Европската недела на кодирање е иницијатива на пошироко членство чија цел е да го приближи кодирањето и дигиталната писменост до секого на забавен и интересен начин.',
    'when' => '5-20 октомври 2019 год.',
    'when_text' => 'Учењето да кодираме ни помага да ја согледаме смислата на светот што рапидно се менува околу нас, да го прошириме разбирањето за тоа како функционира технологијата и да развиваме вештини и способности да истражуваме нови идеи и да иновираме.',
    'school_banner_title' => 'Вклучете се!',
    'school_banner_text' => 'Наставник сте?',
    'school_banner_text2' => 'Кликнете овде за да дознаете како да се вклучите!'

];
