<?php

return [
    'free-online-courses' => 'Бесплатни онлајн курсеви',
    'intro' => 'Европската недела на кодирање нуди можности за професионален развој во форма на онлајн курсеви. Целта е да им се даде поддршка на наставниците за да можат да го воведат кодирањето и компјутерското размислување во наставата.',
    'icebreaker' => [
        'title' => 'Воведен курс',
        'text' => [
            0 => '',
            1 => 'Воведниот курс на Европската недела на кодирање',
            2 => 'е 5-часовен курс на англиски јазик кој е наменет за секој кого го интересираат основите на кодирањето и компјутерското размислување. Учесниците учат како да ја побудат љубопитноста и иновативниот дух кај младите лица, при што ги оспособуваат да станат дигитални креатори. Курсот им помага на учесниците да ги откријат придобивките и важноста на компјутерското размислување и кодирањето во секојдневниот живот. Исто така, дава идеи, бесплатни материјали за обука и ресурси за организирање забавни и едукативни активности за деца, во секое време, секаде – особено во текот на Неделата на кодирање.',
            3 => 'Не ви се потребни никакво претходно искуство или знаење од кодирање за да учествувате во курсот, потребен ви е само љубопитен ум.',

        ],
        'registration' => [
            0 => 'Може да се регистрирате тука',
            1 => 'за курсот што ќе трае од 16 септември до 30 октомври 2020 г. За да се регистрирате, треба да отворите сметка во Академијата на Европската училишна мрежа (European Schoolnet Academy). ',
        ],
        'check-out' => 'Проверете го изданието од 2019 година.',
    ],
    'deep-dive' => [
        'title' => 'Напреден курс',
        'text' => [
            0 => 'Напредниот онлајн курс на Европската недела на кодирање е 25-часовен курс на англиски јазик кој им нуди на наставниците можност да се запознаат со принципите на кодирањето и да се стекнат со знаења и самодоверба за да можат да организираат лесни и забавни интерактивни активности за кодирање за своите ученици. Наставниците имаат пристап до бесплатни',
            1 => 'ресурси',
            2 => 'од Европската недела на кодирање и материјали за обука на 29 јазици и одредени аспекти на кодирањето, како што се компјутерско размислување, активности „без уред“, и бескрајните можности што ги нудат роботиката, чепкањето и создавањето хардвер, јазиците за визуелно програмирање, создавањето апликации и многу повеќе.',
        ],
        'course-link' => 'Проверете го напредниот курс од 2019 година.',
    ],
    'social-media' => [
        0 => 'Следете ја',
        1 => 'Европската недела на кодирање на социјалните медиуми',
        2 => 'за да дознаете кога започнува следниот курс',
    ],

];
