<?php

return [

    'title' => 'Генерирајте сертификати за учество за вашиот клас',
    'phrase1' => 'Пополнете го формуларот со имињата на вашите ученици одделени со запирка и ќе добиете индивидуални сертификати за учество',
    'names' => [
        'label' => 'Имиња за сертификат',
        'help' => 'Користете запирка помеѓу името на секој учесник',
    ],
    'event_name' => [
        'label' => 'Име на активност',
        'help' => 'Името на вашата активност ќе се отпечати на сертификатот',
    ],
    'event_date' => [
        'label' => 'Датум на активност',
        'help' => 'Датумот на вашата активност ќе се отпечати на сертификатот',
    ],
    'submit' => 'Генерирај сертификати',
    'thanks_page' => [
        'title' => 'Вашите сертификати се генерирани',
        'phrase1' => 'Кликнете на оваа врска да преземете zip датотека со сите сертификати',

    ],

];
