<?php

return [
    'title' => 'ЗАШТИТА НА ВАШИТЕ ЛИЧНИ ПОДАТОЦИ',
    'processing-operation' => [
        'Постапка за обработка',
        'Обработка на вашите лични податоци во codeweek.eu, вклучувајќи  IP адреси, од посетители на јавно достапни веб-страни.',
    ],

    'data-controller' => [
        'Контролор на податоци',
        'Европска Комисија, Генерален Директорат за Комуникациски Мрежи, Содржини и Технологија, Оддел G.2.',
    ],
    'record-reference' => 'Референца за запис',
    'table-of-contents' => 'Содржина',

    '1-intro' => [
        'title' => 'Вовед',
        'items' => [
            '1' => 'Европската Комисија (понатаму во текстот ‘Комисијата’) се обврзува да ги заштити вашите лични податоци и да ја почитува вашата приватност. Комисијата ги собира и дополнително ги обработува личните податоци според <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv:OJ.L_.2018.295.01.0039.01.ENG&toc=OJ:L:2018:295:TOC">Регулатива (EU) 2018/1725</a> на Европскиот Парламент и на Советот, од 23 Октомври 2018 год, за заштита на физичките лица во однос на обработката на личните податоци од страна на институциите, органите, канцелариите и агенциите нa Унијата и за слободното движење на таквите податоци (укинување на Регулатива (EC) бр. 45/2001).',
            '2' => 'Оваа изјава за приватност ја објаснува причината за обработката на вашите лични податоци, начинот на кој ги собираме, раководиме и обезбедуваме заштита за сите добиени лични податоци, како се користат тие информации и какви права имате во однос на вашите лични податоци.. Исто така, ги одедува деталите за контакт на одговорниот контролор на податоци со кој можете да ги остварите вашите права, Службеникот за заштита на податоци и Европскиот надзорен орган за заштита на податоците.',
            '3' => [
                'Информацији во врска со постапките за обработка',
                'Обработката на податоци на codeweek.eu',
                'преземени од страна на Комисијата е претставена подолу.',
            ],
        ],
    ],
    '2-why' => [
        'title' => 'Зошто и како ги обработуваме вашите лични податоци?',
        'items' => [
            'Цел на постапката за обработка',
            'Генералниот директорат за комуникациски мрежи, содржини и технологија на Комисијата нуди голем број надворешни веб-страни. Техничката поставка ги собира и користи вашите лични информации за да може да ги снабди веб-страните кои физички се наоѓаат надвор од контролираната хостинг инфраструктура на Комисијата.',
            'Вашите лични податоци нема да се користат за автоматизирано донесување на одлуки вклучувајќи и профилирање.',
        ],
    ],
    '3-legal_process' => [
        'title' => 'На која правна основа ги обработуваме вашите лични податоци?',
        'items' => [
            'Ние ги обработуваме вашите лични податоци на неколку основи:',
            '<strong>Член 5(1)(a) од Регулативата (EU) 2018/1725</strong>: оваа обработка е <span style="text-decoration: underline">неопходна за извршување на задача </span> спроведена за јавен интерес или во вршењето на официјални овластувања доделени на институцијата или телото на Унијата.',
            'Навистина, информирањето на пошироката јавност е задача која произлегува од сопствените прерогативи на Европската Комисија на институционално ниво, какошто е предвидено во член 58(2) (d), од Регулативата (EU, Euratom) 2018/1046 на Европскиот Парламент и на Советот од 18 July 2018 г., за финансиските правила, применливи на основниот буџет на Унијата (OJ(Сл.весник) L 193, 30.7.2018 год., стр. 1). Ние гарантираме дека се спроведува соодветна и специфична заштита на обработката на личните податоци, во согласност со важечкото законодавство за заштита на податоците.',
            '<strong>Член 5(1)(d) од Регулативата (EU) 2018/1725:</strong> за активностите при обработка кои се содржат од колачиња и потврдување на идентитет, вашата <span style="text-decoration: underline">cогласност</span> е неопходна. Во согласност со член 3(15) и член 7 од Регулативата (EU) 2018/1725, согласноста мора да се даде слободно, посебно, информирано и недвосмислено.',
            'Ние ја добивме согласноста директно од вас. Можеби сте ја поднеле преку е-пошта, преку форма на електронска регистрација , или во било која писмена форма.',
        ],
    ],
    '4-collect_data' => [
        'title' => 'Кои лични податоци ги собираме и обработуваме понатаму?',
        'items' => [
            'Со цел да се <strong>спроведе оваа постапка за обработка</strong>, Одделот G.2  ги собира следните категории на лични податоци:',
            'Адреса на интернет протоколот (IP address) или идентификацискиот број на уредот кој се користи за пристап кон веб-страната.',
            'Без оваа обработка нема да можете да воспоставите техничка врска помеѓу вашите уреди и инфраструктурата на серверот и оттука нема да можете да пристапите кон нашата веб-страна.',
            'За да можете да се <strong>автентицирате на оваа веб-страна</strong>, Одделот G.2  ги собира следните категории на лични податоци:',
            'Адреса на е-пошта',
            'Лозинка; или',
            'Потврдување на социјалните мрежи.',
        ],
    ],
    '5-how_long' => [
        'title' => 'Колку долго ги чуваме вашите лични податоци?',
        'items' => [
            'Одделот G.2 ги чува вашите лични податоци само за времето кое е неопходно за исполнување на целта за собирање или понатамошна обработка, имено за времетраењето на сесијата за пребарување. Покрај тоа, IP адресите може да бидат зачувани една година во евиденцијата на сервисите од безбедносни причини. Што се однесува до алатката за анализи, the IP адресата и идентификацискиот број на уредот (на пр. IMEI број и WIFI MAC адреса) се бришат веднаш при исклучувањето.',
        ],
    ],
    '6-protect_data' => [
        'title' => 'Како ги заштитуваме вашите лични податоци?',
        'items' => [
            'Сите лични податоци во електронска форма (е-пошти, документи, бази на податоци, внесени групи на податоци, итн.) се чуваат на серверите на Европската комисија. Сите постапки за обработка се спроведуваат во согласнот со',
            'Одлука на Комисијата (EU, Euratom) 2017/46',
            ', od 10 January 2017,за безбедноста на комуникациските и информациските системи во Европската Комисија.',
            'Со цел да ги заштитите вашите лични податоци, Комисијата воспостави голем број на технички и организациски мерки. Техничките мерки вклучуваат соодветни активности за решавање на онлајн сигурноста, ризик од губење на податоци, промена на податоци или неовластен пристап, земајќи го предвид ризикот опфатен со обработката и природата на личните податоци кои се обработуваат. Организациските мерки вклучуваат ограничување на пристапот до личните податоци единствено на овластени лица со легитимна потреба да знаат за целите на оваа постапка за обработка.',

        ],
    ],
    '7-access_data' => [
        'title' => 'Кој има пристап до вашите лични податоци и на кого се откриваат?',
        'items' => [
            'Пристапот до вашите лични податоци им е овозможен на персоналот на Комисијата одговорен за спроведувањето на оваа постапка за обработка и до овластениот персонал спoред принципот “има право да знае”. Ваквиот персонал се придржува до законски, и спрема потребата, дополнителни договори за доверливост.',
            'Понатаму, пристапот до вашите лични податоци може да им биде овозможен на надворешни изведувачи што работат во име на и според договор со службата на Комисијата која ги поседува веб-страните и е ангажирана во креирање, одржување, управување и архивирање на веб-страни според принципот "има право да знае".',
            'Информациите што ги собираме нема да бидат дадени на трета страна, освен до степен и за цел за кои би можеме да бидеме приморани да го направиме тоа според закон.',
        ],
    ],
    '8-rights' => [
        'title' => 'Кои се вашите права и како можете да ги остварувате?',
        'items' => [
            'Имате посебни права како ‘субјект од кој се користат лични податоци’ според глава III (членови 14-25) од Регулатива (EU) 2018/1725, особено правото на пристап, коригирање или бришење на вашите лични податоци и право на ограничување на обработката на вашите лични податоци.. Каде што е применливо, вие исто така имате право на приговор на обработката или право на преносливост на податоци.',
            'Имате право на приговор за обработката на вашите лични податоци, која законски се спроведува согласно членот 5(1)(a).',
            'Вие се согласивте да ги овозможите вашите лични податоци за оваа постапка за обработка. Вашата согласност можете да ја повлечете во секое време со известување на Одделот G.2. Повлекувањето нема да влијае на законитоста на извршената обработка пред да ја повлечете вашата согласност.',
            'Можете да ги остварите вашите права преку контактирање со контролорот на податоци, или во случај на конфликт службеникот за заштита на податоците. Ако е потребно, можете да се обратите и до Европскиот надзорен совет за заштита на податоците. Нивните информации за контакт се дадени под наслов 9 подолу.',
            'Ако сакате да ги остварите вашите права во контекст на една или неколку специфични постапки за обработка, ве молиме да го дадете нивниот опис (т.е. нивната референца за запис) како што е наведено под наслов 10 подолу) во вашето барање.',
        ],
    ],
    '9-contact' => [
        'title' => 'Контакт инфо',
        'data-controller' => [
            'title' => 'Контролор на податоци',
            'text' => 'Доколку сакате да ги остварите вашите права според Регулатива (ЕU) 2018/1725, или ако имате коментари, прашања или загриженост, или ако сакате да поднесете жалба во врска со прибирањето и користењето на вашите лични податоци, ве молиме слободно контактирајте со Контролор на податоци, Оддел G.2, Европска комисија, на CNECT-G2@ec.europa.eu.',

        ],
        'data-protection-officer' => [
            'title' => 'Службеник за заштита на податоци (DPO) на Комисијата',
            'text' => "Можете да го контактирате Службеникот за заштита на податоците (<a href='mailto:DATA-PROTECTION-OFFICER@ec.europa.eu'>DATA-PROTECTION-OFFICER@ec.europa.eu</a>) во врска со проблеми поврзани со обработката на вашите лични податоци по Регулатива (EU) 2018/1725.",
        ],
        'european-data-protection' => [
            'title' => 'Европски надзорен орган за заштита на податоците (EDPS)',
            'text' => 'Имате право да побарате помош (т.е. да поднесете жалба) на Европскиот надзорен орган за заштита на податоците (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>) ако сметате дека вашите права биле нарушени под Регулатива (EU) 2018/1725 како резултат на обработката на вашите лични податоци од страна на контролорот на податоциa.',
        ],
    ],
    '10-detailed-info' => [
        'title' => 'Каде да најдете подетални информации?',
        'items' => [
            'Службеникот за заштита на податоците (DPO) го објавува регистарот на сите постапки за обработка на лични податоци од страна на Комисијата, кои се документирани и доставени до него. Можете да пристапите до регистарот преку следниот линк: <a href="https://ec.europa.eu/dpo-register">https://ec.europa.eu/dpo-register</a>',
            'Оваа посебна операција за обработка е вклучена во јавниот регистар на службеникот за заштита на податоците со следниов референтен записник: <strong>DPR-EC-09706.1</strong>.',
        ],
    ],
];
