<?php

return [
    'subtitle' => 'Оваа изјава за приватност овозможува информации за обработката и заштитата на вашите лични податоци.',
    'processing-operation' => [
        'Постапка за обработка',
        'управување на амбасадорите на Неделата на кодирање, (Code Week), главни наставници и регистрација на активностите на веб-страната.'
    ],
    'data-processors' => [
        'Обработувач на податоци',
        'GOPA Com. S.A. и EUN Партнерство AISBL (European Schoolnet), info@codeweek.eu'
    ],
    '1-intro' => [
        'Информации во врска со обработката на личните податоци за управување на амбасадорите на Неделата на кодирање, (Code Week), главните наставници и регистрација на активностите на веб-страната.'
    ],

    '3-legal_process' => [
        'Законитост на постапката за обработка: Одделот G.2 ги собира, чува и објавува вашите лични податоци, бидејќи вие ја имате дадено вашата изречна согласност со обележување на квадратчето кога сте се пријавиле за да станете амбасадор на Неделата на кодирање, (Code Week), главен наставник или кога сте аплицирале за регистрирање на настан на <a href="https://codeweek.eu/register">EевропскатаЕвропската недела на кодирање (Еurope Code Week).</a>',

    ],
    '4-collect_data' => [
        ' <strong>задолжителните</strong> лични податоци кои се прибираат за <strong>амбасадорите и главните наставници</strong> се:',
        'Име',
        'E-пошта',
        'Лозинка',
        'Слика',
        'Биографија',
        'Звање',
        'Полето на експертиза на главните наставници.',
        'Кога ќе <strong>регистрирате активност, задолжителните</strong> лични податоци кои мора да се приберат се:',
        'Име на организацијата',
        'Вид на организацијата',
        'Е-пошта за контакт',
        'Обезбедувањето на овие податоци е задолжително за да се биде амбасадор на Неделата на кодирање, (Code Week), главен наставник или да се регистрира активност на веб-страната на Неделата на кодирање, (Code Week).',
        'Во прилог, <strong>амбасадорите и главните наставници</strong> можат <strong>доброволно</strong> да ги приложат и следниве лични податоци:',
        'Профилите на социјалните мрежи',
        '<strong>Организаторите на активности</strong> можат <strong>доброволно</strong> да ги приложат следниве податоци:',
        'Е-пошта за јавен контакт',
        'Веб-страна на организаторот',
        'Неделата на кодирање за сите, Code Week for All Code',
        'За тие што се организатори на активности, ве молиме имајте предвид дека релевантниот амбасадор за вашата земја или оддел G.2, може да ги користи личните податоци што сте ги проложиле за да регистрирате активност, за да ве контактира во врска со наведената активност.',
        'Вие ги приложивте вашите лични податоци на',
        'Веб-страната за пријавување на Неделата на кодирање, (Code Week) ',
        'и на',
        'страната за регистрација на активност.',
    ],
    '5-how_long' => [
        'Сите лични податоци ќе бидат избришани од базите на податоци ако се повлечете од иницијативата или 5 години по завршувањето на истата.',
    ],

    '6-protect_data' => [
        'Сите лични податоци во електронска форма (е-пошти, документи, бази на податоци, прикачени групи на податоци, итн.) се чуваат на серверите на Европската комисија или кај нејзините изведувачи. Сите постапки на обработка се спроведуваат во согласност со <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?qid=1548093747090&uri=CELEX:32017D0046">CодлукатаОдлуката на Комисијата (EU, Euratom) 2017/46</a>, од 10 Јануари 2017 год., за безбедноста на комуникациските и информациските системи во Европската комисија.',
        'Изведувачите на Комисијата се обврзани со специфична договорна клаузула за било какви постапки на обработка на вашите податоци во име на Комисијата, и со обврски за доверливост кои произлегуваат од превземањето на Општата регулатива за заштита на податоците во земјите-членки на ЕУ(‘GDPR’ <a href="https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A32016R0679">Регулатива (EU) 2016/679</a>).',
        'Со цел да ги заштити вашите лични податоци, Комисијата воспостави голем број на технички и организациски мерки. Техничките мерки вклучуваат соодветни активности за решавање на онлајн безбедноста, ризикот од губење на податоци, промена на податоците или неовластен пристап, земајќи го предвид ризикот претставен со обработка и природата на личните податоци кои се обработуваат. Организациските мерки вклучуваат ограничен пристап до личните податоци единствено на овластени лица со легитимна потреба да знаат за целите на оваа постапка за обработка.',
    ],
    '7-access_data' => [
        'Кон сите лични податоци приложени од вас, персоналот на Комисијата може да има пристап врз основа на правилото  "потреба да се знае". Покрај тоа, пристапот до вашите лични податоци е овозможен до нашиот изведувач врз основа на правилото "потреба да се знае"' .
        'Со цел да се зголеми видливоста на амбасадорот на Неделата на кодирање, (Code Week), главниот наставник или на регистрираните активности, сите ваши лични податоци се објавени на следниве <a href="https://codeweek.eu/">веб-страни</a>.',
        'Покрај тоа, одделот G.2 може да ги сподели вашите детали за контакт со секој член на јавноста или учесник кој ќе треба да ве контактира во врска со Неделата на кодирање, (Code Week). \'За тие што се организатори на активности, ве молиме имајте предвид дека релевантниот амбасадор за вашата земја или оддел G.2, може да ги користи личните податоци што ги имате проложено за да регистрирате активност, да ве контактира во врска со наведената активност.',
    ],
    '8-rights' => [
        'Вие се согласивте да ги приложите вашите лични податоци на одделот G.2 за оваа постапка за обработка. Вашата согласност можете да ја повлечете во секое време со известување на одделот G.2 на CNECT-G2@ec.europa.eu. Повлекувањето нема да влијае на законитоста на извршената обработка пред да ја повлечете вашата согласност.',
    ],

    '10-detailed-info' => [
        'Оваа посебна операција за обработка е вклучена во јавниот регистар на службеникот за заштита на податоците со следниов референтен записник: DPR-EC-02631 Управување со точки за контакт за DG CONNECT политики, програми и проекти.',
    ]
];