<?php

return [
    'title' => 'ЗАШТИТА НА ЛИЧНИТЕ ПОДАТОЦИ',
    '1-intro' => [
        'title' => '1. Вовед',
        'items' => [
            '1' =>
                '<p>Европската комисија (во понатамошниот текст „Комисијата“) е обврзана да ви ги зашти личните податоци и да ви ја почитува приватноста. Комисијата ги собира и дополнително ги обработува личните податоци во согласност со Регулативата (ЕУ) 2018/1725 на Европскиот Парламент и на Советот од 23 октомври 2018 година за заштита на физички лица во врска со обработката на личните податоци од страна на институциите на Унијата, телата, канцелариите и агенциите и на слободното движење на такви податоци (со што престанува да важи Регулативата (EС) бр. 45/2001).</p>',
            '2' =>
                '<p>Оваа изјава за приватност ја објаснува причината за собирањето и обработката, начинот на кој ги собираме, ракуваме со и ја обезбедуваме заштитата на сите доставени лични податоци, како се користат тие информации и кои права може да ги користите во врска со личните податоци (правото да пристапите, поправите, блокирате и сл.).  Исто така, ги наведува деталите за контакт на одговорниот Контролор за податоци кај кој може да ги искористите своите права, Референтот за заштита на податоци и Европскиот надзорник за заштита на податоци.</p>',
            '3' =>
                '<p>Оваа изјава за приватност се однесува на собирањето и објавувањето лични податоци на јавно достапната веб-локација Codeweek.eu, на лица кои служат како точки за контакт за активностите на Европската недела на кодирање (амбасадори на Неделата на кодирање, Координатори од Министерството за образование, наставници во својство на водачи, како и организатори на активности и настани).</p>'
        ]
    ],
    '2-why' => [
        'title' => '2. Зошто ви ги обработуваме податоците?',
        'items' => [
            '1' =>
                '<p>Европската комисија собира и објавува лични информации за да ја олесни идентификацијата на точките за контакт од страна на релевантни фактори или заинтересирани граѓани. Нудењето вистински личности како точки за контакт е најдобриот и најефикасниот начин да се гарантира дека заинтересираните луѓе може да остварат контакт со службите на Комисијата.</p>',
            '2' =>
                '<p>Личните податоци нема да се користат за никакво автоматизирано донесување одлуки, вклучувајќи и профилирање.</p>'
        ]
    ],
    '3-legal_process' => [
        'title' =>
            '3. Според која правна основа(и) ги собираме личните податоци',
        'items' => [
            '1' =>
                '<p>Операциите за обработка на личните податоци за објавување на точките за контакт се законски според член 5(1)(d) од Регулативата (ЕУ) 2018/1725, бидејќи давате согласност за обработка на личните податоци преку образец на интернет или кога сте се согласиле да ви ги користиме е-адресата и корисничко име ако сте се најавиле преку социјална мрежа.</p>'
        ]
    ],
    '4-collect_data' => [
        'title' =>
            '4. Кои лични податоци ги собираме и понатаму ги обработуваме?',
        'items' => [
            '1' =>
                '<p>Собраните лични податоци се информации кои ја олеснуваат вашата идентификација како точка за контакт и ви ја зголемуваат видливоста за јавноста, имено: професија, име, презиме, работно место, поштенска и адреса на е-пошта на работа, телефонски број, слика, сметка на социјален медиум, биографија.</p>',
            '2' =>
                '<p>Вие сте ги дале овие лични податоци доброволно, со пополнување на формуларот за апликација.</p>',
            '3' =>
                '<p>Давањето одредени лични податоци е задолжително за објавувањето на активности и/или можни информации за контакт на веб-локацијата codeweek.eu. Ако не дадете своилични податоци, активноста нема да ви биде објавена, и/или нема да може да учествувате во гореспоменатите мрежи.</p>',
            '4' => '<p>Сите други лични податоци ги давате доброволно.</p>',
            '5' =>
                'Кога ќе се претплатите на нашиот билтен, вашата електронска пошта се додава во листата на билтени на EU Code Week, со кој управува Mailerlite.com. Прочитајте ја политиката за приватност на Mailerlite: https://www.mailerlite.com/legal/privacy-policy. Можете да се откажете од билтенот, во кое било време, користејќи ја врската за „unsubscribe“ во е-поштата што ја добивате од нас или можете да ни испратите е-пошта на info@codeweek.eu со „Unsubscribe “ во насловот.'
        ]
    ],
    '5-how_long' => [
        'title' => '5. Колку долго ги чуваме личните податоци?',
        'items' => [
            '1' =>
                '<p>Комисијата ги чува личните податоци само за времето кое е потребно да се исполни целта на собирањето или понатамошното обработување опишано во точка 2, имено толку долго колку што ќе служите како точка за контакт.</p>',
            '2' =>
                '<p>Личните податоци ќе бидат отстранети од јавно достапната веб-локација веднаш штом ја завршите функцијата на точка за контакт освен ако не сте дале согласност да бидете вклучени во базата со податоци за понатамошни активности.</p>'
        ]
    ],
    '6-protect_data' => [
        'title' => '6. Како ги заштитуваме и обезбедуваме личните податоци?',
        'items' => [
            '1' =>
                '<p>Сите лични податоци во електронски формат (е-пораки, документи, бази со податоци, поставени групи на податоци и сл.) се складирани или на серверите на Европската комисија или на нејзиниот изведувач. Сите операции на обработка се вршат во согласност со Одлуката на Комисијата (ЕУ, Евроатом) 2017/46 од 10 јануари 2017 година за сигурноста на комуникациите и информатичките системи во Европската комисија.</p>',
            '2' =>
                '<p>Изведувачите на Комисијата се обврзани со конкретна договорна клаузула за какви било операции на обработка на податоците во име на Комисијата, и од обврските за доверливост кои произлегуваат од пренесувањето на Регулативата за заштита на општите податоци во земјите-членки на ЕУ (‘GDPR’ Регулатива (EУ) 2016/679).</p>',
            '3' =>
                '<p>Со цел да ги заштити личните податоци, Комисијата активираше бројни технички и организациски мерки. Техничките мерки вклучуваат соодветни дејства кои се однесуваат на онлајн безбедноста, ризикот од загуба на податоци, менувањето на податоци или неовластен пристап, земајќи го предвид ризикот прикажан од обработката и природата на личните податоци кои се обработуваат. Организациските мерки вклучуваат ограничување пристап до личните податоци само за овластени лица со легитимна потреба да знаат за целите на оваа операција на обработка.</p>'
        ]
    ],
    '7-access_data' => [
        'title' => '7. Кој има пристап до податоците и кому му се откриваат?',
        'items' => [
            '1' =>
                '<p>Пристап до личните податоци му е даден на персоналот на Комисијата одговорен за спроведување на оваа операција на обработка и на овластен персонал според принципот „треба да знае“. Таквиот персонал е обврзан со статутарни, а кога е потребно, со дополнителни договори за доверливост.</p>',
            '2' =>
                '<p>Конкретно, до сите лични податоци што сте ги обезбедиле може да пристапат администраторите на веб-локациите (персонал на Комисијата), како и друг персонал на Комисијата врз основа на потребата да знае. . Освен тоа, личните информации и информации за настан ќе се споделат со членовите на мрежите на амбасадори и образовни координатори на Европската недела на кодирање за организација на локални активности или следење.</p>',
            '3' =>
                '<p>Со цел да се зголеми видливоста на точките за контакт, личните податоци се објавени без никакви ограничувања за пристап на јавната веб-локација: https://codeweek.eu.</p>',
            '4' =>
                '<p><i>Во врска со пренесување податоци на трети страни</i></p>',
            '5' =>
                '<p>Информациите што ги собираме нема да бидат дадени на никоја трета страна, освен до опсегот и за целта за која можеби ќе мора да ги дадеме според законот.</p>'
        ]
    ],
    '8-rights' => [
        'title' => '8. Кои се вашите права и како може да ги примените?',
        'items' => [
            '1' =>
                '<p>Имате конкретни права како „субјект на податоци“ според Поглавје III (Членови 14-25) од Регулативата (EУ) 2018/1725, особено правото за пристап, поправање или бришење на личните податоци и правото за ограничување на обработката на личните податоци. Онаму каде што е применливо, исто така имате право да вложите приговор за обработката или за правото за преносливост на податоци.</p>',
            '2' =>
                '<p>Сте се согласиле да ни ги дадете личните податоци за сегашната операција на обработка и може да ја повлечете согласноста во секое време со известување на Контролорот на податоци. Повлекувањето нема да влијае врз законитоста на обработката што се извршила пред повлекувањето на согласноста.</p>',
            '3' =>
                '<p>Може да ги искористите своитеправа со остварување контакт со Контролорот на податоци или во случај на конфликт - со Службеникот за заштита на податоци. Ако е потребно, исто така може да се обратите до Европскиот надзорник за заштита на податоци. Нивните информации за контакт се дадени под Заглавје 9 подолу.</p>'
        ]
    ],
    '9-contact' => [
        'title' => '9. Информации за контакт',
        'data-controller' => [
            'title' => '-Контролор на податоци',
            'text' =>
                '<p>Ако сакате да ги искористите своите права според Регулативата (EУ) 2018/1725, или ако имате коментари, прашања или сте засегнати на кој било начин, или ако би сакале да поднесете жалба во врска со собирањето и користењето на личните податоци, слободно контактирајте со Контролорот на податоци,</p>',
            'address' =>
                'Directorate-General for Communications Networks, Content and Technology Unit G2<br> Building BU25<br> B-1049 Brussels<br> ',
            'email' => 'Е-пошта: '
        ],
        'data-protection-officer' => [
            'title' => '-Службеник за заштита на податоци (СЗП) на Комисијата',
            'text' =>
                '<p>Може да остварите контакт со Службеникот за заштита на податоци (<a href="mailto:DATA-PROTECTION-OFFICER@ec.europa.eu">DATA-PROTECTION-OFFICER@ec.europa.eu</a>) во врска со прашања поврзани со обработката на личните податоци според Регулативата (EУ) 2018/1725.</p>'
        ],
        'european-data-protection' => [
            'title' => '-Европски надзорник за заштита на податоци (ЕНЗП)',
            'text' =>
                '<p>Имате право на правен лек (т.e. може да поднесете жалба) до Европскиот надзорник за заштита на податоци (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>) ако сметате дека ви се прекршени правата според Регулативата (EУ) 2018/1725, како резултат на обработката на личните податоци од страна на Контролорот на податоци.</p>'
        ]
    ]
];
