<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'title' => 'Пријавете го вашиот #codeEU настан',
    'event_title' => 'Наслов на настанот',
    'number_required' => 'Направете груба проценка, дури и ако немате точен датум.',
    'phrase1'=>'Може да го пополните овој формулар само еднаш! Внимателно проверете ги вашите податоци. Ако направите грешка, ',
    'phrase2'=>'По поднесувањето на извештајот, персонализираниот сертификат за учество во Неделата на кодирање ќе биде издаден автоматски и ќе биде достапен да го преземете или споделите. Овде може да видите пример на сертификат.',
    'phrase3'=>'Потребните полиња се означени со * ѕвездичка.',
    'phrase4'=>'Може да го пополните овој формулар само еднаш! Внимателно проверете ги вашите податоци. Ако направите грешка,',
    'contactus'=>'контактирајте со нас',
    'participants_count' => [
        'label' => 'Број на учесници',
    ],
    'average_participant_age' => [
        'label'=>'Просечна возраст на учесниците',
    ],
    'percentage_of_females' => [
        'label' => 'Процент на женски',
    ],
    'codeweek_for_all_participation_code' => [
        'label' => 'Код за учество во Недела на кодирање за сите ',
        'help' => 'Овде можете да го ставите кодот за предизвик за Codeweek4All, ако сте го добиле. Ако не учествувате, едноставно игнорирајте го ова поле.'
    ],
    'name_for_certificate' => [
        'label' => 'Име за сертификат',
        'help' => 'Сменете го ова со името на организаторот на настанот кој  ќе издаде сертификат за учество на Неделата на кодирање. Користете само ASCII (латинични) букви. Буквите кои се нагласени, имаат надредни знаци и слично не се поддржани.'
    ],
    'submit' => 'Поднесете извештај за настан',
    'thanks_page'=>[
        'title'=>'Ви благодариме што известивте за вашиот настан!',
        'certificate_ready'=>'Сертификатот е готов.',
        'download_button'=>'Кликнете овде и преземете го.',
        'back_events'=>'Вратете се на вашиот настан'
    ]



];
