<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'title' =>'Училишта: донесете им ја Неделата на кодирањето на вашите ученици',
    '1' => [
        "title1" => "Зошто треба да го донесете кодирањето во вашата училница?",
        "title2" => "Како кодирањето може да биде од корист за вашите ученици? Што добивате вие како наставник ?",
        "content" => [
            "Веруваме дека сечија основна писменост во дигиталната ера мора да вклучува разбирање на кодирање и развој на суштински компетенции поврзани со компјутерско размислување, како што е решавање проблеми, соработка и аналитички вештини.",
            "Учењето како  да кодираат може да им даде сила на вашите ученици да бидат предводници во дигиталното компетитивно општество, да развијат подобро разбирање на светот кој ги опкружува и да имаат подобри можности за успех во личниот и професионалниот живот.",
            "Неделата на кодирање им ја нуди на сите ученици можноста да ги направат првите чекори како дигитални креатори, со обезбедување на училишта и на наставници бесплатни можности за професионален развој, наставни материјали, меѓународни предизвици и можности за размена",
        ],
        "button" => [
            "label" => "Сакате да започнете веднаш сега? Запишете се тука!",
        ]
    ],
    '2' => [
        "title1" => "Подготвени да се вклучите?",
        "title2" => "Организирајте час, сесија за обука или настан и прикачете го на мапата.",
        "content" => [
            "Без разлика дали имате знаење од областа на кодирањето или програмирањето или немате, лесно може да организирате час во вашата училница, отворен ден или настан во вашето училиште. Само најдете датум и регистрирајте ја активноста на мапата подолу. Ако чувствувате дека ви е потребна поддршка при подготвување на лекција со кодирање, преминете на следниот дел.",
            "Погледнете некои примери на активности кои се организирани пребарувајќи на мапата подолу и додајте ја својата за да им се приклучите на колегите едукатори од Европа и светот: "

        ],
        "button" => [
            "label" => "Подготвени сте да пробате? Додадете активност!",
        ]

    ], '3' => [

        "title1" => "Нови во кодирањето? Без грижа",
        "title2" => "Нашите алатки помагаат да се запознаете со кодирањето пред да им го пренесете на вашите ученици",
        "content" => [
            "Ако сте заинтересирани да го донесете кодирањето во вашата училница, но не знаете каде да започнете, не грижете се! Меѓународен тим на наставници и експерти развиваат збирка на кратки онлајн модули за обука за да ви помогнат да започнете.",
            "Не е потребно претходно искуство во кодирање за да се следат нашите делови за учење!"

        ],
        "button" => [
            "label" => "Пристап до модулите за обука",
        ]
    ], '4' => [

        "title1" => "Барате дополнителен предизвик ?",
        "title2" => "Изградете мрежа од активности, вклучете колку што е можно повеќе ученици и здобијте се со Сертификат за извонредност",
        "content" => [
            "Code Week 4 All ве предизвикува да ги здружите силите со други наставници или училишта и да учествувате во меѓународна заедница на истомисленици давајќи им на учениците можност да ги направат првите чекори во кодирањето. Изградете алијанса која вклучува повеќе од 500 ученици и ќе добиете Сертификат за извонредност.",

        ],
        "button" => [
            "label" => "Научете повеќе за предизвикот Code Week 4 All",
        ]
    ],


];
