<?php

return [

    "about" => [
        "goal" => "Целта е да им се помогне на што повеќе млади да ги совладаат основите на кодирањето и компјутерското размислување."
    ],
    "guide" => [
        "tutorials" => [
            "1" => "Погледнете ги нашите",
            "2" => "упатства и материјали за обука",
            "3" => "коишто се достапни на 29 јазици, за да се подготвите да организирате активности преку кои младите учат кодирање и компјутерско размислувње.",
        ]
    ],
    "dance" => [
        "menu" => "Предизвик во танцување",
        "subtitle" => "Кој рече дека програмерите не знаат да танцуваат? Со предизвикот #CodeWeekDance ќе докажеме дека тоа не е точно.",
        "content" => "Ги покануваме сите – училиштата, наставниците, библиотеките, претпријатијата, јавните органи – да ја одбележат Европската недела на кодирање така што ќе организираат активност #CodeWeekDance и ќе ја додадат таа активност на мапата на Европската недела на кодирање."
    ],
    "treasure-hunt" => [
        "menu" => "Treasure Hunt (Пронајди го богатството)",
        "subtitle" => "Тоа е игра на Telegram",
    ],


    "videos" => [
        1 => "Дознајте повеќе за нашите вредности преку видеата на амбасадорите на Европската недела на кодирање",
        2 => "Амбасадорката во Словенија Катја Ошљак објаснува дека Неделата на кодирање е независна иницијатива",
        3 => "Амбасадорот во Франција Лорен Туше раскажува зошто Неделата на кодирање е отворена за сите",
        4 => "Амбасадорката во Тунис Фатма Боазиз објаснува како Неделата на кодирање има воедно и глобално и локално влијание",
        5 => "Амбасадорката во Латвија Линда Синка открива дека една од главните цели на Неделата на кодирање е соработката",
        6 => "Амбасадорот во Италија Алесандро Болиоло образложува дека Неделата на кодирање е непрофитна иницијатива",
        7 => "Aмбасадорката во Албанија Марјана Прифти зборува за тоа како Неделата на кодирање поттикнува иновации и креативност",
        8 => "Амбасадорката во Романија Кристиана Лукач упатува благодарност од организаторите на Неделата на кодирање до заедницата",
        ]


];