<p><?php

return [

    'learning_bits' => 'Делчиња за учење во неделата на кодирање',
    'title' => 'Дали размислувате да учествувате во Европската недела на кодирање, но не знаете од каде да почнете?',
    'text' => '<p>Овде може да најдете бесплатни материјали и ресурси за обука што ќе ви помогнат да започнете и да ја планирате следната иновативна лекција.</p>

                    <p>Не е потребно претходно искуство за кодирање или програмирање, а за секој модул се потребно само околу 15 минути да се заврши. Модулите ве запознаваат со клучните концепти поврзани со кодирањето и активностите на компјутерско размислување. Како дополнение, модулите исто така ви даваат практични совети и ви укажуваат како да ги интегрирате концептите во училницата.</p>',
    'text_2' => '<p>Сега откако завршивте со едно или повеќе делчиња за учење во Неделата на кодирање, се надеваме дека се чувствувате доволно креативно да донесете извесна дигитална креативност во училницата и да ја закачите активноста на <a href="/events">Мапата на Неделата на кодирање</a>!</p>

                    <p>Лесно може да организирате час во училницата, отворен ден или настан во училиштето. Само најдете датум и регистрирајте ја активноста на <a href="/events">мапата на Неделата на кодирање</a>. Организаторот на секоја активност ќе добие сертификат за учество за својот труд.</p>

                    <p>Ако сакате да се поврзете со меѓународна група на наставници ентузијасти, придружете се на <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">Групата на Facebook за наставници за Европската недела на кодирањето</a>! За да направите чекор понатаму и да соработувате со други училишта во земјата или во странство - придружете се на <a href="codeweek4all">Предизвикот Code Week 4 All</a>.</p>',
    'lessons' => [
        '1' => [
            'title' => 'Кодирање без дигитална технологија (без интернет)',
            'author' => 'Од Алесандро Бољоло',
            'text' => '<p>Кодирањето е јазикот на нештата, кој ви овозможува да пишувате програми со кои им овозможуваме нови функционалности на десетици милијарди објекти што може да се програмираат околу нас. Кодирањето е најбрзиот начин за реализирање на идеите и најефективниот начин да се развијат способностите за компјутерско мислење. Сепак, не е исклучиво потребна технологија за да се развие компјутерско мислење. Во поголема мерка, вештините на компјутерско мислење се суштински да се овозможи функционирање на технологијата.</p>

                    <p>Во ова видео, Алесандро Бољоло, професор по Компјутерски системи во Италија и координатор на Европската недела на кодирање, ќе претстави активности на кодирање без интернет што може да се практикуваат без каков било електронски уред. Главната цел на активностите без интернет е да се намалат бариерите на пристапност за да се донесе кодирањето во секое училиште, без оглед на финансирањето и опремата.</p>

                    <p>Активностите на кодирање без интернет ги откриваат компјутерските аспекти на физичкиот свет околу нас.</p>',
            'activities' => [
                '1' => 'Активност 1 - CodyRoby за основно училиште',
                '2' => 'Активност 2 - CodyRoby за почетни години на средно училиште',
                '3' => 'Активност 3 - CodyRoby за средно училиште'
            ]
        ],
        '2' => [
            'title' => 'Компјутерско размислување и решавање проблеми',
            'author' => 'Од Мајлс Бери',
            'text' => '<p>Компјутерското размислување (КР) опишува начин на гледање на проблемите и системите при кој може да се употреби компјутер да ни помогне да ги решиме и разбереме.  Компјутерското размислување не е основно само за развојот на компјутерски програми, туку исто така може да се користи да поддржи решавање проблеми низ сите дисциплини.</p>

                    <p>Може да им предавате КР на учениците така што ќе им укажете да разложат комплексни проблеми во помали (разложување), да препознаваат шаблони (препознавање шаблони), да идентификуваат релевантни детали за решавање проблем (апстракција); или поставување правила или упатства за редоследно следење за да се постигне посакуваниот резултат (дизајн на алгоритам). КР може да се подучува низ различни дисциплини, на пример во математика (да се сфатат правилата за факторирање полиноми од втор ред), литература (разложување на анализата на поемата во анализа на метрика, рима и структура), јазици (наоѓање шаблони во завршните букви на глагол што влијаат на нивното спелување како и промени по времиња) и многу други.</p>

                    <p>Во ова видео, Мајлс Бери, главен предавач на Педагошкиот факултет при Универзитетот Рохамптон во Гилтфорд (Обединето Кралство), ќе го претстави концептот на компјутерско размислување и различните начини кои наставник може да ги интегрира во училница со едноставни игри.</p>',
            'activities' => [
                '1' => 'Активност - Развивање математичко размислување за основно училиште',
                '2' => 'Активност 2 - Запознавање со алгоритми за почетни години во средно училиште',
                '3' => 'Активност 3 - Алгоритми за завршни години во средно училиште'
            ]
        ],
        '3' => [
            'title' => 'Визуелно програмирање - вовед во Scratch',
            'author' => 'Од Марго Тинави',
            'text' => '<p>Визуелното програмирање им овозможува на луѓето да ги опишат процесите со користење на илустрации или графика. Вообичаено зборуваме за визуелното програмирање како спротивност на програмирањето базирано на текст. Јазиците за визуелно програмирање (VPL) се исклучително добро приспособени да воведат алгоритамско размислување за деца (па дури и за возрасни). Со VPL има помалку за читање и нема синтакса за спроведување.</p>

                    <p>Во ова видео, Марго Тинави, наставник за развој на веб во Ле Вагон и коосновач на Techies Lab asbl (Белгија), ќе ви помогне да го откриете Scratch, еден од најпопуларните VPL што се користат насекаде низ светот. Scratch е развиен од MIT во 2002 година и оттогаш околу него се создаде голема заедница, каде што може да најдете милиони проекти што може да ги реплицирате со учениците и безбројни упатства на неколку јазици.</p>

                    <p>Не е потребно да имате искуство со кодирање за да го користите Scratch, а може да го употребувате во секакви различни предмети! На пример, со користење на Scratch како дигитална алатка за раскажување приказни, учениците може да создаваат приказни, да илустрираат математички проблем или да учествуваат во уметнички натпревар за да научат за културното наследство додека учат кодирање и компјутерско размислување, а што е најважно додека се забавуваат.</p>

                    <p>Scratch е бесплатна алатка, многу интуитивна и мотивирачка за учениците. Погледнете го видеото на Марго да научите како да започнете.</p>',
            'activities' => [
                '1' => 'Активност 1 - Основи на Scratch за основно училиште',
                '2' => 'Активност 2 - Основи на Scratch за почетни години во средно училиште',
                '3' => 'Активност 3 - Основи на Scratch за завршни години во средно училиште'
            ]
        ],
        '4' => [
            'title' => 'Креирање едукативни игри со Scratch',
            'author' => 'Од Хесус Морено Леон',
            'text' => '<p>Критичко размислување, истрајност, решавање проблеми, компјутерско размислување и креативност се само некои од клучните вештини што им се потребни на учениците да успеат во XXI век, а кодирањето може да ви помогне да ги постигнете на забавен и мотивирачки начин.</p>

                    <p>Алгоритамските поими за контрола на тек со користење на секвенци на упатства и петелки, прикажување податоци со користење на варијабли и листи или синхронизација на процеси може да звучат како комплицирани концепти, но во ова видео ќе откриете дека тие се полесни да се научат отколку што мислите.</p>

                    <p>Во ова видео, Хесус Морено Леон, наставник по компјутерски науки и истражувач од Шпанија ќе објасни како може да ги развиете овие и други вештини кај учениците додека се забавувате. Како може да се направи ова? Со креирање игра со прашања и одговори во Scratch, најпопуларниот програмски јазик што се користи низ училиштата низ целиот свет. Scratch не само што го збогатува компјутерското размислување, туку исто така дозволува внесување на елементи на дизајнирање игри во училницата за да ја одржи мотивацијата на учениците додека учат и се забавуваат.</p>

                    <p>Погледнете го видеото да научите како да започнете.</p>',
            'activities' => [
                '1' => 'Активност 1 - Игра со прашања и одговори со Scratch за основно училиште',
                '2' => 'Активност 2 - Игра со прашања и одговори со Scratch за почетни години на средно училиште',
                '3' => 'Активност 3 - Игра со прашања и одговори со Scratch за средно училиште'
            ]
        ],
        '5' => [
            'title' => 'Креирање, роботика и поправање во училницата',
            'author' => 'Од Тулиа Уршиц',
            'text' => '<p>Интеграцијата на кодирање, поправање, роботика и микроелектроника како алатки за подучување и учење во наставните програми на училиштата е клучно за образованието од XXI век.</p>

                    <p>Користењето на поправање и роботика во училиштата има многу придобивки за учениците, бидејќи помага да се развијат клучните компетенции како што е решавање проблеми, тимска работа и соработка. Исто така ја зголемува креативноста и сигурноста на учениците и може да им помогне на учениците да изградат истрајност и одлучност кога се соочени со предизвици. Роботиката е исто така поле што промовира инклузивност, бидејќи е лесно достапна за широк спектар на ученици со различни таленти и вештини (и момчиња и девојчиња) и позитивно влијае на учениците со спектар на аутизам.</p>

                    <p>Погледнете го ова видео каде што Тулиа Урштиц, Италијански амбасадор за Scientix и наставник на STEM во Сант\'Aмброџо Ди Валполичела, Италија ќе даде некои практични примери за тоа како наставниците може да го интегрираат поправањето и роботиката во училницата, со тоа трансформирајќи ги пасивните ученици во ентузијастички творци.</p>',
            'activities' => [
                '1' => 'Активност 1 - Како да се направи механичка рака од панел-плоча за основно училиште',
                '2' => 'Активност 2 - Како да се направи механичка или роботска рака за почетни години во средно училиште',
                '3' => 'Активност 3 - Како да се направи механичка или роботска рака за завршни години во средно училиште'
            ]
        ],
        '6' => [
            'title'=>'App Inventor и App Development',
            'author'=>'Од Росана Курер',
            'text'=>'<p>Погледнето го оваа видео каде Росана Курер (Основач  CyberWayFinder) објаснува што е  what App, ги прикажува предностите на користењето на App development во училница и дава неколку практични примери како наставниците да ја интегрираат  App Inventor училница, трансформирајќи ги пасивните ученици во ентузијастични креирачи на игри.</p>  
<p>Ние сите користиме апликации кои се погодни и брз начин за коордирање на нашите активности. Тие исто така се повеќе се користат во едукација бидејќи овозможуваат лично учење и им даваат можност на корисниците да добиваат информации, зошто и да не ги оспособуваат учениците да прават една едукативна апликација за другите?</p>',
            'activities'=>[
                '1'=>'Активност 1 – Наслов, за Основно Училиште ',
                '2'=>'Активност 2 – Наслов, за Пониско Средно Училиште ',
                '3'=>'Активност 3 – Наслов, за Повисоко Средно Училиште'
            ]
        ],
        '7' => [
            'title'=>'Мајсторство и Правење',
            'author'=>'Од Диого да Силва',
            'text'=>'<p>Работите и работните места се менуваат, а едукацијта ги следи нивните чекори. Кога ги подготвувате учениците за кариери во 21-от век, нови вештини како што е мајсторството, правењето и хакирањето се есенцијални, со тоа што го стеснуваат јазот помеѓу училиштето и реалноста. Со трансформирањето на училницата во соработувачка средина која се фокусира во решавање на проблемите, учениците може да се ангажираат и да напредуваат. Овие активности промовираат дискусија, така што овозможуваат училницата да стане место за комуницирање, каде секој придонес е важен.</p> 
<p>Погледнете го видеото подолу, каде португалскиот STEAM (Science, Technology, Engineering, Arts and Mathematics) (Природни науки, Технологија, Инжинерство, Уметност и Математика) наставник Диого да Силва, член на  Escola Global, ве води чекор по чекор во развојот на лекцијата со тоа што вашите ученици ќе мајсторисуваат, праваат и хакираат начин за постигнување на решение.</p>',
            'activities'=>[
                '1'=>'Активност 1 – Наслов, за Основно Училиште ',
                '2'=>'Активност 2 – Наслов, за Пониско Средно Училиште ',
                '3'=>'Активност 3 – Наслов, за Повисоко Средно Училиште'
            ]
        ],
        '8' => [
            'title'=>'Кодирање за сите предмети',
            'author'=>'М. Изабел Бланко, М. Концепсија Фернандез, Елисабета Нани, Дебора Кармела Ниута, Стефанија Алтиери',
            'text'=>'<p>Кога мислите на кодирање во училница, првата работа која ви доаѓа на памет се компјутерите, технологијата, математиката или науката. Било како, со тоа што учениците имаат повеќе интереси и предмети, зошто да не го користите ова во ваша корист и да спроведувате кодирање во целото планирање?</p> 
<p>Интегрирањето на кодирањето во училница има многу придобивки, тоа помага во равојот на нивното критично размислување и во вештините за решавање на проблемите, да бидат активни корисници и да го водат нивниот процес на учење, кое е есенцијално во училиштата. Било како, најважното нешто е дека вашите ученици ќе учат додека се забавуваат!</p> 
<p>Јазиците, музиката или STEAM (Science, Technology, Engineering, Arts and Mathematics)(Природни науки, Технологија, Инжинерство, Уметност и Математика) се само некои предмети во кои наставниците може да кодираат за нивните идни научници, музичари, уметници, за секого! Сите наставници може да го интегрираат кодирањето и компјутерското размислување во училниците. Користењето на лекција CLIL (Content and Language Integrated Learning)(Интегрирано учење на содржина и на јазик) за објаснување  на секојдневните алгоритми, криеирањето на џојстик на допир за учење на науката или користењето на едукативни роботи за мотивирање во математика се само неколку примери на активности кои може да ги направите во вашата училница.</p>  
<p>Погледнете го видеото подолу за да видите како наставниците по музика, природни науки или јазици може лесно да го интегрираат кодирањето и компјутерското размислување во училница, иако немате претходно искуство.</p>',
            'activities'=>[
                '1'=>'Активност 1 Роботика и инклузија за основно училиште со STEM',
                '2'=>'Активност 1  Музиката е кодирање',
                '3'=>'Активност 3 Мајсторство и кодирање со  Makey Makey',
                '4'=>'Активност 4 Секојдневен алгоритам за лекција  CLIL'
            ]
        ]
    ],
    'download_video_script' => 'Преземете ја видеоскриптата',
    'ready_to_share' => 'Подготвени сте да го споделите она што го научивте со учениците?',
    'choose_lessons' => 'Изберете еден од плановите за лекција подолу и организирајте активност со учениците.',
    'footer' => [
        'title' => 'Не заборавајте да ја додадете вашата активност на мапата на Неделата на кодирање!',
        'text' => '<p>Лесно може да организирате час во училницата, отворен ден или настан во училиштето. Само најдете датум и регистрирајте ја активноста на <a href="/events">мапата на Неделата на кодирање</a>. Организаторот на секоја активност ќе добие сертификат за учество за својот труд.</p>

<p>Ако сакате да се поврзете со меѓународна група на наставници ентузијасти, придружете се на <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">Групата на Facebook за наставници за Европската недела на кодирањето</a>! За да направите чекор понатаму и да соработувате со други училишта во земјата или во странство - придружете се на <a href="codeweek4all">Предизвикот Code Week 4 All</a>.</p>'
    ]

];