<p><?php

return [

    'learning_bits' => 'Делчиња за учење во неделата на кодирање',
    'title' => 'Бесплатни материјали за обука и онлајн курсеви',
    'text' => '<p>Овде може да најдете бесплатни материјали и ресурси за обука што ќе ви помогнат да започнете и да ја планирате следната иновативна лекција.</p>
<h2 class="subtitle">1. Делчиња за учење во неделата на кодирање</h2>
                    <p>Не е потребно претходно искуство за кодирање или програмирање, а за секој модул се потребно само околу 15 минути да се заврши. Модулите ве запознаваат со клучните концепти поврзани со кодирањето и активностите на компјутерско размислување. Како дополнение, модулите исто така ви даваат практични совети и ви укажуваат како да ги интегрирате концептите во училницата.</p>',
    'text_2' => '<p>Сега откако завршивте со едно или повеќе делчиња за учење во Неделата на кодирање, се надеваме дека се чувствувате доволно креативно да донесете извесна дигитална креативност во училницата и да ја закачите активноста на <a href="/events">Мапата на Неделата на кодирање</a>!</p>

                    <p>Лесно може да организирате час во училницата, отворен ден или настан во училиштето. Само најдете датум и регистрирајте ја активноста на <a href="/events">мапата на Неделата на кодирање</a>. Организаторот на секоја активност ќе добие сертификат за учество за својот труд.</p>

                    <p>Ако сакате да се поврзете со меѓународна група на наставници ентузијасти, придружете се на <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">Групата на Facebook за наставници за Европската недела на кодирањето</a>! За да направите чекор понатаму и да соработувате со други училишта во земјата или во странство - придружете се на <a href="/codeweek4all">Предизвикот Code Week 4 All</a>.</p>',
    'lessons' => [
        '1' => [
            'title' => 'Кодирање без дигитална технологија (без интернет)',
            'author' => 'Од Алесандро Бољоло',
            'text' => '<p>Кодирањето е јазикот на нештата, кој ви овозможува да пишувате програми со кои им овозможуваме нови функционалности на десетици милијарди објекти што може да се програмираат околу нас. Кодирањето е најбрзиот начин за реализирање на идеите и најефективниот начин да се развијат способностите за компјутерско мислење. Сепак, не е исклучиво потребна технологија за да се развие компјутерско мислење. Во поголема мерка, вештините на компјутерско мислење се суштински да се овозможи функционирање на технологијата.</p>

                    <p>Во ова видео, Алесандро Бољоло, професор по Компјутерски системи во Италија и координатор на Европската недела на кодирање, ќе претстави активности на кодирање без интернет што може да се практикуваат без каков било електронски уред. Главната цел на активностите без интернет е да се намалат бариерите на пристапност за да се донесе кодирањето во секое училиште, без оглед на финансирањето и опремата.</p>

                    <p>Активностите на кодирање без интернет ги откриваат компјутерските аспекти на физичкиот свет околу нас.</p>',
            'activities' => [
                '1' => 'Активност 1 - CodyRoby за основно училиште',
                '2' => 'Активност 2 - CodyRoby за почетни години на средно училиште',
                '3' => 'Активност 3 - CodyRoby за средно училиште'
            ]
        ],
        '2' => [
            'title' => 'Компјутерско размислување и решавање проблеми',
            'author' => 'Од Мајлс Бери',
            'text' => '<p>Компјутерското размислување (КР) опишува начин на гледање на проблемите и системите при кој може да се употреби компјутер да ни помогне да ги решиме и разбереме.  Компјутерското размислување не е основно само за развојот на компјутерски програми, туку исто така може да се користи да поддржи решавање проблеми низ сите дисциплини.</p>

                    <p>Може да им предавате КР на учениците така што ќе им укажете да разложат комплексни проблеми во помали (разложување), да препознаваат шаблони (препознавање шаблони), да идентификуваат релевантни детали за решавање проблем (апстракција); или поставување правила или упатства за редоследно следење за да се постигне посакуваниот резултат (дизајн на алгоритам). КР може да се подучува низ различни дисциплини, на пример во математика (да се сфатат правилата за факторирање полиноми од втор ред), литература (разложување на анализата на поемата во анализа на метрика, рима и структура), јазици (наоѓање шаблони во завршните букви на глагол што влијаат на нивното спелување како и промени по времиња) и многу други.</p>

                    <p>Во ова видео, Мајлс Бери, главен предавач на Педагошкиот факултет при Универзитетот Рохамптон во Гилтфорд (Обединето Кралство), ќе го претстави концептот на компјутерско размислување и различните начини кои наставник може да ги интегрира во училница со едноставни игри.</p>',
            'activities' => [
                '1' => 'Активност - Развивање математичко размислување за основно училиште',
                '2' => 'Активност 2 - Запознавање со алгоритми за почетни години во средно училиште',
                '3' => 'Активност 3 - Алгоритми за завршни години во средно училиште'
            ]
        ],
        '3' => [
            'title' => 'Визуелно програмирање - вовед во Scratch',
            'author' => 'Од Марго Тинави',
            'text' => '<p>Визуелното програмирање им овозможува на луѓето да ги опишат процесите со користење на илустрации или графика. Вообичаено зборуваме за визуелното програмирање како спротивност на програмирањето базирано на текст. Јазиците за визуелно програмирање (VPL) се исклучително добро приспособени да воведат алгоритамско размислување за деца (па дури и за возрасни). Со VPL има помалку за читање и нема синтакса за спроведување.</p>

                    <p>Во ова видео, Марго Тинави, наставник за развој на веб во Ле Вагон и коосновач на Techies Lab asbl (Белгија), ќе ви помогне да го откриете Scratch, еден од најпопуларните VPL што се користат насекаде низ светот. Scratch е развиен од MIT во 2002 година и оттогаш околу него се создаде голема заедница, каде што може да најдете милиони проекти што може да ги реплицирате со учениците и безбројни упатства на неколку јазици.</p>

                    <p>Не е потребно да имате искуство со кодирање за да го користите Scratch, а може да го употребувате во секакви различни предмети! На пример, со користење на Scratch како дигитална алатка за раскажување приказни, учениците може да создаваат приказни, да илустрираат математички проблем или да учествуваат во уметнички натпревар за да научат за културното наследство додека учат кодирање и компјутерско размислување, а што е најважно додека се забавуваат.</p>

                    <p>Scratch е бесплатна алатка, многу интуитивна и мотивирачка за учениците. Погледнете го видеото на Марго да научите како да започнете.</p>',
            'activities' => [
                '1' => 'Активност 1 - Основи на Scratch за основно училиште',
                '2' => 'Активност 2 - Основи на Scratch за почетни години во средно училиште',
                '3' => 'Активност 3 - Основи на Scratch за завршни години во средно училиште'
            ]
        ],
        '4' => [
            'title' => 'Креирање едукативни игри со Scratch',
            'author' => 'Од Хесус Морено Леон',
            'text' => '<p>Критичко размислување, истрајност, решавање проблеми, компјутерско размислување и креативност се само некои од клучните вештини што им се потребни на учениците да успеат во XXI век, а кодирањето може да ви помогне да ги постигнете на забавен и мотивирачки начин.</p>

                    <p>Алгоритамските поими за контрола на тек со користење на секвенци на упатства и петелки, прикажување податоци со користење на варијабли и листи или синхронизација на процеси може да звучат како комплицирани концепти, но во ова видео ќе откриете дека тие се полесни да се научат отколку што мислите.</p>

                    <p>Во ова видео, Хесус Морено Леон, наставник по компјутерски науки и истражувач од Шпанија ќе објасни како може да ги развиете овие и други вештини кај учениците додека се забавувате. Како може да се направи ова? Со креирање игра со прашања и одговори во Scratch, најпопуларниот програмски јазик што се користи низ училиштата низ целиот свет. Scratch не само што го збогатува компјутерското размислување, туку исто така дозволува внесување на елементи на дизајнирање игри во училницата за да ја одржи мотивацијата на учениците додека учат и се забавуваат.</p>

                    <p>Погледнете го видеото да научите како да започнете.</p>',
            'activities' => [
                '1' => 'Активност 1 - Игра со прашања и одговори со Scratch за основно училиште',
                '2' => 'Активност 2 - Игра со прашања и одговори со Scratch за почетни години на средно училиште',
                '3' => 'Активност 3 - Игра со прашања и одговори со Scratch за средно училиште'
            ]
        ],
        '5' => [
            'title' => 'Креирање, роботика и поправање во училницата',
            'author' => 'Од Тулиа Уршиц',
            'text' => '<p>Интеграцијата на кодирање, поправање, роботика и микроелектроника како алатки за подучување и учење во наставните програми на училиштата е клучно за образованието од XXI век.</p>

                    <p>Користењето на поправање и роботика во училиштата има многу придобивки за учениците, бидејќи помага да се развијат клучните компетенции како што е решавање проблеми, тимска работа и соработка. Исто така ја зголемува креативноста и сигурноста на учениците и може да им помогне на учениците да изградат истрајност и одлучност кога се соочени со предизвици. Роботиката е исто така поле што промовира инклузивност, бидејќи е лесно достапна за широк спектар на ученици со различни таленти и вештини (и момчиња и девојчиња) и позитивно влијае на учениците со спектар на аутизам.</p>

                    <p>Погледнете го ова видео каде што Тулиа Урштиц, Италијански амбасадор за Scientix и наставник на STEM во Сант\'Aмброџо Ди Валполичела, Италија ќе даде некои практични примери за тоа како наставниците може да го интегрираат поправањето и роботиката во училницата, со тоа трансформирајќи ги пасивните ученици во ентузијастички творци.</p>',
            'activities' => [
                '1' => 'Активност 1 - Како да се направи механичка рака од панел-плоча за основно училиште',
                '2' => 'Активност 2 - Како да се направи механичка или роботска рака за почетни години во средно училиште',
                '3' => 'Активност 3 - Како да се направи механичка или роботска рака за завршни години во средно училиште'
            ]
        ],
        '6' => [
            'title' => 'App Inventor и App Development',
            'author' => 'Од Росана Курер',
            'text' => '<p>Погледнето го оваа видео каде Росана Курер (Основач  CyberWayFinder) објаснува што е  what App, ги прикажува предностите на користењето на App development во училница и дава неколку практични примери како наставниците да ја интегрираат  App Inventor училница, трансформирајќи ги пасивните ученици во ентузијастични креирачи на игри.</p>  
<p>Ние сите користиме апликации кои се погодни и брз начин за коордирање на нашите активности. Тие исто така се повеќе се користат во едукација бидејќи овозможуваат лично учење и им даваат можност на корисниците да добиваат информации, зошто и да не ги оспособуваат учениците да прават една едукативна апликација за другите?</p>',
            'activities' => [
                '1' => 'Активност 1 – Наслов, за Основно Училиште ',
                '2' => 'Активност 2 – Наслов, за Пониско Средно Училиште ',
                '3' => 'Активност 3 – Наслов, за Повисоко Средно Училиште'
            ]
        ],
        '7' => [
            'title' => 'Мајсторство и Правење',
            'author' => 'Од Диого да Силва',
            'text' => '<p>Работите и работните места се менуваат, а едукацијта ги следи нивните чекори. Кога ги подготвувате учениците за кариери во 21-от век, нови вештини како што е мајсторството, правењето и хакирањето се есенцијални, со тоа што го стеснуваат јазот помеѓу училиштето и реалноста. Со трансформирањето на училницата во соработувачка средина која се фокусира во решавање на проблемите, учениците може да се ангажираат и да напредуваат. Овие активности промовираат дискусија, така што овозможуваат училницата да стане место за комуницирање, каде секој придонес е важен.</p> 
<p>Погледнете го видеото подолу, каде португалскиот STEAM (Science, Technology, Engineering, Arts and Mathematics) (Природни науки, Технологија, Инжинерство, Уметност и Математика) наставник Диого да Силва, член на  Escola Global, ве води чекор по чекор во развојот на лекцијата со тоа што вашите ученици ќе мајсторисуваат, праваат и хакираат начин за постигнување на решение.</p>',
            'activities' => [
                '1' => 'Активност 1 – Наслов, за Основно Училиште ',
                '2' => 'Активност 2 – Наслов, за Пониско Средно Училиште ',
                '3' => 'Активност 3 – Наслов, за Повисоко Средно Училиште'
            ]
        ],
        '8' => [
            'title' => 'Кодирање за сите предмети',
            'author' => 'М. Изабел Бланко, М. Концепсија Фернандез, Елисабета Нани, Дебора Кармела Ниута, Стефанија Алтиери',
            'text' => '<p>Кога мислите на кодирање во училница, првата работа која ви доаѓа на памет се компјутерите, технологијата, математиката или науката. Било како, со тоа што учениците имаат повеќе интереси и предмети, зошто да не го користите ова во ваша корист и да спроведувате кодирање во целото планирање?</p> 
<p>Интегрирањето на кодирањето во училница има многу придобивки, тоа помага во равојот на нивното критично размислување и во вештините за решавање на проблемите, да бидат активни корисници и да го водат нивниот процес на учење, кое е есенцијално во училиштата. Било како, најважното нешто е дека вашите ученици ќе учат додека се забавуваат!</p> 
<p>Јазиците, музиката или STEAM (Science, Technology, Engineering, Arts and Mathematics)(Природни науки, Технологија, Инжинерство, Уметност и Математика) се само некои предмети во кои наставниците може да кодираат за нивните идни научници, музичари, уметници, за секого! Сите наставници може да го интегрираат кодирањето и компјутерското размислување во училниците. Користењето на лекција CLIL (Content and Language Integrated Learning)(Интегрирано учење на содржина и на јазик) за објаснување  на секојдневните алгоритми, криеирањето на џојстик на допир за учење на науката или користењето на едукативни роботи за мотивирање во математика се само неколку примери на активности кои може да ги направите во вашата училница.</p>  
<p>Погледнете го видеото подолу за да видите како наставниците по музика, природни науки или јазици може лесно да го интегрираат кодирањето и компјутерското размислување во училница, иако немате претходно искуство.</p>',
            'activities' => [
                '1' => 'Активност 1 Роботика и инклузија за основно училиште со STEM',
                '2' => 'Активност 1  Музиката е кодирање',
                '3' => 'Активност 3 Мајсторство и кодирање со  Makey Makey',
                '4' => 'Активност 4 Секојдневен алгоритам за лекција  CLIL'
            ]
        ],
        '9' => [
            'title' => 'Правење автомат со микро:бит',
            'author' => 'од Паулине Мас',
            'text' => '<p>
                   Користењето микро:бит, лесно програмабилен, џебен компјутер, може да биде забавен и лесен начин за правење интересни креации од роботи до музички инструменти со вашите ученици, додека во исто време ги учите како да кодираат. Тоа е едноставно и лесно за користење дури и за најмалите програмери, додека во исто време доволно силно за понапредни ученици. Може да го вклучите во различни лекции од историја до математика, па дури и наука. Можностите се неограничени. Микро:битот е ангажирачки и евтин начин да се научат учениците за кодирањето додека се воведуваат суштински вештини како што се компјутерското размислување, решавањето проблеми и креативноста.
                   </p>
                   <p>
Во ова видео, Паулине Мас, наставник по компјутерски науки во Koninklijke Visio, ќе го претстави Микро:бит и ќе даде неколку практични примери за тоа како наставниците може да го интегрираат во училницата, трансформирајќи ги пасивните ученици во креатори ентузијасти.                   
                </p>',
            'activities' => [
                '1' => 'Морзеова азбука со микро:бит, за основно училиште',
                '2' => 'Соба за бегство со микро:бит, за пониски години од средно училиште',
                '3' => 'Правење автомат за повисоки години во средно училиште',
            ]
        ],
        '10' => [
            'title' => 'Креативно кодирање со Python',
            'author' => 'од Ивана Везјак',
            'text' => '<p>
Движењето од визуелно кон текст-базирано програмирање е природен тек во програмирањето. Додека визуелното програмирање често е извонредно за почетници, по одредено време, учениците може да бараат нов предизвик. Текст-базираното програмирање е следниот чекор за секој што сака дополнително да се задлабочи во програмирањето и компјутерското размислување. 
                   </p>
                   <p>                   
                   Во ова видео, Ивана Везјак ве воведува во основната синтакса на Python. Python е еден од најпопуларните програмски јазици денес, кој се користи во многу подрачја како наука базирана на податоци, вештачка интелигенција, машинско учење, развој на веб и сл. Додека Python е моќен програмски јазик што се користи од искусни програмери, тој може да се користи дури и од оние без никакво искуство во кодирање поради неговата едноставност и јасна синтакса. 
</p>
<p> 
Со Python, учениците може да креираат квизови за историски настани, да решаваат математички проблеми и да прават симулации во физиката, да креираат игри, да градат веб-страници, да вршат анализи на податоци за научни проекти и многу повеќе. Python има богата и екстензивна стандардна библиотека, голема заедница и голем број упатства и проекти достапни онлајн, кои може да се користат за настава, учење и вежбање. Со кодирање во Python, анализирање програми и поправање грешки, учениците развиваат креативност и учат како да бидат постојани, истрајни и трпеливи. Тие учат вештини на аналитичко размислување и решавање проблеми со разложување комплексни проблеми на помали компоненти. Овие компетенции ќе им помогнат во тоа како им пристапуваат на проблемите во секое друго подрачје од нивните животи.
                </p>',
            'activities' => [
                '1' => 'Мојот прв квиз, за основно училиште',
                '2' => 'Бесилка, за пониски години во средно училиште',
                '3' => 'Погоди го знамето!, за повисоки години во средно училиште',
            ],
            'links' => [
                'title' => 'Други поврзани ресурси',
                '1' => [
                    "url" => "https://docs.python.org/3/library/",
                    "title" => "Стандардна библиотека Python",
                    "description" => "Збирка на претходно изграден код и модули (пр. модул на желка, математички модул и сл.)",
                ],
                '2' => [
                    "url" => "https://codecombat.com/",
                    "title" => "CodeCombat",
                    "description" => "Едукативна видео игра за учење концепти на програмирање.",
                ],
                '3' => [
                    "url" => "https://projects.raspberrypi.org/en/codeclub",
                    "title" => "CodeClub проекти",
                    "description" => "Од почетници до напредни, проекти за програмирање чекор по чекор за деца.",
                ],
                '4' => [
                    "url" => "https://inventwithpython.com/invent4thed/",
                    "title" => "Измислете сопствени компјутерски игри со Python",
                    "description" => "Книга што ќе ве научи како да програмирате ваши сопствени компјутерски игри со Python.",
                ],
                '5' => [
                    "url" => "https://www.codewars.com/",
                    "title" => "CodeWars",
                    "description" => "Едукативна заедница каде што учениците и наставниците може да се обучуваат преку низи на предизвици.",
                ],
                '6' => [
                    "url" => "https://hourofpython.com/",
                    "title" => "Час по Python",
                    "description" => "Збирка на воведни лекции по Python (и текст-базирани и блокови) со користење интерактивен Trinkets.",
                ],
            ]
        ],
        '11' => [
            'title' => 'Кодирање за инклузија',
            'author' => 'од тимот на Неделата на кодирање',
            'text' => '<p>
                   Воведувањето на кодирањето во училницата може да биде предизвик, особено ако имате ученици со одредена попреченост во класот. Но, важно е да се запамети дека секој, без оглед на способностите, може да научи како да кодира. Децата со посебни потреби може да имаат големи придобивки од аспектите на учење на кодирањето, бидејќи тоа ги учи учениците на важни животни вештини, како што се решавање проблеми, организација и независност. Кодирањето, исто така, може да ги подобри меѓучовечките вештини и социјалните вештини преку соработка и тимска работа, вештини кои многу од децата со попреченост тежнеат да ги стекнат. Најважно, учениците се забавуваат додека учат покрај врсниците.
                   </p><p>
Во ова видео, тимот на Неделата на кодирање ќе ви покаже некои практични, лесни и забавни активности на кодирање, особено приспособени за ученици со оштетен вид, Даунов синдром и ученици од спектарот на аутизмот, коишто наставниците може лесно да ги донесат во својата училница.                   
                </p>',
            'activities' => [
                '1' => 'Игра со табла за јајца',
                '2' => 'Многу умен глушец ',
                '3' => 'Ѕвезда што прави ѕвезди ',
            ]
        ],
        "12" => [
            "title" => "Кодирање за целите на одржлив развој",
            "author" => "од Франциско Хавиер Масеро, Кристина Николаита и Ервиола Кономи",
            "text" => [
                "1" => "Традиционалното образование им пружа на учениците малку можности да ги разберат и решат проблемите во реалниот свет, како што се глобалните климатски промени, родовата еднаквост, гладот, сиромаштијата или доброто здравје и благосостојбата.",
                "2" => "Целите за одржлив развој (SDG) се јадрото на Агендата за одржлив развој во 2030 година, усвоена од сите земји-членки на Обединетите нации како патоказ за постигнување мир и просперитет на планетата, поттикнувајќи го глобалниот развој. Наставниците можат да користат SDG во училницата како алатка за учениците да го развиваат своето критичко размислување, но и да им помогнат да го пронајдат својот идентитет и цел. Комбинирањето на основните елементи на кодирање и компјутерско размислување со SDG ќе ја зголеми самодовербата на вашите ученици и ќе им помогне да ја развијат својата креативност, претприемачки дух, решавање на проблеми или комуникациски вештини.",
                "3" => "Во долунаведените активности, учениците ќе ги применат принципите на Scratch, ASCII кодирање и исклученото кодирање, на теми коишто денес се од глобална и социјална важност. Наставниците ќе ја подигнат свеста за целите на одржливиот развој, додека им помагаат да развијат емпатија, активно граѓанство и просоцијални вештини, на забавен и привлечен начин.",
                "4" => "Секој од овие планови за лекции се фокусира на една од целите на SDG:",
                "5" => "Цел на одржлив развој 3: Да се обезбеди здрав живот и да се промовира благосостојба за сите, на сите возрасти ",
                "6" => "Цел на одржлив развој 5: Да се постигне родова еднаквост и да се зајакнат сите жени и девојки ",
                "7" => "Цел на одржлив развој 13: Да се преземат итни активности за борба против климатските промени и нивните влијанија ",
            ],
            "activities" => [
                "1" => "Проект „Каратека“: Запознавање со каратето преку програмирање, за Основно училиште, Долно, Средно и Горно Средно училиште ",
                "2" => "Цели на одржлив развој и кодирање за климатските промени, за Основно училиште",
                "3" => "Кодирање за родова еднаквост, за Горно Средно училиште ",
            ]
        ],

        "13" => [
            "title" => "Вовед на вештачката интелигенција во училницата ",
            "author" => "од Артур Коељо (Artur Coelho) и Марјана Прифти Скендули (Marjana Prifti Skenduli)",
            "text" => [
                "1" => "Вештачката интелигенција (ВИ) има влијание врз многу области од секојдневниот живот: автоматски го корегира текстот што го пишувате на вашиот телефон, ја избира музиката што апликацијата-вашата омилена музика ви ја пушта и ги памти вашите лозинки кога ќе ги заборавите. ВИ се однесува на комбинација на машинско учење, роботика и алгоритми, со апликации во сите области: од компјутерските науки до производството и од медицината до модата. Затоа има непобитно место во нашите животи и во нашите општества и игра клучна улога во развојот на науката. И како и сите други важни феномени во нашите животи, учениците ќе имаат корист, затоа што ќе научат за тоа. Но, како да предавате за толку сложено нешто како што е ВИ?",
                "2" => "Овој дел за учење ќе ви помогне да им објасните на учениците што е тоа ВИ и каква улога таа игра во животот на учениците. Овие активности се дизајнирани за не-експертите да можат лесно да ја разберат содржината и да можат ефикасно да ги разложат сложените термини во лесно разбирливи идеи. Со овие планови за лекции можете да им помогнете на учениците да научат за употреба на ВИ и за некои од механизмите што стојат зад неа. Овие активности се наменети за учениците да ги развиваат своите вештини за аналитичко и критичко размислување: на пример, во активноста на Марјана, учениците развиваат цевковод за класификација. Овие активности исто така ќе им помогнат на учениците да ги разберат различните апликации на ВИ: во активноста на Артур тие ќе научат за врската помеѓу ВИ и уметноста и за тоа како ВИ може да се користи за подобрување на визуелното изразување. Со овие активности, учениците исто така ќе се осврнат на опасностите од ВИ и нејзиното влијание."
            ],
            "activities" => [
                "1" => "Хумана уметност со ВИ, за Основно училиште",
                "2" => "Учење на машините на класифицирање: Вовед во Надгледуваното Машинско учење, за Пониското Средно училиште",
                "3" => "Учење на машините на класифицирање: Вовед во Надгледуваното Машинско учење, з а Повисокото Средно училиште",
            ]
        ],

        '14' => [
            'title' => 'Учење во ерата на интелигентни машини',
            'author' => 'од Адил Тагијан, Џорџија Ласкарис и Марко Нивес',
            'text' => [
                '1' => 'Напредокот на ВИ во последните години беше навистина импресивен, благодарение на брзиот напредок во компјутерската моќ и достапноста на големи количини на податоци. Тоа доведе до значителни инвестиции во истражувањето на ВИ и брзото ширење на ВИ индустријата, правејќи од ВИ голема технолошка револуција на нашето време. ВИ е насекаде околу нас. Таа стана дел од нашата секојдневна рутина во толкава мера, што понекогаш и не помислуваме на неа како на ВИ: ги користиме препораките што ни се дадени преку интернет, како и детектирањето на лицето, системите за безбедност и гласовните асистенти, речиси секој ден. Но, што е со образованието? ',
                '2' => 'ВИ има огромен потенцијал да овозможи нови начини на настава и учење и да го подобри учењето на учениците. Ова парче за учење ќе ви помогне да интегрирате автентични ВИ активности во вашата настава и ќе ви помогне да ги подготвите своите ученици за животот и кариерата во светот којшто е обликуван од ВИ. Овие активности се дизајнирани на тој начин, што кај учениците треба да ги поттикне развојот на нивната љубопитност, решавањето на проблеми и креативните вештини: на пример, во Адиловата активност, учениците учат за алгоритмите и нервните мрежи и се поттикнуваат  да создадат своја сопствена нервна мрежа, за визуелизација на АИ мозокот. Џорџија ќе ги води вашите ученици низ чекор-по-чекор развојот на чет-ботот. Учениците ќе го градат својот сопствен чет-бот, ќе ги подготвуваат збирките на податоци за прашања и одговори и ќе се обучат, за да можат да дадат одговори на прашањата за Ковид-19. Во Марковата активност, учениците ќе ги истражуваат придобивките и предизвиците на употребата на интелигентните машини во секојдневниот живот и работа. Кои се ризиците од ВИ што треба да ги земеме во предвид? Какви влијанија би можела да има ВИ врз иднината на работата? Кои работни места ќе им бидат понудени на учениците, кога во иднина ќе влезат на пазарот на трудот?'
            ],
            'activities' => [
                'title' => 'Преку долунаведените планови за лекции, учениците ќе можат да научат за интелигентните машини, на еден забавен и привлечен начин.',
                '1' => 'ВИ и нејзините нервни мрежи за Основно училиште',
                '2' => 'Мојот Ковид-19 чет-бот, за Пониско средно училиште',
                '3' => 'Живеење во ера на „Паметни машини”: Предизвици и можности за Повисоко средно училиште',
            ]
        ],
        "15" => [
            "title" => "Ископување на медиумска писменост",
            "author" => "од Маријана Смолчец, Теа Хорватиќ и Сања Божиновиќ",
            "text" => [
                "Едукацијата за медиумска писменост никогаш не била поважна за денешните ученици. Учениците од сите возрасти треба да стекнат релевантни вештини, знаења и ставови за да можат да се движат низ нашиот свет полн со медиуми. Вештините за медиумска писменост ќе им помогнат да користат веродостојна содржина на интернет и да препознаваат лажни извори на информации. Ќе научат како да ги проверат информациите што ги наоѓаат на интернет и да ги толкуваат критички. Ќе ја подигнат својата свест за правилна употреба на креативна содржина и ќе го применат наученото при креирање на сопствена креативна содржина.",
                "Оваа лекција ќе ви овозможи да имплементирате разни стратегии и техники за да ги поттикнете вашите ученици да станат медиумски писмени. Во активноста на Маријана, учениците учат како безбедно и одговорно да користат веб-содржина. Се запознаваат со разни видови лиценци и развиваат едноставна апликација за да демонстрираат како правилно да споделуваат креативна работа. Во активноста на Теа, учениците започнуваат потрага да научат за замките за кликање. Преку интерактивни задачи, учениците истражуваат стратегии за идентификување и откривање на замки за кликање и учат како да ги избегнат. Сања им овозможува на учениците да истражуваат и критички да ги анализираат и проценуваат веб-содржините, нивната важност, точност, потекло и цел. Учат како да најдат сигурни извори на интернет и како да препознаат лажни информации на интернет.",
                "Во плановите за лекции подолу, ќе најдете инспиративни и интерактивни активности за подобрување на вештините за медиумакс писменост на учениците:",
            ],
            "activities" => [
                "1" => "Дали е бесплатно ако е на интернет?",
                "2" => "Да се кликне или не",
                "3" => "Проверка на фактите",
            ]
        ],
        "16" => [
            "title" => "РАСКАЖУВАЊЕ ПРИКАЗНИ СО HEDY",
            "author" => "од Фелиен Херманс (Felienne Hermans)",
            "text" => [
                "Дали вашите ученици веќе имаат совладано визуелен програмски јазик, но не се чувствуваат подготвени да навлезат подлабоко во програмски јазик базиран на текст? Тогаш овој дел за учење е само за вас и вашите ученици бидејќи ќе им помогне да го премостат јазот помеѓу визуелниот и програмскиот јазик базиран на текст. Делот за учење <strong>Раскажување приказни со Hedy</strong> се состои од три учебни планови за кои се користи Хеди - постепен програмски јазик за да ги научи децата да програмираат.",

                "Хеди е наменет за деца кои сакаат да започнат со текстуални програмски јазици, но за кои започнувањето со Python сепак може да биде премногу сложено. Постепените јазици користат различни јазични нивоа, каде секое ниво додава нови концепти и синтаксичка сложеност. На крајот од секвенцата на нивоа на Хеди, учениците совладуваат подмножество од синтаксички валиден Python.",

                "Во овој дел за учење ќе најдете инспиративни и привлечни активности кои ќе им помогнат на вашите ученици ефикасно да ги користат програмските јазици базирани на текст. Преку создавање на сопствени интерактивни приказни, тие постепено ќе учат програмирање, без да мора да научат сè одеднаш. Во учебниот план за основно училиште, учениците се запознаваат со основните поими за програмирање. Учебниот план за пониските години од средно училиште воведува понатамошни концепти за програмирање, додека учебниот план за повисоките години од средно образование им овозможува на учениците да програмираат посложени приказни и активности.",

                "Погледнете ја интерактивната приказна подолу за да видите како читателите можат да учествуваат во приказната и како таа го поттикнува нивниот активен ангажман."
            ],
            "activities" => [
                "1" => "Направете своја интерактивна приказна со Hedy за ученици од основно училиште",
                "2" => "Направете своја интерактивна приказна со Hedy за ученици во пониските години од средно училиште",
                "3" => "Направете своја интерактивна приказна со Hedy за ученици во повисоките години од средно училиште",
            ]
        ],
        "17" => [
            "title" => "Почувствувајте го кодот",
            "author" => "од Аленка Миљевиќ",
            "text" => [
                "Општествена и емоционална благосостојба е способноста да се биде флексибилен, да се знае како да се управува со сопствените емоции и да се реагира на емоциите на другите луѓе, да се развијат значајни односи со другите, да се генерираат емоции кои водат до добри чувства и да се креира своја мрежа за емоционална поддршка. Социјалните и емоционалните вештини што младите луѓе ги учат на училиште им помагаат да изградат флексибилност и да постават шема за тоа како ќе управуваат со своето физичко и ментално здравје низ животот. (Совет на Европа)",
                "Делот за учење Почувствувајте го кодот ќе ви овозможи да ги засилите социјалната и емоционалната благосостојба на вашите ученици со препознавање, објаснување, разбирање и реагирање на позитивните и негативните чувства и емоции со цел да се изгради емпатија и флексибилност.  Во овој дел за учење ќе најдете инспиративни и привлечни активности кои ќе им помогнат на вашите ученици да развијат вештини за справување со различни емоции преку кодирање. Вашите ученици ќе научат како да ги изразат своите чувства и како да реагираат на емоциите на нивните соученици, со помошта на Bee-Bot.",
                "Делот за учење Почувствувај го кодот содржи три плана за наставна единица кои користат образовен робот Bee-Bot да креира активности кои ги охрабруваат учениците да зборуваат за емоции и да развијат емпатија. Во планот за наставна единица за основно училиште, учениците програмираат Bee-Bot за да зборуваат за емоции како што се тагата, среќата, стравот и лутината и да ги откријат причините зошто тие и нивните врсници ги чувствуваат овие емоции.  Планот за наставна единица за пониските години од средно училиште ги охрабрува учениците да програмираат Bee-Bot, да ги препознаваат своите и чувствата на врсниците, да разбираат што ги предизвикало и како да одговорат на истите. Планот за наставна единица за повисоките години во средно училиште ги оспособува учениците да управуваат со Bee-Bot и да измислуваат приказни за чувства, флексибилност и емпатија.",
                "Ако немате образовен робот во вашата училница, овој Дел за учење ќе ви обезбеди идеи за активности без интернет кои го засилуваат развојот на социјални и емоционални вештини. Интерактивноста подолу дава краток преглед на активностите што можете да ги направите во вашата училница:"
            ],
            "activities" => [
                "1" => "Кодирај - Чувствувај - Учи за ученици од основни училишта",
                "2" => "Срцето не ми е од камен за ученици во пониски години на средно училиште",
                "3" => "Расположи ме со кодирање за ученици од погорните класови",
            ]
        ],"18" => [

"title" => "SOS Water",
"author" => "од Франциско Делгадо Сесилија",
"text" => [

                "SOS Water е одговор на потребата за справување со проблемот на загадување на водите. Покрај напорите вложени во последните години, сè уште има речиси 2 милијарди луѓе низ светот коишто немаат пристап до безбедна вода за пиење. Тоа значи дека целта за одржлив развој (SDG) 6 од Агендата 2030, кој наведува дека сите луѓе треба да имаат пристап до безбедно регулирана вода и санитарни услови до 2030 е далеку од остварување. Истото е точно за SDG 14, подводен живот, која има за цел да ги заштити и одржливо да ги користи океаните, морињата и морските ресурси за одржлив развој.",

                "Овој дел од учењето се фокусира на релевантниот и актуелниот проблем на мерење на квалитетот на водата и на новите загадувачи коишто го загрозуваат незјиниот квалитет. Учениците ќе имаат можност да истражуваат и да бараат решенија за реалните проблеми поврзани со водата и животната средина, што ќе им овозможи да развијат вештини како што се истражување, критичко размислување и решавање проблеми.",

                "Наставните планови содржат практични и креативни активности како што се, програмирање во Scratch, иницијација за машинско учење и вештачка интелигенција со учење за машинско учење и градење на управувани возила со Lego комплети за земање примероци на вода и анализа на pH на вода. Овие активности ќе им овозможат на учениицте да ги преточат нивните вештини и знаења во пракса во едно интерактивно и разиграно опкружување, што ќе ја зголеми нивната мотивација и интерес за проектот.",

                "За имплементацијата на овој дел од учењето, се предлага трите активности да се развијат на час, да се заврши целиот проект и да се добие позначаен и помотивирачки процес на учење. Сепак, секоја активност може да се реализира и изолирано."

],
"activities" => [
                "1" => "SOS Water со Scratch",
                "2" => "SOS Water со машинско учење",
                "3" => "SOS Water со роботика",
            ]

        ],



    ],
    'download_video_script' => 'Преземете ја видеоскриптата',
    'ready_to_share' => 'Подготвени сте да го споделите она што го научивте со учениците?',
    'choose_lessons' => 'Изберете еден од плановите за лекција подолу и организирајте активност со учениците.',
    'footer' => [
        'title' => 'Не заборавајте да ја додадете вашата активност на мапата на Неделата на кодирање!',
        'text' => '<p>Лесно може да организирате час во училницата, отворен ден или настан во училиштето. Само најдете датум и регистрирајте ја активноста на <a href="/events">мапата на Неделата на кодирање</a>. Организаторот на секоја активност ќе добие сертификат за учество за својот труд.</p>

<p>Ако сакате да се поврзете со меѓународна група на наставници ентузијасти, придружете се на <a href="https://www.facebook.com/groups/774720866253044/?source_id=377506999042215">Групата на Facebook за наставници за Европската недела на кодирањето</a>! За да направите чекор понатаму и да соработувате со други училишта во земјата или во странство - придружете се на <a href="/codeweek4all">Предизвикот Code Week 4 All</a>.</p>'
    ]

];
