<?php


return [
    'title' => 'Изјава за вредностите на Европската недела на кодирање',
    'description' => [
        1 =>
            [
                1 => 'Европска недела на кодирање е движење предводено од волонтери –',
                2 => 'амбасадори',
                3 => ', водечки наставници и ентузијасти за кодирање од цел свет. Поддржана е од',
                4 => 'Eвропската комисија',
                5 => 'и министерствата за образование од Европската Унија и земјите од Западен Балкан.',
            ],

        2 => 'Срцето на Европската недела на кодирање е заедницата организатори на волонтерски активности која се состои од наставници, ментори, клубови за кодирање, библиотеки, приватни компании, родители и невладини организации. Го посветуваме нашето време, енергија и вештини за да ги приближиме компјутерското размислување, кодирањето, роботиката, чепкањето на хардверот, компјутерските науки и дигиталните вештини до што е можно повеќе луѓе во Европа и светот.',
        3 => 'Европската недела на кодирање, исто така, се и милионите учесници, кои се луѓе од најразличен пол, возраст, потекло, култура и вештини од цел свет.',
        4 => 'Горди сме што сме дел од Европската недела на кодирање. Ова се нашите вредности. Во работата и при носењето одлуки постојано се водиме по нив.',
    ],
    '1' => [
        'title' => 'Европската недела на кодирање е независна',
        'content' => 'Европската недела на кодирање е заедница предводена од волонтери. Не дејствуваме поради економски интереси. Ги почитуваме и цениме идеите, верувањата и културата на другите луѓе. Учествуваме во Европската недела на кодирање бидејќи веруваме дека тоа што го правиме е важно. Тоа е нашата силна страна. Сакаме да ги направиме компјутерското размислување, кодирањето, програмирањето, компјутерските науки, роботиката, чепкањето во хардверот и дигиталните вештини достапни до сите.',
    ],
    '2' => [
        'title' => 'Европската недела на кодирање е за секој',
        'content' => 'Секој може да организира активности во Европската недела на кодирање. Според нас од суштинска важност е настаните од Европската недела на кодирање да се организираат за секој без разлика на возраста, бојата, полот, културната припадност или интелектуалните капацитети. Активностите може да поттикнат интерес и љубопитност или да помогнат за уште поголем развој на вештините. Нашите начела се еднаквост, почитување, слобода и инклузивност. Сакаме сите учесници да ја искусат техологијата и да создаваат користејќи ја на забавен начин.',
    ],
    '3' => [
        'title' => 'Европската недела на кодирање е глокална',
        'content' =>
            [
                1 => 'Европската недела на кодирање има амбиција да допре до вас без разлика дали живеете во метропола, регионален голем град или во далечно село. Особено внимание посветуваме на поддршка на локалните организатори преку обезбедување',
                2 => 'материјали',
                3 => 'на нивниот јазик и заради задоволување на нивните потреби.',
                4 => 'Мапата на Европската недела на кодирање',
                5 => 'е клучната алатка каде што се регистрира секоја активност и каде што има прецизна локација. Истовремено, Европската недела на кодирање е глобална и во неа се добредојдени луѓе од сите страни на светот. Ние сме „глокални“.',
            ]
    ],
    '4' => [
        'title' => 'Европската недела на кодирање е за соработка',
        'content' => [
            1 => 'Членовите на заедницата од Европската недела на кодирање комуницираат, разменуваат информации, меѓусебно учат и заедно создаваат знаење. Меѓусебно сме поврзани и се поддржуваме. Ги споделуваме ресурсите, идеите и најдобрите практики. Поттикнуваме партнерства и споделување знаења.',
            2 => 'Предизвикот на Европската недела на кодирање за сите',
            3 => 'има за цел да изгради мостови меѓу границите и заедниците. Помага за ширење позитивна енергија и ги поврзува луѓето кои може да учат едни од други.'
        ]
    ],
    '5' => [
        'title' => 'Европската недела на кодирање е непрофитабилна',
        'content' =>
            [
                1 => 'Сите активности од Неделата на кодирање се непрофитабилни. Сите',
                2 => 'ресурси',
                3 => 'на веб-страницата на Европската недела на кодирање се бесплатни. Сите обуки и онлајн курсеви на Европската недела на кодирање се бесплатни.'
            ]
    ],
    '6' => [
        'title' => 'Европската недела на кодирање поттикнува креативност и иновации',
        'content' => 'Европската недела на кодирање поттикнува креативност, иновации и напредно размислување. Отворени сме и благодарни за повратни информации и критики за да може да носиме информирани одлуки и да ја развиваме Европската недела на кодирање. Дури и неуспесите ќе ни помогнат да растеме и како поединци и како заедница. '
    ],
    '7' => [
        'title' => 'Европската недела на кодирање ѝ е благодарна на заедницата ',
        'content' => 'Благодарни сме за поддршката од наставниците, обучувачите и другите организатори на активности, учениците, родителите, клубовите за кодирање и сите партнери со коишто соработуваме. Сите ја имаме истата цел. Сакаме да ги приближиме компјутерското размислување, кодирањето, компјутерските науки и дигиталните вештини до што е можно повеќе луѓе.'
    ],

];
