<?php

return [
    "titles" => [
        "Зошто кодирање?",
        "Станува збор за оживување на идеите",
        "Исто така, станува збор за развој на клучни компетенции",
        "И на крај, станува збор за обликување на нашата иднина",
    ],
    "texts" => [
        "Станува збор за Пиа, која се чувствуваше како да мора да студира право, иако отсекогаш уживала во математиката и играњето со компјутери. Станува збор за Марк, кој има идеја за подобра социјална мрежа, но не знае како самостојно да ја изгради. Станува збор за Алис, која сонува да прави роботи бидејќи нејзините родители не и дозволуваат да има мачка.  И за вас кои веќе помагате овие соништа да се остварат.",
        "Всушност, станува збор за сите нас и за тоа како ги обликуваме нашите животи и нашата иднина.  Можеме подобро отколку само да споделуваме и лајкуваме објави.  Можеме да ги оживееме нашите идеи, да изградиме нешта кои ќе им донесат радост на другите.Всушност, станува збор за сите нас и за тоа како ги обликуваме нашите животи и нашата иднина.  Можеме подобро отколку само да споделуваме и лајкуваме објави.  Можеме да ги оживееме нашите идеи, да изградиме нешта кои ќе им донесат радост на другите.",
        "Никогаш не било полесно да развиете апликација, да изградите свој робот или кој знае - дури и да измислите летечки автомобил!  Не е удобно патување, но сепак е патување полно со креативни предизвици, многу забава и заедница зад вас која ви пружа поддршка. Дали сте подготвени да го прифатите предизвикот и да станете дигитален творец?",
        "Програмските јазици се како и секој друг јазик. Само во овој случај, децата не учат да се изразуваат и да комуницираат со други луѓе.  Наместо тоа, тие почнуваат да разбираат како да комуницираат со технологијата.  Технологијата којашто е насекаде околу нас - во нашите паметни телефони, компјутери, возила, насекаде!",
        "Но, разбирањето и комуникацијата со компјутерите е само дел од тоа. Кодирањето исто така помага и во развивањето на мултидисциплинарни компетенции, како што се компјутерско размислување, решавање проблеми, креативност и тимска работа - одлични вештини за сите професии. Способноста за решавање проблеми, справување со неуспех и  повторно обидување или соработка со други, се одлики што се бараат во многу полиња.",
        "Пред еден век, програмските јазици дури и не постоеја. Денес, кодот е насекаде околу нас и скоро сè може да се програмира - дури и чевли или кутии со житарици!  Тогаш зошто да им дозволиме на другите да ја обликуваат нашата иднина кога можеме да станеме креатори и да ги реализираме своите визии и идеи? На крајот, единствената граница е нашата имагинација.",
        "Алесандро Бољиоло, координаторот на тимот амбасадори волонтери на Европската неделата на кодирање, рече:",
        "Од почетокот на времето, направивме многу работи користејќи камен, железо, хартија и молив коишто ги трансформираа нашите животи. Сега живееме во друга ера каде нашиот свет се обликува преку кодот.  Различни ери бараат различни работи и вештини.  За време на Европската неделата на кодирање, сакаме на секој Европеец да му дадеме можност да открие  што е тоа кодирање и да се забавува со него.  Ајде да научиме кодирање за да ја обликуваме нашата иднина",
        "Конечно, програмирањето е барана вештина во скоро секоја индустрија - не само во технологијата, туку и во финансиите, здравството, науката, дури и дизајнот или земјоделството, а побарувачката само станува поголема.  Децата кои знаат да кодираат, кои разбираат како функционира технологијата, имаат одредена предност, без оглед на тоа кој пат на кариера ќе изберат на крајот.",
        "Се чувствувате инспирирано?",
        "Придружете се на Европската неделата на кодирање!",
        "Ви требаат повеќе теми за размислување?",
        "Посетете го нашиот блог за повеќе."
    ],
];

