<?php

/*
   |--------------------------------------------------------------------------
   | Base Language Lines
   |--------------------------------------------------------------------------
   |
   | The following language lines contain the default labels.
   |
   */

return [
    'languages' => [
        'en' => 'ΑΓΓΛΙΚΑ',
        'fr' => 'ΓΑΛΛΙΚΑ',
        'bg' => 'ΒΟΥΛΓΑΡΙΚΑ',
        'mt' => 'ΜΑΛΤΕΖΙΚΑ',
        'hr' => 'ΚΡΟΑΤΙΚΑ',
        'de' => 'ΓΕΡΜΑΝΙΚΑ',
        'pl' => 'ΠΟΛΩΝΙΚΑ',
        'cs' => 'ΤΣΕΧΙΚΑ',
        'el' => 'ΕΛΛΗΝΙΚΑ',
        'pt' => 'ΠΟΡΤΟΓΑΛΙΚΑ',
        'da' => 'Δανικά',
        'hu' => 'ΟΥΓΓΡΙΚΑ',
        'ro' => 'ΡΟΥΜΑΝΙΚΑ',
        'nl' => 'ΟΛΛΑΝΔΙΚΑ',
        'ga' => 'ΙΡΛΑΝΔΙΚΑ',
        'sk' => 'ΣΛΟΒΑΚΙΚΑ',
        'it' => 'ΙΤΑΛΙΚΑ',
        'sl' => 'ΣΛΟΒΕΝΙΚΑ',
        'et' => 'ΕΣΘΟΝΙΚΑ',
        'lv' => 'ΛΕΤΟΝΙΚΑ',
        'es' => 'ΙΣΠΑΝΙΚΑ',
        'fi' => 'ΦΙΝΛΑΝΔΙΚΑ',
        'lt' => 'ΛΙΘΟΥΑΝΙΚΑ',
        'se' => 'ΣΟΥΗΔΙΚΑ',
        'sv' => 'ΣΟΥΗΔΙΚΑ',
        'al' => 'ΑΛΒΑΝΙΚΑ',
        'ba' => 'ΒΟΣΝΙΑΚΑ',
        'mk' => 'Μακεδονικά',
        'me' => 'ΜΑΥΡΟΒΟΥΝΙΑΚΑ',
        'rs' => 'ΣΕΡΒΙΚΑ',
        'tr' => 'Τουρκικά',
    ],

    'resources_local_title' => 'Πόροι για τον προγραμματισμό από',
    'days' => 'Ημέρες',
    'hours' => 'Ώρες',
    'minutes' => 'Λεπτά',
    'seconds' => 'Δευτερόλεπτα',

    'still_have_question' => 'Έχεις κι άλλη ερώτηση;',
    'drop_us_a_line' => 'Απλώς γράψε μας!',
    'get_in_touch' => 'ΕΠΙΚΟΙΝΩΝΙΑ',
    'footer_msg' => 'Ένα κίνημα βάσης που το διαχειρίζονται εθελοντές και το υποστηρίζει η Ευρωπαϊκή Επιτροπή.',

    'email' => 'Email',
    'display_email' => 'Προβολή email',
    'first_name' => 'Όνομα',
    'last_name' => 'Επίθετο',
    'your_website' => 'Ο ιστότοπός σου',
    'biography' => 'Βιογραφία',
    'update' => 'Ενημέρωση',
    'delete' => 'Διαγραφή',
    'choose a file' => 'Επιλέξτε αρχείο',

    'learning_bits' => 'Εκπαιδευτικά προγράμματα',
    'codeweek' => 'CodeWeek',
    'bring_codeweek_to_your_students' => 'Μίλησε στους μαθητές για την εβδομάδα προγραμματισμού',
    'or' => 'ή',
    'newsletter' => 'Ενημερωτικό Δελτίο',
];
