<?php

return [
    'title' => 'ΠΡΟΣΤΑΣΙΑ ΤΩΝ ΠΡΟΣΩΠΙΚΩΝ ΣΑΣ ΔΕΔΟΜΕΝΩΝ',
    '1-intro' => [
        'title' => '1. Εισαγωγή',
        'items' => [
            '1' => '<p>Η Ευρωπαϊκή Επιτροπή (εφεξής η «Επιτροπή») δεσμεύεται να προστατεύει τα προσωπικά σας δεδομένα και να σέβεται την ιδιωτικότητά σας. Η Επιτροπή συλλέγει και επεξεργάζεται περαιτέρω τα προσωπικά δεδομένα σύμφωνα με τον κανονισμό (ΕΕ) 2018/1725 του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου, της 23ης Οκτωβρίου 2018, για την προστασία των φυσικών προσώπων έναντι της επεξεργασίας δεδομένων προσωπικού χαρακτήρα από τα θεσμικά και λοιπά όργανα και τους οργανισμούς της Ένωσης και την ελεύθερη κυκλοφορία των δεδομένων αυτών [κατάργηση του κανονισμού (ΕΚ) αριθ. 45/2001].</p>',
            '2' => '<p>Αυτή η δήλωση προστασίας προσωπικών δεδομένων εξηγεί τον λόγο συλλογής και επεξεργασίας, τον τρόπο με τον οποίο συλλέγουμε, χειριζόμαστε και διασφαλίζουμε την προστασία όλων των προσωπικών δεδομένων που παρέχονται, τον τρόπο χρήσης αυτών των πληροφοριών και τα δικαιώματα που μπορείτε να ασκείτε σε σχέση με τα προσωπικά σας δεδομένα (δικαίωμα πρόσβασης, διόρθωσης, αποκλεισμού, κ.λπ.). Επίσης, ορίζει τα στοιχεία επικοινωνίας του αρμόδιου υπεύθυνου επεξεργασίας δεδομένων με τον οποίο μπορείτε να ασκήσετε τα δικαιώματά σας, του υπεύθυνου προστασίας δεδομένων και του Ευρωπαίου Επόπτη Προστασίας Δεδομένων.</p>',
            '3' => '<p>Αυτή η δήλωση προστασίας προσωπικών δεδομένων αφορά τη συλλογή και τη δημοσίευση προσωπικών δεδομένων στον ιστότοπο Codeweek.eu που είναι προσβάσιμος από το κοινό, ατόμων που λειτουργούν ως σημεία επαφής για τις δραστηριότητες της Ευρωπαϊκής Εβδομάδας Προγραμματισμού (πρέσβεις της Εβδομάδας Προγραμματισμού, συντονιστές του Υπουργείου Παιδείας, επικεφαλής εκπαιδευτικοί, καθώς και διοργανωτές δραστηριοτήτων και εκδηλώσεων).</p>',
        ],
    ],
    '2-why' => [
        'title' => '2. Γιατί επεξεργαζόμαστε τα δεδομένα σας;',
        'items' => [
            '1' => '<p>Η Ευρωπαϊκή Επιτροπή συλλέγει και δημοσιεύει τα προσωπικά σας στοιχεία για να διευκολύνει τον εντοπισμό των σημείων επαφής από ενδιαφερόμενους φορείς ή ενδιαφερόμενους πολίτες. Η παροχή πραγματικών προσώπων ως σημείων επαφής είναι ο καλύτερος και αποτελεσματικότερος τρόπος για να εξασφαλιστεί ότι οι ενδιαφερόμενοι μπορούν να έρθουν σε επαφή με τις υπηρεσίες της Επιτροπής.</p>',
            '2' => '<p>Τα προσωπικά σας δεδομένα δεν θα χρησιμοποιηθούν για οποιαδήποτε αυτοματοποιημένη λήψη αποφάσεων, συμπεριλαμβανομένης της δημιουργίας προφίλ.</p>',
        ],
    ],
    '3-legal_process' => [
        'title' => '3. Βάσει ποιου νομικού λόγου/ποιων νομικών λόγων επεξεργαζόμαστε τα προσωπικά σας δεδομένα',
        'items' => [
            '1' => '<p>Οι διαδικασίες επεξεργασίας προσωπικών δεδομένων για τη δημοσίευση σημείων επαφής είναι νόμιμες βάσει του άρθρου 5 παράγραφος 1 στοιχείο δ) του κανονισμού (ΕΕ) 2018/1725 επειδή δώσατε τη συγκατάθεσή σας για την επεξεργασία των προσωπικών σας δεδομένων μέσω φόρμας ιστού ή όταν συμφωνήσατε να χρησιμοποιούμε το ηλεκτρονικό σας ταχυδρομείο και το όνομα χρήστη σας, εάν έχετε εγγραφεί σε κάποιο κοινωνικό δίκτυο.</p>',
        ],
    ],
    '4-collect_data' => [
        'title' => '4. Ποια προσωπικά δεδομένα συλλέγουμε και επεξεργαζόμαστε περαιτέρω;',
        'items' => [
            '1' => '<p>Τα προσωπικά δεδομένα που συλλέγονται είναι πληροφορίες που διευκολύνουν την αναγνώρισή σας ως σημείου επαφής και αυξάνουν την προβολή σας για το κοινό, πιο συγκεκριμένα: τίτλος, όνομα, επώνυμο, θέση, επαγγελματικές ταχυδρομικές και ηλεκτρονικές διευθύνσεις, αριθμός τηλεφώνου, φωτογραφία, λογαριασμός σε μέσα κοινωνικής δικτύωσης, βιογραφικό.</p>',
            '2' => '<p>Παρείχατε αυτά τα προσωπικά σας δεδομένα εθελοντικά, συμπληρώνοντας τη φόρμα αίτησης.</p>',
            '3' => '<p>Η παροχή ορισμένων προσωπικών δεδομένων είναι υποχρεωτική για τη δημοσίευση δραστηριοτήτων ή/και στοιχείων επικοινωνίας στον ιστότοπο codeweek.eu. Αν δεν παρέχετε τα προσωπικά σας δεδομένα, η δραστηριότητά σας δεν θα δημοσιευθεί ή και δεν θα μπορείτε να λάβετε μέρος στα προαναφερθέντα δίκτυα.</p>',
            '4' => '<p>Παρέχετε όλα τα άλλα προσωπικά δεδομένα σε εθελοντική βάση.</p>',
            '5' => 'Όταν εγγραφείτε στο ενημερωτικό δελτίο μας, η διεύθυνση ηλεκτρονικού ταχυδρομείου σας προστίθεται στη λίστα αλληλογραφίας ενημερωτικών δελτίων της EU Code Week, την οποία διαχειρίζεται η Mailerlite.com. Διαβάστε την πολιτική απορρήτου της Mailerlite: https://www.mailerlite.com/legal/privacy-policy. Μπορείτε να ανακαλέσετε τη συγκατάθεση αυτή ανά πάσα στιγμή, χρησιμοποιώντας το σύνδεσμο "unsubscribe" (κατάργηση εγγραφής)  στα μηνύματα ηλεκτρονικού ταχυδρομείου που λαμβάνετε από εμάς ή μπορείτε να μας στείλετε ένα μήνυμα ηλεκτρονικού ταχυδρομείου στη διεύθυνση info@codeweek.eu με την "Κατάργηση εγγραφής" στη γραμμή θέματος.',
        ],
    ],
    '5-how_long' => [
        'title' => '5. Πόσο καιρό διατηρούμε τα προσωπικά σας δεδομένα;',
        'items' => [
            '1' => '<p>Η Επιτροπή διατηρεί τα προσωπικά σας δεδομένα μόνο για το χρονικό διάστημα που απαιτείται για την εκπλήρωση του σκοπού της συλλογής ή της περαιτέρω επεξεργασίας που περιγράφεται στο σημείο 2, δηλαδή για όσο διάστημα είστε σημείο επαφής.</p>',
            '2' => '<p>Τα προσωπικά σας δεδομένα θα αφαιρεθούν από τον δημόσια διαθέσιμο ιστότοπο, αμέσως μόλις σταματήσετε να είστε σημείο επαφής, εκτός εάν έχετε συμφωνήσει να συμπεριληφθείτε στη βάση δεδομένων για μελλοντικές δραστηριότητες.</p>',
        ],
    ],
    '6-protect_data' => [
        'title' => '6. Πώς προστατεύουμε και διαφυλάσσουμε τα προσωπικά σας δεδομένα;',
        'items' => [
            '1' => '<p>Όλα τα προσωπικά δεδομένα σε ηλεκτρονική μορφή (ηλεκτρονικά μηνύματα, έγγραφα, βάσεις δεδομένων, δέσμες δεδομένων που έχουν μεταφορτωθεί, κ.λπ.) αποθηκεύονται είτε στους διακομιστές της Ευρωπαϊκής Επιτροπής είτε των αναδόχων της. Όλες οι πράξεις επεξεργασίας διεξάγονται σύμφωνα με την απόφαση της Επιτροπής (ΕΕ, Ευρατόμ) 2017/46, της 10ης Ιανουαρίου 2017, σχετικά με την ασφάλεια των συστημάτων επικοινωνίας και πληροφοριών στην Ευρωπαϊκή Επιτροπή.</p>',
            '2' => '<p>Οι ανάδοχοι της Επιτροπής δεσμεύονται από ειδική συμβατική ρήτρα για οποιεσδήποτε πράξεις επεξεργασίας των δεδομένων σας εξ ονόματος της Επιτροπής, καθώς και από τις υποχρεώσεις εμπιστευτικότητας που απορρέουν από τη μεταφορά του γενικού κανονισμού για την προστασία των δεδομένων στα κράτη μέλη της ΕΕ [κανονισμός «ΓΚΠΔ» (ΕΕ) 2016/679].</p>',
            '3' => '<p>Για την προστασία των προσωπικών σας δεδομένων, η Επιτροπή έχει θέσει σε εφαρμογή ορισμένα τεχνικά και οργανωτικά μέτρα. Τα τεχνικά μέτρα περιλαμβάνουν κατάλληλες ενέργειες για την αντιμετώπιση της ασφάλειας στο διαδίκτυο, του κινδύνου απώλειας δεδομένων, της αλλοίωσης δεδομένων ή της μη εξουσιοδοτημένης πρόσβασης, λαμβάνοντας υπόψη τον κίνδυνο που ενέχει η επεξεργασία και η φύση των προσωπικών δεδομένων που τυγχάνουν επεξεργασίας. Τα οργανωτικά μέτρα περιλαμβάνουν περιορισμό της πρόσβασης στα προσωπικά δεδομένα μόνο σε εξουσιοδοτημένα πρόσωπα που έχουν νόμιμη ανάγκη να γνωρίζουν, για τους σκοπούς της εν λόγω πράξης επεξεργασίας.</p>',
        ],
    ],
    '7-access_data' => [
        'title' => '7. Ποιος έχει πρόσβαση στα δεδομένα σας και σε ποιον κοινοποιούνται;',
        'items' => [
            '1' => '<p>Η πρόσβαση στα προσωπικά σας δεδομένα παρέχεται στο προσωπικό της Επιτροπής που είναι υπεύθυνο για τη διεξαγωγή αυτής της επεξεργασίας και στο εξουσιοδοτημένο προσωπικό σύμφωνα με την αρχή της «ανάγκης για γνώση». Το εν λόγω προσωπικό συμμορφώνεται με τις νομικές και, εφόσον απαιτείται, πρόσθετες συμφωνίες εμπιστευτικότητας.</p>',
            '2' => '<p>Συγκεκριμένα, σε όλα τα προσωπικά δεδομένα που παρέχονται από εσάς μπορούν να έχουν πρόσβαση οι διαχειριστές των ιστοτόπων (προσωπικό της Επιτροπής), καθώς και άλλοι υπάλληλοι της Επιτροπής με βάση την «ανάγκη για γνώση».. Επιπλέον, τα προσωπικά σας στοιχεία και οι πληροφορίες για εκδηλώσεις θα κοινοποιηθούν στα μέλη των δικτύων πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού και των εκπαιδευτικών συντονιστών για τη διοργάνωση τοπικών δραστηριοτήτων ή για μελλοντικές δράσεις.</p>',
            '3' => '<p>Προκειμένου να αυξηθεί η προβολή των σημείων επαφής, τα προσωπικά σας δεδομένα δημοσιεύονται χωρίς περιορισμό πρόσβασης στον δημόσιο ιστότοπο: https://codeweek.eu.</p>',
            '4' => '<p><i>Σχετικά με τη μεταφορά δεδομένων σε τρίτους</i></p>',
            '5' => '<p>Οι πληροφορίες που συλλέγουμε δεν θα δοθούν σε τρίτους, παρά μόνο στον βαθμό και τον σκοπό για τον οποίο ενδέχεται να μας ζητηθεί από τον νόμο.</p>',
        ],
    ],
    '8-rights' => [
        'title' => '8. Ποια είναι τα δικαιώματά σας και πώς μπορείτε να τα ασκήσετε;',
        'items' => [
            '1' => '<p>Έχετε συγκεκριμένα δικαιώματα ως «υποκείμενο δεδομένων» σύμφωνα με το κεφάλαιο III (άρθρα 14-25) του κανονισμού (ΕΕ) 2018/1725, ιδίως το δικαίωμα πρόσβασης, διόρθωσης ή διαγραφής των προσωπικών σας δεδομένων και το δικαίωμα περιορισμού της επεξεργασίας των προσωπικών δεδομένων σας. Σε ορισμένες περιπτώσεις, έχετε επίσης το δικαίωμα εναντίωσης στην επεξεργασία ή το δικαίωμα στη φορητότητα των δεδομένων.</p>',
            '2' => '<p>Έχετε συναινέσει να παρέχετε τα προσωπικά σας δεδομένα σε εμάς για την παρούσα πράξη επεξεργασίας και μπορείτε να ανακαλέσετε τη συγκατάθεσή σας ανά πάσα στιγμή, ειδοποιώντας τον υπεύθυνο επεξεργασίας δεδομένων. Η ανάκληση της συγκατάθεσης δεν θα επηρεάσει τη νομιμότητα της επεξεργασίας που πραγματοποιήθηκε πριν από την ανάκληση της συγκατάθεσης.</p>',
            '3' => '<p>Μπορείτε να ασκήσετε τα δικαιώματά σας, επικοινωνώντας με τον υπεύθυνο επεξεργασίας δεδομένων ή, σε περίπτωση διαμάχης, με τον υπεύθυνο προστασίας δεδομένων. Εάν είναι απαραίτητο, μπορείτε επίσης να απευθυνθείτε στον Ευρωπαίο Επόπτη Προστασίας Δεδομένων. Τα στοιχεία επικοινωνίας τους δίνονται στην ενότητα 9 παρακάτω.</p>',
        ],
    ],
    '9-contact' => [
        'title' => '9. Στοιχεία επικοινωνίας',
        'data-controller' => [
            'title' => '-Ο υπεύθυνος επεξεργασίας δεδομένων',
            'text' => '<p>Εάν επιθυμείτε να ασκήσετε τα δικαιώματά σας σύμφωνα με τον Κανονισμό (ΕΕ) 2018/1725 ή αν έχετε παρατηρήσεις, ερωτήσεις ή ανησυχίες ή αν θέλετε να υποβάλετε μια καταγγελία σχετικά με τη συλλογή και χρήση των προσωπικών σας δεδομένων, επικοινωνήστε με τον υπεύθυνο επεξεργασίας δεδομένων,</p>',
            'address' => 'Γενική Διεύθυνση Επικοινωνιακών Δικτύων, Περιεχομένου και Τεχνολογιών, Μονάδα G2<br> Κτίριο BU25<br> B-1049 Βρυξέλλες<br> ',
            'email' => 'Ηλεκτρονικό ταχυδρομείο: ',
        ],
        'data-protection-officer' => [
            'title' => '-Ο υπεύθυνος προστασίας δεδομένων της Επιτροπής',
            'text' => '<p>Μπορείτε να επικοινωνήσετε με τον υπεύθυνο προστασίας δεδομένων (<a href="mailto:DATA-PROTECTION-OFFICER@ec.europa.eu">DATA-PROTECTION-OFFICER@ec.europa.eu</a>) σχετικά με θέματα που αφορούν την επεξεργασία των προσωπικών σας δεδομένων σύμφωνα με τον κανονισμό (ΕΕ) 2018/1725.</p>',
        ],
        'european-data-protection' => [
            'title' => '-Ο Ευρωπαίος Επόπτης Προστασίας Δεδομένων (ΕΕΠΔ)',
            'text' => '<p>Έχετε δικαίωμα προσφυγής (δηλ. μπορείτε να υποβάλετε καταγγελία) στον Ευρωπαίο Επόπτη Προστασίας Δεδομένων (<a href="mailto:edps@edps.europa.eu">edps@edps.europa.eu</a>) εάν θεωρήσετε ότι παραβιάστηκαν τα δικαιώματά σας βάσει του κανονισμού (ΕΕ) 2018/1725, ως αποτέλεσμα της επεξεργασίας των προσωπικών σας δεδομένων από τον υπεύθυνο επεξεργασίας δεδομένων.</p>',
        ],
    ],
];
