@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>ΣΧΕΤΙΚΑ ΜΕ ΤΗΝ ΕΒΔΟΜΑΔΑ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ</h1><span></span></div>

                    <hr>


                    <p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού του 2018 θα πραγματοποιηθεί από τις <strong>6 έως τις 21 Οκτωβρίου</strong>.</p>

                    <p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα βάσης που προωθεί τη δημιουργικότητα, την επίλυση προβλημάτων και τη συνεργασία μέσω του προγραμματισμού και άλλων δραστηριοτήτων του τομέα της τεχνολογίας. Η πρωτοβουλία στόχο έχει να προβληθεί ο προγραμματισμός, να παρουσιάσουμε στους νέους, στους ενήλικες και στα άτομα μεγαλύτερης ηλικίας πώς μπορείς να δώσεις πνοή στις ιδέες σου μέσω της συγγραφής κώδικα, να απομυθοποιηθούν οι σχετικές δεξιότητες και να έρθουν πιο κοντά ενδιαφερόμενα άτομα για να αυξήσουν τις γνώσεις τους.</p>

                    <h2>Τη διαχείριση έχουν αναλάβει εθελοντές.</h2>

                    <p>Την Ευρωπαϊκή Εβδομάδα Προγραμματισμού διαχειρίζονται εθελοντές. Ένας ή περισσότεροι <a href="/ambassadors">Πρέσβεις της Εβδομάδας Προγραμματισμού</a> συντονίζουν την πρωτοβουλία στις χώρες τους, όμως μπορεί ο καθένας να διοργανώσει τη δική του δραστηριότητα και να την προσθέσει στον χάρτη του ιστότοπου <a href="/">codeweek.eu</a>.</p>

                    <h2>Με τη στήριξη της Ευρωπαϊκής Επιτροπής</h2>

                    <p>Η Ευρωπαϊκή Ευρωπαϊκή Εβδομάδα Προγραμματισμού ξεκίνησε το 2013 από τους νεαρούς συμβούλους για το ψηφιακό θεματολόγιο για την Ευρώπη. Η Ευρωπαϊκή Επιτροπή στηρίζει την Ευρωπαϊκή Εβδομάδα Προγραμματισμού, ως τμήμα της στρατηγικής της για μια <a href="http://ec.europa.eu/priorities/digital-single-market/">ψηφιακή ενιαία αγορά</a>. Στο <a href="https://ec.europa.eu/education/initiatives/european-education-area/digital-education-action-plan_en">σχέδιο δράσης για την ψηφιακή εκπαίδευση</a> η Επιτροπή ενθαρρύνει ιδιαιτέρως τα σχολεία να συμμετάσχουν στην πρωτοβουλία. Ο στόχος είναι η πρωτοβουλία να φτάσει στο 50% όλων των σχολείων στην Ευρώπη έως το 2020.</p>

                    <h2>Σχολεία</h2>

                    <p>Τα σχολεία σε όλες τις βαθμίδες και οι δάσκαλοι όλων των ειδικοτήτων καλούνται με ιδιαίτερη έμφαση να συμμετάσχουν στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού προκειμένου να δώσουν την ευκαιρία στους μαθητές τους να ανακαλύψουν τη χαρά της ψηφιακής δημιουργικότητας και του προγραμματισμού. Μάθετε περισσότερα για αυτήν την πρωτοβουλία και πώς να οργανώσετε τη δραστηριότητά σας μέσω της ειδικής ιστοσελίδας για τους δασκάλους: <a href="/schools">CodeWeek.eu/Σχολεία</a></p>

                    <h2>Γιατί προγραμματισμός;</h2>

                    <p>Για την Pia, που ένιωθε ότι έπρεπε να σπουδάσει νομικά, παρότι πάντα της άρεσαν τα μαθηματικά και να παίζει με τους υπολογιστές. Για τον Mark, που έχει στο μυαλό του ένα καλύτερο τρόπο κοινωνικής δικτύωσης, αλλά δεν μπορεί να το φτιάξει μόνος του. Για την Alice, που ονειρεύεται να κατασκευάσει ρομπότ, επειδή οι γονείς της δεν την αφήνουν να έχει γάτα.</p>

                    <p>Για εκείνους που ήδη βοηθούν να γίνουν πραγματικότητα αυτά τα όνειρα.</p>

                    <p>Στην πραγματικότητα, για όλους εμάς. Το μέλλον μας. Η τεχνολογία διαμορφώνει τις ζωές μας, όμως αφήνουμε μια μικρή μερίδα ανθρώπων να αποφασίσει για τι και πώς θα τη χρησιμοποιούμε. Μπορούμε να κάνουμε πολλά περισσότερα από το να κοινοποιούμε και να δηλώνουμε ότι μας αρέσουν ορισμένες δημοσιεύσεις. Μπορούμε να δώσουμε πνοή στις τρελές ιδέες μας, να δημιουργήσουμε πράγματα που προκαλούν χαρά στους άλλους.</p>

                    <p>Ποτέ δεν ήταν ευκολότερο να δημιουργήσεις τη δική σου εφαρμογή, να φτιάξεις το δικό σου ρομπότ ή να επινοήσεις αυτοκίνητα που πετάνε, γιατί όχι! Το ταξίδι δεν είναι εύκολο, αλλά είναι ένα ταξίδι γεμάτο δημιουργικές προκλήσεις, περιλαμβάνει μια υποστηρικτική κοινότητα και πολύ διασκέδαση. Είστε έτοιμοι να αποδεχθείτε την πρόκληση και να γίνετε δημιουργός;</p>

                    <p>Ο προγραμματισμός βοηθάει επίσης στην ανάπτυξη δεξιοτήτων όπως είναι η υπολογιστική σκέψη, η επίλυση προβλημάτων, η δημιουργικότητα και η ομαδική εργασία, δηλ. πραγματικά χρήσιμες δεξιότητες σε όλες τις ατραπούς της ζωής.</p>

                    <p>Ο Alessandro Bogliolo, συντονιστής της ομάδας εθελοντών της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, δήλωσε:<blockquote>
                            <p>«Από καταβολής κόσμου κάναμε ένα σωρό πράγματα με την πέτρα, το σίδερο, το χαρτί και το μολύβι·που μεταμόρφωσαν τις ζωές μας. Τώρα ζούμε σε μιαν άλλη εποχή όπου ο κόσμος μας είναι πλασμένος με κώδικες. Διαφορετικές εποχές συνεπάγονται ζήτηση για διαφορετικές θέσεις εργασίας και δεξιότητες. Κατά τη διάρκεια της Εβδομάδας Προγραμματισμού θέλουμε να προσφέρουμε σε κάθε Ευρωπαίο την ευκαιρία να ανακαλύψει τη συγγραφή κώδικα και να διασκεδάσει με αυτήν. Ας μάθουμε, λοιπόν, πώς να συγγράφουμε κώδικες, για να διαμορφώσουμε το μέλλον μας».</p>
                        </blockquote>
                    </p>

                    <h2>Η Εβδομάδα Προγραμματισμού σε αριθμούς</h2>

                    <p>Το 2017, περίπου 1,2 εκατομμύριο άτομα σε περισσότερες από 50 χώρες σε όλο τον κόσμο συμμετείχαν στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού. Ένα επιπλέον 1,3 εκατομμύριο νέων συμμετείχαν στην <a href="http://africacodeweek.org/">Αφρικανική Εβδομάδα Προγραμματισμού</a>, η οποία είναι μια παρελκόμενη πρωτοβουλία την οποία διαχειρίζεται η SAP και μη κερδοσκοπικοί οργανισμοί.</p>

                    <p>Αν η χώρα σας δεν συμμετέχει ακόμα, μπορείτε να διοργανώσετε δραστηριότητες και να τις βάλετε στον <a href="/events">χάρτη</a> ή <a href="mailto:info@codeweek.eu">να γίνετε εθελοντικά</a> Πρέσβης της Εβδομάδας Προγραμματισμού.</p>

                    <div class="container clearfix">
                        <div class="col_half" id="PeopleChart" style="opacity: 0;width: 100%;text-align: center">
                            <h3 class="center">Συμμετέχοντες</h3>
                            <canvas id="PeopleChartCanvas" style="width: 70%;height:400px;"></canvas>
                        </div>
                    </div>


                    <h2>Δηλώστε συμμετοχή στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού</h2>

                    <p>Δηλώστε συμμετοχή στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού <a href="/guide">διοργανώνοντας μια δραστηριότητα προγραμματισμού</a> στην πόλη σας, συμμετέχοντας στην <a href="/codeweek4all">πρόκληση Code Week 4 All</a> και συνδέοντας δραστηριότητες πέρα από κοινότητες και σύνορα, ή βοηθώντας μας να διαδώσουμε το όραμα της Εβδομάδα Προγραμματισμού ως <a href="/ambassadors">Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> της χώρας σας!</p>


                </div>
            </div>
        </div>
    </section>@endsection @push('scripts')<script type="text/javascript">
        $(function($){

            var peopleChartData = {
                labels: ["2013", "2014", "2015", "2016", "2017"],
                datasets: [
                    {
                        fillColor: "rgba(60, 161, 206, 0.61)",
                        strokeColor: "rgba(220,220,220,1)",
                        data: [10000, 150000, 570000, 970000, 1200000]
                    }
                ]

            };

            var globalGraphSettings = {animation: Modernizr.canvas};


            function showBarChart() {
                var ctx = document.getElementById("PeopleChartCanvas").getContext("2d");
                new Chart(ctx).Bar(peopleChartData, globalGraphSettings);
            }


            $('#PeopleChart').appear(function () {
                $(this).css({opacity: 1});
                setTimeout(showBarChart, 300);
            }, {accX: 0, accY: -155}, 'easeInCubic');



        });

    </script>@endpush