@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>ΓΙΝΕ ΠΡΕΣΒΗΣ ΤΗΣ ΕΥΡΩΠΑΪΚΗΣ ΕΒΔΟΜΑΔΑΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ</h1><span></span></div>


                    <p>Οι <a href="http://events.codeweek.eu/ambassadors/">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> είναι το κύριο σημείο επαφής για την Εβδομάδα Προγραμματισμού σε κάθε χώρα, και βοηθάνε να διαδοθεί το όραμα της Εβδομάδας Προγραμματισμού στις τοπικές κοινότητες. Πιστεύεις στο <a href="/about">όραμα της Εβδομάδας Προγραμματισμού</a> και θέλεις να προάγεις τον προγραμματισμό στη χώρα σου; Διάβασε τα παρακάτω!</p>

                    <p><strong>Ως Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού θα πρέπει να μπορείς να αφιερώνεις μερικές ώρες την εβδομάδα στα ακόλουθα:</strong></p>
                    <ul>
                        <li>Να φέρνεις σε επαφή άτομα, επιχειρήσεις και κοινότητες που ενδιαφέρονται να κάνουν κάτι για την Εβδομάδα Προγραμματισμού.</li>
                        <li>Να ενθαρρύνεις τους διοργανωτές εκδηλώσεων να προσθέτουν τις εκδηλώσεις τους προγραμματισμού στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού.</li>
                        <li>Να ενθαρρύνεις τη διοργάνωση νέων εκδηλώσεων στη χώρα σου διαφημίζοντας την Εβδομάδα Προγραμματισμού.</li>
                        <li>Να απαντάς σε ηλεκτρονικά μηνύματα για την Εβδομάδα Προγραμματισμού στη γλώσσα σου.</li>
                        <li>Να εγκρίνεις εκδηλώσεις στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού της χώρας σου.</li>
                        <li>Να τηρείς έναν κατάλογο εκπαιδευτικών πόρων στη γλώσσα της χώρας σου.</li>
                        <li>Να βρίσκεις ενδιαφέροντα παραδείγματα επιτυχίας και ειδήσεις για την προβολή των μέσων δικτύωσης της Εβδομάδας Προγραμματισμού.</li>
                        <li>Να προωθείς το υλικό της Εβδομάδας Προγραμματισμού μέσω του δικτύου σου.</li>
                        <li>Να συνεργάζεσαι με άλλους πρέσβεις, άλλων χωρών της Ευρώπης.</li>
                    </ul>

                    <p><strong>Σε αντάλλαγμα, θα έχεις τη δυνατότητα:</strong></p>
                    <ul>
                        <li>Να γνωρίσεις πολλούς έξυπνους, ενδιαφέροντες ανθρώπους από διάφορους κλάδους.</li>
                        <li>Να συμβάλεις αποτελεσματικά σε μια από τις σημαντικότερες πρωτοβουλίες βάσης της Ευρώπης.</li>
                        <li>Να μας βοηθήσεις να ευαισθητοποιήσουμε τους πολίτες για τη σημασία του προγραμματισμού και να γίνει η Ευρώπη πραγματικά ψηφιακή.</li>
                        <li>Να προσθέσεις τον τίτλο «Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού» στο ήδη εκπληκτικό βιογραφικό σου.</li>
                        <li>Να μάθεις να συγγράφεις κώδικες! (σε περίπτωση που δεν ξέρεις ήδη)</li>
                    </ul>
                    <hr/>
                    <p><strong>Μάθε εδώ τι σημαίνουν όλα αυτά λίγο διεξοδικότερα:</strong></p>
                    <ul>
                        <li>Ένας από τους στόχους μας είναι να συνδέσουμε διάφορα δίκτυα προγραμματισμού και εκπαίδευσης. <strong>Αν γνωρίζεις ότι πραγματοποιούνται εκδηλώσεις προγραμματισμού, μίλησε στους διοργανωτές για την Εβδομάδα Προγραμματισμού και βοήθησέ τους να προσθέσουν την εκδήλωση στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού</strong>, έτσι θα διαθέτουμε έναν πλήρη κατάλογο με όλες τις εκδηλώσεις προγραμματισμού στην Ευρώπη.</li>
                        <li>Ελπίζουμε επίσης να διοργανωθούν περισσότερες εκδηλώσεις στο πλαίσιο της Εβδομάδας Προγραμματισμού. Μπορείς να βοηθήσεις, <strong>ενθαρρύνοντας</strong> <strong>σχολεία, οργανώσεις, κοινότητες προγραμματιστών και ενθουσιώδεις ιδιώτες να ξεκινήσουν νέες, εκδηλώσεις στη χώρα σου που να απευθύνονται και σε αρχάριους</strong>. Οι εκδηλώσεις δεν χρειάζεται να πραγματοποιούνται κατά τη διάρκεια της Εβδομάδας Προγραμματισμού, μολονότι τότε θα είναι η ιδανικότερη περίοδος για τις δραστηριότητές προώθησης εκδηλώσεων. Για να σε βοηθήσουμε, συντάσσουμε έναν κατάλογο όπου προτείνουμε εταιρείες, έναν <a href="http://events.codeweek.eu/guide">οδηγό για υποψήφιους διοργανωτές εκδηλώσεων</a>, και δημιουργούμε επίσης πολλούς άλλους <a href="https://github.com/codeeu/codeeu-resources">πόρους προώθησης</a>.</li>
                        <li>Χρειαζόμαστε τη βοήθειά σου για να <strong>απαντάμε σε ηλεκτρονικά μηνύματα που αφορούν την Εβδομάδα Προγραμματισμού στη χώρα σου.</strong> Εσύ θα αποτελείς το βασικό σημείο επαφής για ο,τιδήποτε συμβαίνει στη χώρα σου, επομένως μπορείς να <strong>φέρνεις σε επαφή άτομα και εταιρείες από τη χώρα σου που ενδέχεται να επωφεληθούν από τη μεταξύ τους επαφή</strong> καθώς και να δίνεις απαντήσεις στη γλώσσα σου. Μην ανησυχείς αν δεν γνωρίζεις όλες τις απαντήσεις ακόμη, εμείς είμαστε εδώ για να σε βοηθήσουμε.</li>
                        <li>Οποιοσδήποτε μπορεί να προσθέσει την εκδήλωσή προγραμματισμού που διοργανώνει στο <a href="http://events.codeweek.eu">http://events.codeweek.eu</a>, αλλά εσύ θα είσαι ο συντονιστής για τις εκδηλώσεις στη χώρα σου. Το μόνο που πρέπει να κάνεις είναι να<strong> ρίχνεις τακτικά μια ματιά στις εκδηλώσεις που υποβάλλονται και να ελέγχεις αν ταιριάζουν στην Εβδομάδα Προγραμματισμού</strong>.&nbsp;</li>
                        <li>Πρέπει να είναι εύκολο για όλους να ξεκινήσουν μια εκδήλωση προγραμματισμού. Μάλλον θα γνωρίζεις κάποιους χρήσιμους εκπαιδευτικούς πόρους στο διαδίκτυο για αρχάριους στον προγραμματισμό στη γλώσσα σου, <strong>όποτε μπορείς να φτιάξεις έναν κατάλογο πόρων για τη χώρα σου στον δικτυακό τόπο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</strong>.&nbsp;</li>
                        <li><strong>Βρες ενδιαφέρουσες ειδήσεις και περιεχόμενο για τον προγραμματισμό από τη χώρα σου</strong> που θα μπορούμε να προωθούμε στα μέσα κοινωνικής δικτύωσης της Εβδομάδας Προγραμματισμού. Κατά κύριο λόγο αναζητούμε περιεχόμενο στα αγγλικά, επομένως μπορείς να βοηθήσεις ζητώντας από τους διοργανωτές να κοινοποιούν τις ιστορίες και τις συμβουλές τους στα αγγλικά στο <a href="http://blog.codeweek.eu">ιστολόγιό μας</a>. Επιπλέον, μπορείς επίσης να δημιουργήσεις λογαριασμούς στα μέσα κοινωνικής δικτύωσης για την Εβδομάδα Προγραμματισμού στη χώρα σας για την προώθηση περιεχομένου στη γλώσσα σου.&nbsp;</li>
                        <li>Με τη βοήθειά σου θα δημιουργήσουμε μια βιβλιοθήκη με υλικό από την Εβδομάδα Προγραμματισμού που μπορεί να χρησιμοποιείται για την προώθηση του προγραμματισμού ως δεξιότητας. <strong>Χρειαζόμαστε τη βοήθεια σου για για τη διάδοση του υλικού στη χώρα σου, και ακόμη και για να ενθαρρυνθούν διάφορες ομάδες να παρέχουν μεταφράσεις</strong>.&nbsp;</li>
                        <li>Δημιουργούμε ένα δίκτυο εθνικών πρέσβεων για την προώθηση της Εβδομάδας Προγραμματισμού και θα προσπαθήσουμε επίσης να προγραμματίσουμε μηνιαίες τηλεφωνικές συνομιλίες μέσω του διαδικτύου για να συζητάμε τις εργασίες μας, να ανταλλάσσουμε καλές πρακτικές και να εμπνέουμε ο ένας τον άλλον με ιδέες για περαιτέρω δραστηριότητες. Δεν χρειάζεται να συμμετέχεις σε όλες τις συναντήσεις, αλλά ελπίζουμε να συμμετέχεις όσο πιο συχνά γίνεται. Επίσης, διαθέτουμε κατάλογο με τις διευθύνσεις ηλεκτρονικού ταχυδρομείου για τους Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού που μπορείς να χρησιμοποιήσεις ανά πάσα στιγμή για να λάβεις συμβουλές ή βοήθεια από άλλους πρέσβεις. <strong>Θα μπορείς να διευρύνεις το δίκτυό σου και να ακούς νέες ιδέες, χάρη στη συνεργασία με άλλους πρέσβεις από όλη την Ευρώπη.</strong></li>
                    </ul>

                    <p>Ενδιαφέρεσαι ακόμη; Εμείς σε θέλουμε στο πλευρό μας! Ρίξε μια γρήγορη ματιά στον <a href="http://events.codeweek.eu/ambassadors">κατάλογο Πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a>. Αν υπάρχει πρέσβης για τη χώρα σου, μπορείς να επικοινωνήσεις απευθείας μαζί του και να δεις πώς μπορείτε να συνεργαστείτε. Σε κάθε περίπτωση, περιμένουμε με ανυπομονησία το μήνυμά σου στο <a href='mailto:info@codeweek.eu?subject=EU Code Week Ambassador'/>info@codeweek.eu</a>.</p>



                </div>
        </div>

    </section>@endsection