@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Γίνετε Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</h1><span></span></div>


                    <p>Οι <a href="http://events.codeweek.eu/ambassadors/">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> είναι το κύριο σημείο επαφής για την Εβδομάδα Προγραμματισμού σε κάθε χώρα, και βοηθάνε να διαδοθεί το όραμα της Εβδομάδας Προγραμματισμού στις τοπικές κοινότητες. Πιστεύετε στο <a href="/about">όραμα της Εβδομάδας Προγραμματισμού</a> και θέλετε να προάγετε τον προγραμματισμό στη χώρα σας; Διαβάστε τα παρακάτω!</p>

                    <p><strong>Ως Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού θα πρέπει να μπορείτε να αφιερώνετε μερικές ώρες την εβδομάδα στα ακόλουθα:</strong></p>
                    <ul>
                        <li>Να φέρνετε σε επαφή άτομα, επιχειρήσεις και κοινότητες που ενδιαφέρονται να κάνουν κάτι για την Εβδομάδα Προγραμματισμού.</li>
                        <li>Να ενθαρρύνετε τους διοργανωτές εκδηλώσεων να προσθέτουν τις εκδηλώσεις τους προγραμματισμού στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού.</li>
                        <li>Να ενθαρρύνετε τη διοργάνωση νέων εκδηλώσεων στη χώρα σας διαφημίζοντας την Εβδομάδα Προγραμματισμού.</li>
                        <li>Να απαντάτε σε ηλεκτρονικά μηνύματα για την Εβδομάδα Προγραμματισμού στη γλώσσα σας.</li>
                        <li>Να εγκρίνετε εκδηλώσεις στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού της χώρας σας.</li>
                        <li>Να τηρείτε έναν κατάλογο εκπαιδευτικών πόρων στη γλώσσα της χώρας σας.</li>
                        <li>Να βρίσκετε ενδιαφέροντα παραδείγματα επιτυχίας και ειδήσεις για την προβολή των μέσων δικτύωσης της Εβδομάδας Προγραμματισμού.</li>
                        <li>Να προωθείτε το υλικό της Εβδομάδας Προγραμματισμού μέσω του δικτύου σας.</li>
                        <li>Να συνεργάζεστε με άλλους πρέσβεις, άλλων χωρών της Ευρώπης.</li>
                    </ul>

                    <p><strong>Σε αντάλλαγμα, θα έχετε τη δυνατότητα:</strong></p>
                    <ul>
                        <li>Να γνωρίσετε πολλούς έξυπνους, ενδιαφέροντες ανθρώπους από διάφορους κλάδους.</li>
                        <li>Να συμβάλετε αποτελεσματικά σε μια από τις σημαντικότερες πρωτοβουλίες βάσης της Ευρώπης.</li>
                        <li>Να μας βοηθήσετε να ευαισθητοποιήσουμε τους πολίτες για τη σημασία του προγραμματισμού και να γίνει η Ευρώπη πραγματικά ψηφιακή.</li>
                        <li>Να προσθέσετε τον τίτλο «Πρέσβης της Ευρωπαϊκής Εβδομάδας Προγραμματισμού» στο ήδη εκπληκτικό βιογραφικό σας.</li>
                        <li>Να μάθετε να συγγράφετε κώδικες! (σε περίπτωση που δεν ξέρετε ήδη)</li>
                    </ul>
                    <hr/>
                    <p><strong>Θα σας εξηγήσουμε τώρα τι σημαίνουν όλα αυτά λίγο διεξοδικότερα:</strong></p>
                    <ul>
                        <li>Ένας από τους στόχους μας είναι να συνδέσουμε διάφορα δίκτυα προγραμματισμού και εκπαίδευσης. <strong>Αν γνωρίζετε ότι πραγματοποιούνται εκδηλώσεις προγραμματισμού, μιλήστε στους διοργανωτές για την Εβδομάδα Προγραμματισμού και βοηθήστε τους να προσθέσουν την εκδήλωση στον δικτυακό τόπο της Εβδομάδας Προγραμματισμού</strong>, έτσι θα διαθέτουμε έναν πλήρη κατάλογο με όλες τις εκδηλώσεις προγραμματισμού στην Ευρώπη.</li>
                        <li>Ελπίζουμε επίσης να διοργανωθούν περισσότερες εκδηλώσεις στο πλαίσιο της Εβδομάδας Προγραμματισμού. Μπορείτε να βοηθήσετε, <strong>ενθαρρύνοντας</strong> <strong>σχολεία, οργανώσεις, κοινότητες προγραμματιστών και ενθουσιώδεις ιδιώτες να ξεκινήσουν νέες, εκδηλώσεις στη χώρα σας που να απευθύνονται και σε αρχάριους</strong>. Οι εκδηλώσεις δεν χρειάζεται να πραγματοποιούνται κατά τη διάρκεια της Εβδομάδας Προγραμματισμού, μολονότι τότε θα είναι η ιδανικότερη περίοδος για τις δραστηριότητές προώθησης εκδηλώσεων. Για να σας βοηθήσουμε, συντάσσουμε έναν κατάλογο όπου προτείνουμε εταιρείες, έναν <a href="http://events.codeweek.eu/guide">οδηγό για υποψήφιους διοργανωτές εκδηλώσεων</a>, και δημιουργούμε επίσης πολλούς άλλους <a href="https://github.com/codeeu/codeeu-resources">πόρους προώθησης</a>.</li>
                        <li>Χρειαζόμαστε τη βοήθειά σας για να <strong>απαντάμε σε ηλεκτρονικά μηνύματα που αφορούν την Εβδομάδα Προγραμματισμού στη χώρα σας.</strong> Εσείς θα αποτελείτε το βασικό σημείο επαφής για ο,τιδήποτε συμβαίνει στη χώρα σας, επομένως μπορείτε να <strong>φέρνετε σε επαφή άτομα και εταιρείες από τη χώρα σας που ενδέχεται να επωφεληθούν από τη μεταξύ τους επαφή</strong> καθώς και να δίνετε απαντήσεις στη γλώσσα σας. Μην ανησυχείτε αν δεν γνωρίζετε όλες τις απαντήσεις ακόμη, εμείς είμαστε εδώ για να σας βοηθήσουμε.</li>
                        <li>Οποιοσδήποτε μπορεί να προσθέσει την εκδήλωσή προγραμματισμού που διοργανώνει στο <a href="http://events.codeweek.eu">http://events.codeweek.eu</a>, αλλά εσείς θα είσαι ο επόπτης για τις εκδηλώσεις στη χώρα σας. Το μόνο που πρέπει να κάνετε είναι να<strong> ρίχνετε τακτικά μια ματιά στις εκδηλώσεις που υποβάλλονται και να ελέγχετε αν ταιριάζουν στην Εβδομάδα Προγραμματισμού</strong>.&nbsp;</li>
                        <li>Πρέπει να είναι εύκολο για όλους να ξεκινήσουν μια εκδήλωση προγραμματισμού. Μάλλον θα γνωρίζετε κάποιους χρήσιμους εκπαιδευτικούς πόρους στο διαδίκτυο για αρχάριους στον προγραμματισμό στη γλώσσα σας, <strong>όποτε μπορείτε να φτιάξετε έναν κατάλογο πόρων για τη χώρα σας στον δικτυακό τόπο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</strong>.&nbsp;</li>
                        <li><strong>Βρείτε ενδιαφέρουσες ειδήσεις και περιεχόμενο για τον προγραμματισμό από τη χώρα σας</strong> που θα μπορούμε να προωθούμε στα μέσα κοινωνικής δικτύωσης της Εβδομάδας Προγραμματισμού. Κατά κύριο λόγο αναζητούμε περιεχόμενο στα αγγλικά, επομένως μπορείτε να βοηθήσετε ζητώντας από τους διοργανωτές να κοινοποιούν τις ιστορίες και τις συμβουλές τους στα αγγλικά στο <a href="http://blog.codeweek.eu">ιστολόγιό μας</a>. Επιπλέον, μπορείτε επίσης να δημιουργήσετε λογαριασμούς στα μέσα κοινωνικής δικτύωσης για την Εβδομάδα Προγραμματισμού στη χώρα σας για την προώθηση περιεχομένου στη γλώσσα σας.&nbsp;</li>
                        <li>Με τη βοήθειά σας θα δημιουργήσουμε μια βιβλιοθήκη με υλικό από την Εβδομάδα Προγραμματισμού που μπορεί να χρησιμοποιείται για την προώθηση του προγραμματισμού ως δεξιότητας. <strong>Χρειαζόμαστε τη βοήθεια σας για για τη διάδοση του υλικού στη χώρα σας, και ακόμη και για να ενθαρρυνθούν διάφορες ομάδες να παρέχουν μεταφράσεις</strong>.&nbsp;</li>
                        <li>Δημιουργούμε ένα δίκτυο εθνικών πρέσβεων για την προώθηση της Εβδομάδας Προγραμματισμού και θα προσπαθήσουμε επίσης να προγραμματίσουμε μηνιαίες τηλεφωνικές συνομιλίες μέσω του διαδικτύου για να συζητάμε τις εργασίες μας, να ανταλλάσσουμε καλές πρακτικές και να εμπνέουμε ο ένας τον άλλον με ιδέες για περαιτέρω δραστηριότητες. Δεν χρειάζεται να συμμετέχετε σε όλες τις συναντήσεις, αλλά ελπίζουμε να συμμετέχετε όσο πιο συχνά γίνεται. Επίσης, διαθέτουμε κατάλογο με τις διευθύνσεις ηλεκτρονικού ταχυδρομείου για τους Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού που μπορείτε να χρησιμοποιήσετε ανά πάσα στιγμή για να λάβετε συμβουλές ή βοήθεια από άλλους πρέσβεις. <strong>Θα μπορείτε να διευρύνετε το δίκτυό σας και να ακούτε νέες ιδέες, χάρη στη συνεργασία με άλλους πρέσβεις από όλη την Ευρώπη.</strong></li>
                    </ul>

                    <p>Ενδιαφέρεστε ακόμη; Εμείς σας θέλουμε στο πλευρό μας! Ρίξτε μια γρήγορη ματιά στον <a href="http://events.codeweek.eu/ambassadors">κατάλογο Πρέσβεων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a>. Αν υπάρχει πρέσβης για τη χώρα σας, μπορείτε να επικοινωνήσετε απευθείας μαζί του και να δείτε πώς μπορείτε να συνεργαστείτε. Σε κάθε περίπτωση, περιμένουμε με ανυπομονησία το μήνυμά σας στο <a href='mailto:info@codeweek.eu?subject=EU Code Week Ambassador'/>info@codeweek.eu</a>.</p>



                </div>
        </div>

    </section>@endsection