@extends('layout.base') @section('content')<section>

        <div class="container">

            <div class="content-wrap nopadding">

                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Πρόκληση «Εβδομάδα Προγραμματισμού για Όλους»</h1><span></span></div>

                    <hr>

                    <p>Η πρόκληση «Εβδομάδα Προγραμματισμού για Όλους» σε ενθαρρύνει να διασυνδέσεις τις δραστηριότητές σου με άλλες που διοργανώνονται από φίλους, συναδέρφους και γνωστούς. Μαζί θα αποκτήσετε το Πιστοποιητικό Αριστείας της Εβδομάδας Προγραμματισμού.</p>


                    <simple-question :visible="true">
                        <template slot="title">Τι είναι;</template>
                        <template slot="content">
                            <p>Πέρα από την υποβολή της δραστηριότητάς σου στον χάρτη της Ευρωπαϊκής Εβδομάδας Προγραμματισμού, μπορείς επίσης να προσκαλέσεις άλλους στο δίκτυο σου να κάνουν το ίδιο. Αν εσύ και η συμμαχία σου φτάσετε ένα από τα παρακάτω όρια, θα κερδίσετε το Πιστοποιητικό Αριστείας της Εβδομάδας Προγραμματισμού!</p>
                            <p>Κριτήρια για το Πιστοποιητικό Αριστείας:</p>
                            <ul>
                                <li><strong>Συμμετείχαν 500 μαθητές</strong></li>Ή/Και<li><strong>Διασυνδέθηκαν 10 δραστηριότητες</strong></li>Ή/Και<li><strong>Συμμετείχαν 3 χώρες</strong></li>
                            </ul>
                        </template>
                    </simple-question>

                    <simple-question :visible="true">
                        <template slot="title">Πώς μπορώ να συμμετέχω;</template>
                        <template slot="content">
                            <ol>
                                <li>Μπες στη σελίδα <a href="/add">Προσθήκη Δραστηριότητας</a> και συμπλήρωσε τα απαραίτητα στοιχεία της δραστηριότητας προγραμματισμού σου.</li>
                            </ol><i>Αν είσαι ο πρώτος στη συμμαχία σου:</i><ol start="2">
                                <li>Κάνε κλικ στην «Υποβολή».</li>
                                <li>Μόλις γίνει δεχτή η δραστηριότητά σου, θα λάβεις ηλεκτρονικό μήνυμα επιβεβαίωσης με τον μοναδικό σου κωδικό για την «Εβδομάδα Προγραμματισμού για Όλους».</li>
                                <li>Αντίγραψε τον κωδικό και μοιράσου τον με συναδέρφους και άλλα άτομα στο δίκτυό σου που επίσης διοργανώνουν δραστηριότητα προγραμματισμού. Διάδωσέ το και ενθάρρυνε κι άλλους να συμμετέχουν!</li>
                                <li>Μετά από το τέλος της εκστρατείας, θα ζητηθεί από όλους τους διοργανωτές δραστηριότητας να αναφέρουν πόσοι συμμετέχοντες πήραν μέρος. Αν καταφέρεις να πετύχεις το όριο, εσύ και οι συνάδελφοί σου που αποτέλεσαν μέρος του δικτύου σου θα λάβετε το Πιστοποιητικό Αριστείας!</li>
                            </ol><i>Αν συμμετέχεις σε υπάρχουσα συμμαχία:</i><ol start="2">
                                <li>Κάνε επικόλληση τον κωδικό πρόσβασης που έλαβες από τον ιδρυτή, που δημιούργησε πρώτος τη συμμαχία, στο κελί «ΚΩΔΙΚΟΣ ΕΒΔΟΜΑΔΑΣ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ ΓΙΑ ΟΛΟΥΣ».</li>
                                <li>Κάνε κλικ στην «Υποβολή».</li>
                                <li>Διάδωσέ το (και τον κωδικό!) ώστε περισσότεροι διοργανωτές να συμμετέχουν στη συμμαχία σου.</li>
                                <li>Μετά από το τέλος της εκστρατείας, θα ζητηθεί από όλους τους διοργανωτές δραστηριότητας να αναφέρουν πόσοι συμμετέχοντες πήραν μέρος. Αν καταφέρεις να πετύχεις το όριο, εσύ και οι συνάδελφοί σου που αποτέλεσαν μέρος του δικτύου σου θα λάβετε το Πιστοποιητικό Αριστείας!</li>

                            </ol>
                        </template>
                    </simple-question>

                    <simple-question :visible="true">
                        <template slot="title">Γιατί να συμμετέχω στην πρόκληση;</template>
                        <template slot="content">
                            <ul>
                                <li>Για να διαδώσεις το μήνυμα της σημασίας του προγραμματισμού.</li>
                                <li>Για να συμμετέχει μεγάλος αριθμός μαθητών.</li>
                                <li>Για να διασυνδεθείς με οργανώσεις ή/και σχολεία στην κοινότητά σου ή διεθνώς.</li>
                                <li>Για να βρεις υποστήριξη από άλλους διοργανωτές και δασκάλους.</li>
                                <li>Για να λάβεις ένα <strong>Πιστοποιητικό Αριστείας.</strong></li>
                            </ul>
                        </template>
                    </simple-question>


                </div>
            </div>
        </div>

    </section>@endsection @section("extra-css")<style> .tab{ position: relative; margin-bottom: 1px; width: 100%; color: #232323; overflow: hidden; } .answer { padding: 20px; background-color: #f1f1f1; } .question{ position: relative; display: block; width: 100%; padding: 0 0 0 1em; background: #2980b9; font-weight: bold; line-height: 3; cursor: pointer; color: #fff; text-align: center; font-size: 2rem; } .chevron{ display: block; margin-top: -23px; padding: 10px; } ul, ol{ margin-left: 1em; } </style>@endsection