@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Διοργάνωσε τη δική σου δραστηριότητα με την #CodeWeek</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Κάνε εγγραφή της δραστηριότητάς σου εδώ</a></div>
                    </div>


                </div>


                <h2>Τι είναι η Ευρωπαϊκή Εβδομάδα Προγραμματισμού;</h2>
                <p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα βάσης που το διαχειρίζονται εθελοντές και το υποστηρίζει η Ευρωπαϊκή Επιτροπή. Οποιοσδήποτε (σχολεία, εκπαιδευτικοί, βιβλιοθήκες, όμιλοι-κοινότητες προγραμματισμού, επιχειρήσεις, δημόσιες αρχές) μπορεί να οργανώσει μια εκδήλωση στο πλαίσιο της #CodeWeek και να την προσθέσει στον χάρτη στον ιστότοπο <a href="/events">codeweek.eu</a>.</p>


                <h2>Τι χρειάζεσαι για να διοργανώσεις μια δραστηριότητα;</h2>
                <ul>
                    <li><strong>Μια ομάδα ατόμων που θέλει να μάθει.</strong> Για παράδειγμα, τους φίλους σου, παιδιά, έφηβους, ενήλικες συναδέλφους, γονείς ή παππούδες. Και μην ξεχνάς: δύο άτομα αποτελούν μια ομάδα!</li>
                    <li><strong>Δασκάλους ή εκπαιδευτές</strong> που ήδη γνωρίζουν τη δραστηριότητα προγραμματισμού και πώς να διδάσκουν και να εμπνέουν άλλους. Ο αριθμός εξαρτάται από το είδος και το μέγεθος της εκδήλωσης.</li>
                    <li><strong>Έναν χώρο μάθησης.</strong> Τάξεις, βιβλιοθήκες, αίθουσες συνεδριάσεων και διάφοροι δημόσιοι χώροι αποτελούν ιδανικούς χώρους φιλοξενίας μιας εκδήλωσης.</li>
                    <li><strong>Υπολογιστές και σύνδεση στο διαδίκτυο.</strong> Ανάλογα με την ομάδα-στόχο μπορείς να ζητήσεις από τους συμμετέχοντες να φέρουν τους δικούς τους φορητούς υπολογιστές.</li>

                    <li><strong>Προγραμματισμός χωρίς σύνδεση στο διαδίκτυο.</strong> Στην πραγματικότητα δεν χρειάζεσαι υπολογιστές και σύνδεση στο διαδίκτυο για να μάθεις την υπολογιστική σκέψη. Για αρχή, ρίξε μια ματιά στα <a href="/training/coding-without-computers">εκπαιδευτικά προγράμματα χωρίς σύνδεση στο διαδίκτυο</a>.</li>


                    <li><strong>Εκπαιδευτικό υλικό.</strong> Δείξε στους συμμετέχοντες πόσο διασκεδαστικό μπορεί να είναι το να δημιουργούν κάτι μόνοι τους. Συμβουλέψου τη <a
                                href="/resources">σελίδα με τους εκπαιδευτικούς πόρους</a> μας και τα <a href="/training">εκπαιδευτικά προγράμματα</a> με εκπαιδευτικά βίντεο και πλάνα μαθημάτων, και προσάρμοσέ τα στις ανάγκες τις ομάδας σου.</li>


                    <li><strong>Εγγραφή συμμετεχόντων.</strong> Αν έχεις περιορισμένο διαθέσιμο χώρο, μπορείς να χρησιμοποιήσεις διαδικτυακά εργαλεία, όπως <a href="https://docs.google.com/forms/">φόρμες Google</a> και <a
                                href="https://www.eventbrite.com/">Eventbrite</a> για την εγγραφή των συμμετεχόντων.</li>
                    <li>Θυμήσου να <a href="/add">καρφιτσώσεις την εκδήλωσή σου</a> στον <a href="/events">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>
                </ul>


                <h2>Πώς να διοργανώσεις τη δραστηριότητά σου;</h2>
                <ul>
                    <li>Εσύ αποφασίζεις ποια θα είναι η μορφή της εκδήλωσής σου για τον προγραμματισμό, αλλά εμείς σου προτείνουμε να προβλέψεις <strong>χρόνο για πρακτικές ασκήσεις</strong>, όπου οι συμμετέχοντες θα μπορούν να δημιουργήσουν μόνοι τους ή/και να πειραματιστούν με κάποιο υλισμικό.</li>
                    <li>Χρησιμοποίησε <strong>εργαλεία και τεχνολογίες</strong> κατάλληλες για την ομάδα-στόχο. Σου προτείνουμε να χρησιμοποιήσεις <a href="http://codeweek.eu/resources/">λογισμικά ανοιχτού κώδικα που διατίθενται δωρεάν</a>.</li>

                    <li>Ενθάρρυνε τους συμμετέχοντες να <strong>δείξουν και να παρουσιάσουν</strong> ο ένας στον άλλον ό,τι έχουν δημιουργήσει στο τέλος της εκδήλωσής σου.</li>

                    <li><strong>Διάδωσε τα νέα!</strong> Προώθησε και μοιράσου στα μέσα κοινωνικής δικτύωσης όσα έκανες κατά τη δραστηριότητά σου χρησιμοποιώντας το hashtag #CodeWeek. Μπορείς να το μοιραστείς και στην <a
                                href="https://www.facebook.com/groups/774720866253044/">Ομάδα Δασκάλων της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> και στο Twitter (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Μίλησε στους φίλους σου, σε συναδέρφους εκπαιδευτικούς, στον τοπικό τύπο, και σύνταξε ένα δελτίο τύπου.</li>

                    <li>Μην ξεχάσεις να <a href="/add">προσθέσεις τη δραστηριότητά σου</a> στον <a href="/events">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>


                </ul>


                <h2>Υλικό προώθησης</h2>
                <p>Συμβουλέψου το <a href="http://blog.codeweek.eu/">ιστολόγιό</a> μας για πρόσφατες πληροφορίες και προσάρμοσε τα πιο πρόσφατα δελτία τύπου στις ανάγκες σου ή δημιούργησε τα δικά σου:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/gearing-celebrate-eu-code-week-2019">Ετοιμαστείτε να γιορτάσουμε την Ευρωπαϊκή Εβδομάδα Προγραμματισμού του 2019</a> (διατίθεται σε 29 γλώσσες)</li>

                </ul>


                <h2>Κάνε λήψη των παρακάτω εργαλειοθηκών που θα σε βοηθήσουν να ξεκινήσεις:</h2>
                <ul>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BCommunications%2BToolkit.zip">Εργαλειοθήκη επικοινωνίας</a></li>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BTeachers%2BToolkit.zip">Εργαλειοθήκη δασκάλων</a></li>
                </ul>

                <h2>Απορίες;</h2>Αν έχεις απορίες για τη διοργάνωση και την προώθηση της εκδήλωσής σου στο πλαίσιο της #CodeWeek, επικοινώνησε με έναν από τους <a href="/ambassadors">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> της χώρας σου.</div>
        </div>
    </section>@endsection