@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>ΔΗΛΩΣΕ ΣΥΜΜΕΤΟΧΗ ΣΤΗΝ ΕΥΡΩΠΑΪΚΗ ΕΒΔΟΜΑΔΑ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ ΚΑΙ ΔΙΟΡΓΑΝΩΣΕ ΕΚΔΗΛΩΣΕΙΣ #codeEU</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">ΚΑΝΕ ΕΓΓΡΑΦΗ ΤΗΣ ΕΚΔΗΛΩΣΗΣ ΣΟΥ ΕΔΩ</a></div>
                    </div>


                </div>


                <h4><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/codeeu_toolkit.pdf"
                       alt="#codeEU Toolkit"><i class="fa fa-download"></i> Κάνε λήψη ολόκληρης της εργαλειοθήκης #codeEU σε PDF</a></h4>
                <h2>εργαλειοθήκη #codeEU</h2>
                <h2>Τι είναι η Ευρωπαϊκή Εβδομάδα Προγραμματισμού;</h2>
                <p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα βάσης που το διαχειρίζονται εθελοντές οι οποίοι προάγουν τον προγραμματισμό στις χώρες τους ως <a
                            href="/ambassadors">Πρέσβεις της Εβδομάδας Προγραμματισμού</a>. Οποιοσδήποτε (σχολεία, εκπαιδευτικοί, βιβλιοθήκες, όμιλοι-κοινότητες προγραμματισμού, επιχειρήσεις, δημόσιες αρχές) μπορεί να διοργανώσει μια εκδήλωση #CodeEU και να την προσθέσει στον χάρτη στον ιστότοπο <a href="/">codeweek.eu</a>.</p>
                <h2>Ποιος μπορεί να διοργανώσει μια εκδήλωση στο πλαίσιο της Εβδομάδας Προγραμματισμού;</h2>
                <p>Οποιοσδήποτε μπορεί να διοργανώσει μια εκδήλωση στο πλαίσιο της Εβδομάδας Προγραμματισμού.</p>
                <ul>
                    <li><strong>Παιδιά/έφηβοι/ενήλικες</strong> μπορούν να διοργανώσουν εκδηλώσεις προγραμματισμού για να δείξουν σε άλλους πώς δημιουργεί κανείς με κώδικα.</li>
                    <li><strong>Σχολεία / εξωσχολικές ομάδες-κοινότητες / απογευματινά μαθήματα ενηλίκων</strong> μπορούν να διοργανώσουν εκδηλώσεις για τους μαθητές τους. Ο προγραμματισμός με ή χωρίς σύνδεση στο διαδίκτυο είναι διασκεδαστικός και διδάσκει την υπολογιστική σκέψη!</li>
                    <li>Οι <strong>εκπαιδευτικοί και βιβλιοθηκονόμοι</strong> που γνωρίζουν προγραμματισμό μπορούν να παραδίδουν μαθήματα συγγραφής κώδικα, να κοινοποιούν τα προγράμματα διδασκαλίας τους, και να οργανώνουν εργαστήρια για συναδέλφους.</li>
                    <li>Οι <strong>εκπαιδευτικοί και βιβλιοθηκονόμοι που δεν γνωρίζουν προγραμματισμό</strong> μπορούν να προσκαλούν γονείς ή μαθητές να διδάσκουν προγραμματισμό.</li>
                    <li>Οι <strong>προγραμματιστές</strong> μπορούν να διοργανώνουν εργαστήρια σε τοπικά σχολεία, σε τεχνολογικά κέντρα ή κοινοτικά κέντρα και να προσκαλούν άτομα να δημιουργήσουν με κώδικα.</li>
                    <li>Οι <strong>όμιλοι-κοινότητες</strong> μπορούν να διοργανώνουν εργαστήρια για νέους συμμετέχοντες και να δείχνουν πώς φτιάχνεται ένα παιχνίδι ή μια εφαρμογή με κώδικα.</li>
                    <li>Οι <strong>επιχειρήσεις και οι μη κερδοσκοπικές οργανώσεις</strong> μπορούν να φιλοξενούν εργαστήρια προγραμματισμού, να δανείζουν το προσωπικό τους ως δασκάλους σε διάφορες εκδηλώσεις, να προσφέρουν χορηγίες για εκδηλώσεις προγραμματισμού.</li>
                </ul>

                <h2>Τι χρειάζεσαι;</h2>
                <ul>
                    <li><strong>Μια ομάδα ατόμων που θέλει να μάθει.</strong> Για παράδειγμα, τους φίλους σου, παιδιά, έφηβους, ενήλικες συναδέλφους, γονείς ή παππούδες. Και μην ξεχνάς: δύο άτομα αποτελούν μια ομάδα!</li>
                    <li><strong>Δασκάλους ή εκπαιδευτές</strong> που να γνωρίζουν προγραμματισμό, πώς να διδάξουν και να εμπνεύσουν τους άλλους. Ο αριθμός εξαρτάται από το είδος και το μέγεθος της εκδήλωσης. Για εργαστήρια με πρακτικές ασκήσεις μπορεί να χρειαστείς έναν δάσκαλο ανά 5-8 συμμετέχοντες, αλλά εξαρτάται από την κάθε περίπτωση. Οι συμμετέχοντες μπορούν και να βοηθάνε ο ένας τον άλλον! Για μεγαλύτερες εκδηλώσεις, ίσως θα ήταν καλή ιδέα να υπάρχει ένας οικοδεσπότης που θα εξασφαλίσει πως όλοι έχουν ό,τι χρειάζονται και θα μεριμνά για την ομαλή λειτουργία της εκδήλωσης.</li>
                    <li><strong>Έναν χώρο για να συναντιέστε.</strong> Τάξεις, βιβλιοθήκες, αίθουσες συνεδριάσεων και διάφοροι δημόσιοι χώροι αποτελούν ιδανικούς χώρους φιλοξενίας μιας εκδήλωσης.</li>
                    <li><strong>Υπολογιστές.</strong> Ανάλογα με την ομάδα-στόχο μπορείς να ζητήσεις από τους συμμετέχοντες να φέρουν τους δικούς τους φορητούς υπολογιστές, και σε αυτήν την περίπτωση, μην ξεχάσεις να εξασφαλίσεις επαρκή αριθμό πριζών.</li>
                    <li><strong>Σύνδεση στο διαδίκτυο</strong> &ndash; WiFi ή σταθερές συνδέσεις. Βεβαιώσου ότι οι συνδέσεις σου θα μπορέσουν να αντέξουν την κίνηση δεδομένων της ομάδας σου</li>
                    <li><strong>Προγραμματισμός χωρίς σύνδεση στο διαδίκτυο.</strong> Στην πραγματικότητα δεν χρειάζεσαι υπολογιστές και σύνδεση στο διαδίκτυο για να μάθεις την υπολογιστική σκέψη. Δοκίμασε ορισμένες δραστηριότητες προγραμματισμού χωρίς σύνδεση στο διαδίκτυο με το κιτ μας <a
                                href="http://codeweek.it/codyroby/">Cody-Roby</a>.</li>
                    <li><strong>Αξίζει να το δουλέψεις και να μάθεις.</strong>Δείξε στους συμμετέχοντες πόσο διασκεδαστικό μπορεί να είναι το να δημιουργούν κάτι μόνοι τους. Συμβουλέψου τον <a href="http://codeweek.eu/resources/">κατάλογο πόρων</a> που διαθέτουμε, και ψάξε στο διαδίκτυο για υπάρχοντα προγράμματα διδασκαλίας, προγράμματα εργαστηρίων και προσάρμοσέ τα στις ανάγκες της ομάδας σου. Αν διαθέτεις ήδη εξοπλισμό υπολογιστών στον χώρο διεξαγωγής της εκδήλωσης, βεβαιώσου ότι στους υπολογιστές έχουν εγκατασταθεί τα αναγκαία λογισμικά και δώσε στους συμμετέχοντες οδηγίες για το πώς μπορεί να γίνει η εγκατάσταση στις δικές τους συσκευές.</li>
                    <li><strong>Εγγραφή συμμετεχόντων.</strong> Αν οι χώροι που διαθέτεις είναι περιορισμένοι, μπορείς να χρησιμοποιήσεις εργαλεία, για παράδειγμα διαδικτυακές φόρμες, όπως το Wufoo, οι Φόρμες Google ή ακόμα και σελίδες στο Facebook ή στο Eventbrite για να συγκεντρώσεις τις εγγραφές. Μολονότι είμαστε υπέρ της δωρεάν συμμετοχής στις εκδηλώσεις, μπορείς να επιβάλεις μια μικρή χρέωση για να καλύψεις τα έξοδα της εκδήλωσης. Εναλλακτικά, μπορείς να απευθυνθείς σε τοπικές εταιρείες ΤΠ ή νεοφυείς επιχειρήσεις για χορηγίες.</li>
                    <li><a href="/add">«Καρφίτσωσε» την εκδήλωσή σου</a> στον <a href="/">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>
                </ul>


                <h2>Πώς να διοργανώσεις την εκδήλωσή σου;</h2>
                <ul>
                    <li>Εσύ αποφασίζεις ποια θα είναι η μορφή της εκδήλωσής σου για τον προγραμματισμό, αλλά εμείς σου προτείνουμε να προβλέψεις <strong>χρόνο για πρακτικές ασκήσεις</strong>, όπου οι συμμετέχοντες θα μπορούν να δημιουργήσουν μόνοι τους και, ή να καταπιαστούν με κάποιο υλισμικό (hardware).</li>
                    <li>Μπορείς να χρησιμοποιείς οποιαδήποτε <strong>εργαλεία και τεχνολογίες</strong> θέλεις, αλλά εμείς προτιμούμε τα <a
                                href="http://codeweek.eu/resources/">λογισμικά ανοιχτού κώδικα που διατίθενται δωρεάν</a>.</li>
                    <li><strong>Χαμογέλασε!</strong> Η φιλική ατμόσφαιρα θα σπάσει τον πάγο και θα δημιουργήσει κίνητρα για μάθηση.</li>
                    <li><strong>Σνακ και αναψυκτικά</strong>. Αν η εκδήλωσή σου διαρκεί γύρω στις δύο ώρες, οι συμμετέχοντες θα χρειαστούν ένα διάλειμμα. Αν δεν μπορείς να προσφέρεις σνακ και αναψυκτικά, ζήτησε από τους συμμετέχοντες να φέρουν και να τα μοιραστούν μεταξύ τους.</li>
                    <li>Ζήτησε από τους συμμετέχοντες να <strong>δείξουν και να παρουσιάσουν</strong> ο ένας στον άλλον ό,τι έχουν δημιουργήσει στο τέλος της εκδήλωσής σου. Έτσι όλοι θα αισθάνονται υπερήφανοι!</li>
                    <li><strong>Μίλησε για την εκδήλωσή σου!</strong> Μίλησε για την εκδήλωσή σου στα μέσα κοινωνικής δικτύωσης. Χρησιμοποίησε το #CodeEU και το @CodeWeekEU. Μίλησε στους φίλους σου, στον τοπικό τύπο, σύνταξε ένα δελτίο τύπου!</li>
                    <li>Μην ξεχάσεις να <a href="/add">προσθέσεις την εκδήλωσή σου</a> στον <a href="/">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>
                </ul>


                <h2>Υλικό προώθησης</h2>
                <p>Μπορείς να χρησιμοποιήσεις οποιοδήποτε τμήμα του ακόλουθου δελτίου τύπου για να προωθήσεις τη δική σου εκδήλωση:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/eu-code-week-celebrating-its-5th-birthday-7-22-october-get-ready-join-and-learn-how-create-code">Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού γιορτάζει την 5η επέτειό της στις 7-22 Οκτωβρίου. Ετοιμάσου, δήλωσε συμμετοχή και μάθε πώς να δημιουργείς με κώδικα!</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/million-coded-in-record-2016-EU-code-week">Νέο ρεκόρ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού: Ένα εκατομμύριο άτομα ασχολήθηκαν με τη συγγραφή κώδικα κατά τη διάρκεια των εκδηλώσεων του 2016</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/save-date-eu-code-week-10-18-october-2015-bringing-ideas-life-codeeu">Ευρωπαϊκή Εβδομάδα Προγραμματισμού: Δίνοντας πνοή στις ιδέες με την #codeEU</a></li>
                </ul>
                <p>Μπορεί επίσης να χρησιμοποιήσεις το <a href="https://github.com/codeeu/codeeu-resources/tree/master/Logo - generic">λογότυπο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a>, αρκεί η εκδήλωση που διοργανώνεις να ακολουθεί τις κατευθυντήριες γραμμές μας.</p>


                <h2>Απορίες;</h2>
                <p>Αν έχεις απορίες για τη διοργάνωση και την προώθηση της εκδήλωσής σου #codeEU, επικοινώνησε με έναν από τους <a href="/ambassadors">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> της χώρας σου.</p>


            </div>
        </div>
    </section>@endsection