@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Δηλώστε συμμετοχή στην Ευρωπαϊκή Εβδομάδα Προγραμματισμού και διοργανώστε εκδηλώσεις #codeEU</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Κάντε εγγραφή της εκδήλωσής σας εδώ</a></div>
                    </div>


                </div>


                <h4><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/codeeu_toolkit.pdf"
                       alt="#codeEU Toolkit"><i class="fa fa-download"></i> Κάντε λήψη ολόκληρης της εργαλειοθήκης #codeEU σε PDF</a></h4>
                <h2>εργαλειοθήκη #codeEU</h2>
                <h2>Τι είναι η Ευρωπαϊκή Εβδομάδα Προγραμματισμού;</h2>
                <p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού είναι ένα κίνημα βάσης που το διαχειρίζονται εθελοντές οι οποίοι προάγουν τον προγραμματισμό στις χώρες τους ως <a
                            href="/ambassadors">Πρέσβεις της Εβδομάδας Προγραμματισμού</a>. Οποιοσδήποτε (σχολεία, εκπαιδευτικοί, βιβλιοθήκες, όμιλοι-κοινότητες προγραμματισμού, επιχειρήσεις, δημόσιες αρχές) μπορεί να οργανώσει μια εκδήλωση #CodeEU και να την προσθέσει στον χάρτη στον ιστότοπο <a href="/">codeweek.eu</a>.</p>
                <h2>Ποιος μπορεί να διοργανώσει μια εκδήλωση στο πλαίσιο της Εβδομάδας Προγραμματισμού;</h2>
                <p>Οποιοσδήποτε μπορεί να διοργανώσει μια εκδήλωση στο πλαίσιο της Εβδομάδας Προγραμματισμού.</p>
                <ul>
                    <li><strong>Παιδιά/έφηβοι/ενήλικες</strong> μπορούν να διοργανώσουν εκδηλώσεις προγραμματισμού για να δείξουν σε άλλους πώς δημιουργεί κανείς με κώδικα.</li>
                    <li><strong>Σχολεία / εξωσχολικές ομάδες-κοινότητες / απογευματινά μαθήματα ενηλίκων</strong> μπορούν να διοργανώσουν εκδηλώσεις για τους μαθητές τους. Ο προγραμματισμός με ή χωρίς σύνδεση στο διαδίκτυο είναι διασκεδαστικός και διδάσκει την υπολογιστική σκέψη!</li>
                    <li>Οι <strong>εκπαιδευτικοί και βιβλιοθηκονόμοι</strong> που γνωρίζουν προγραμματισμό μπορούν να παραδίδουν μαθήματα συγγραφής κώδικα, να κοινοποιούν τα προγράμματα διδασκαλίας τους, και να οργανώνουν εργαστήρια για συναδέλφους.</li>
                    <li>Οι <strong>εκπαιδευτικοί και βιβλιοθηκονόμοι που δεν γνωρίζουν προγραμματισμό</strong> μπορούν να προσκαλούν γονείς ή μαθητές να διδάσκουν προγραμματισμό.</li>
                    <li>Οι <strong>προγραμματιστές</strong> μπορούν να διοργανώνουν εργαστήρια σε τοπικά σχολεία, σε τεχνολογικά κέντρα ή κοινοτικά κέντρα και να προσκαλούν άτομα να δημιουργήσουν με κώδικα.</li>
                    <li>Οι <strong>όμιλοι-κοινότητες</strong> μπορούν να διοργανώνουν εργαστήρια για νέους συμμετέχοντες και να δείχνουν πώς φτιάχνεται ένα παιχνίδι ή μια εφαρμογή με κώδικα.</li>
                    <li>Οι <strong>επιχειρήσεις και οι μη κερδοσκοπικές οργανώσεις</strong> μπορούν να φιλοξενούν εργαστήρια προγραμματισμού, να δανείζουν το προσωπικό τους ως δασκάλους σε διάφορες εκδηλώσεις, να προσφέρουν χορηγίες για εκδηλώσεις προγραμματισμού.</li>
                </ul>

                <h2>Τι χρειάζεστε;</h2>
                <ul>
                    <li><strong>Μια ομάδα ατόμων που θέλει να μάθει.</strong> Για παράδειγμα, τους φίλους σας, παιδιά, έφηβους, ενήλικες συναδέλφους, γονείς ή παππούδες. Και μην ξεχνάτε: δύο άτομα αποτελούν μια ομάδα!</li>
                    <li><strong>Δασκάλους ή εκπαιδευτές</strong> που να γνωρίζουν προγραμματισμό, πώς να διδάξουν και να εμπνεύσουν άλλους. Ο αριθμός εξαρτάται από το είδος και το μέγεθος της εκδήλωσης. Για εργαστήρια με πρακτικές ασκήσεις μπορεί να χρειαστείτε έναν δάσκαλο ανά 5-8 συμμετέχοντες, αλλά εξαρτάται από την κάθε περίπτωση. Οι συμμετέχοντες μπορούν και να βοηθάνε ο ένας τον άλλον! Για μεγαλύτερες εκδηλώσεις, ίσως θα ήταν καλή ιδέα να υπάρχει ένας οικοδεσπότης που θα εξασφαλίσει πως όλοι έχουν ό,τι χρειάζονται και θα μεριμνά για την ομαλή λειτουργία της εκδήλωσης.</li>
                    <li><strong>Έναν χώρο για να συναντιέστε.</strong> Τάξεις, βιβλιοθήκες, αίθουσες συνεδριάσεων και διάφοροι δημόσιοι χώροι αποτελούν ιδανικούς χώρους φιλοξενίας μιας εκδήλωσης.</li>
                    <li><strong>Υπολογιστές.</strong> Ανάλογα με την ομάδα-στόχο μπορείτε να ζητήσετε από τους συμμετέχοντες να φέρουν τους δικούς τους φορητούς υπολογιστές, και σε αυτήν την περίπτωση, μην ξεχάσετε να παρέχετε επαρκή αριθμό πριζών.</li>
                    <li><strong>Σύνδεση στο διαδίκτυο</strong> &ndash; ασύρματο δίκτυο ή σταθερές συνδέσεις. Βεβαιωθείτε ότι οι συνδέσεις σας θα μπορέσουν να αντέξουν την κίνηση δεδομένων της ομάδας σας</li>
                    <li><strong>Προγραμματισμός χωρίς σύνδεση στο διαδίκτυο.</strong> Στην πραγματικότητα δεν χρειάζεστε υπολογιστές και σύνδεση στο διαδίκτυο για να μάθετε την υπολογιστική σκέψη. Δοκιμάστε ορισμένες δραστηριότητες προγραμματισμού χωρίς σύνδεση στο διαδίκτυο με το κιτ μας <a
                                href="http://codeweek.it/codyroby/">Cody-Roby</a>.</li>
                    <li><strong>Αξίζει να δουλέψετε και να μάθετε.</strong>Δείξτε στους συμμετέχοντες πόσο διασκεδαστικό μπορεί να είναι το να δημιουργούν κάτι μόνοι τους. Συμβουλευτείτε τον <a href="http://codeweek.eu/resources/">κατάλογο πόρων</a> που διαθέτουμε, και ψάξτε στο διαδίκτυο για υπάρχοντα προγράμματα διδασκαλίας, προγράμματα εργαστηρίων και προσαρμόστε τα στις ανάγκες της ομάδας σας. Αν διαθέτετε ήδη εξοπλισμό υπολογιστών στον χώρο διεξαγωγής της εκδήλωσης, βεβαιωθείτε ότι στους υπολογιστές έχουν εγκατασταθεί τα αναγκαία λογισμικά και δώστε στους συμμετέχοντες οδηγίες για το πώς μπορεί να γίνει η εγκατάσταση στις δικές τους συσκευές.</li>
                    <li><strong>Εγγραφή συμμετεχόντων.</strong> Αν οι χώροι που διαθέτετε είναι περιορισμένοι, μπορείτε να χρησιμοποιήσετε εργαλεία, για παράδειγμα διαδικτυακές φόρμες, όπως το Wufoo, οι Φόρμες Google ή ακόμα και σελίδες στο Facebook ή στο Eventbrite για να συγκεντρώσετε τις εγγραφές. Μολονότι είμαστε υπέρ της δωρεάν συμμετοχής στις εκδηλώσεις, μπορείτε να επιβάλλετε μια μικρή χρέωση για να καλύψετε τα έξοδα της εκδήλωσης. Εναλλακτικά, μπορείτε να απευθυνθείτε για χορηγίες σε τοπικές εταιρείες ΤΠ ή νεοφυείς επιχειρήσεις.</li>
                    <li><a href="/add">«Καρφιτσώστε» την εκδήλωσή σας</a> στον <a href="/">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>
                </ul>


                <h2>Πώς να διοργανώσετε την εκδήλωσή σας;</h2>
                <ul>
                    <li>Εσείς αποφασίζετε ποια θα είναι η μορφή της εκδήλωσής σας για τον προγραμματισμό, αλλά εμείς σας προτείνουμε να προβλέψετε <strong>χρόνο για πρακτικές ασκήσεις</strong>, όπου οι συμμετέχοντες θα μπορούν να δημιουργήσουν μόνοι τους και, ή να καταπιαστούν με κάποιο υλισμικό (hardware).</li>
                    <li>Μπορείτε να χρησιμοποιείτε οποιαδήποτε <strong>εργαλεία και τεχνολογίες</strong> θέλετε, αλλά εμείς προτιμούμε τα <a
                                href="http://codeweek.eu/resources/">λογισμικά ανοιχτού κώδικα που διατίθενται δωρεάν</a>.</li>
                    <li><strong>Χαμογελάστε!</strong> Η φιλική ατμόσφαιρα θα σπάσει τον πάγο και θα δημιουργήσει κίνητρα για μάθηση.</li>
                    <li><strong>Σνακ και αναψυκτικά</strong>. Αν η εκδήλωσή σας διαρκεί γύρω στις δύο ώρες, οι συμμετέχοντες θα χρειαστούν ένα διάλειμμα. Αν δεν μπορείτε να προσφέρετε σνακ και αναψυκτικά, ζητήστε από τους συμμετέχοντες να φέρουν και να τα μοιραστούν μεταξύ τους.</li>
                    <li>Ζήτησε από τους συμμετέχοντες να <strong>δείξουν και να παρουσιάσουν</strong> ο ένας στον άλλον ό,τι έχουν δημιουργήσει στο τέλος της εκδήλωσής σας. Έτσι όλοι θα αισθάνονται υπερήφανοι!</li>
                    <li><strong>Μιλήστε για την εκδήλωσή σας!</strong> Μιλήστε για την εκδήλωσή σας στα μέσα κοινωνικής δικτύωσης. Χρησιμοποίησε το #CodeEU και το @CodeWeekEU. Μιλήστε στους φίλους σου, στον τοπικό τύπο, συντάξτε ένα δελτίο τύπου!</li>
                    <li>Μην ξεχάσετε να <a href="/add">προσθέσετε την εκδήλωσή σας</a> στον <a href="/">χάρτη της Εβδομάδας Προγραμματισμού</a>!</li>
                </ul>


                <h2>Υλικό προώθησης</h2>
                <p>Μπορείτε να χρησιμοποιήσετε οποιοδήποτε τμήμα του ακόλουθου δελτίου τύπου για να προωθήσετε τη δική σας εκδήλωση:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/eu-code-week-celebrating-its-5th-birthday-7-22-october-get-ready-join-and-learn-how-create-code">Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού γιορτάζει την 5η επέτειό της στις 7-22 Οκτωβρίου. Ετοιμαστείτε, δηλώστε συμμετοχή και μάθετε πώς να δημιουργείτε με κώδικα!</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/million-coded-in-record-2016-EU-code-week">Νέο ρεκόρ της Ευρωπαϊκής Εβδομάδας Προγραμματισμού: Ένα εκατομμύριο άτομα ασχολήθηκαν με τη συγγραφή κώδικα κατά τη διάρκεια των εκδηλώσεων του 2016</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/save-date-eu-code-week-10-18-october-2015-bringing-ideas-life-codeeu">Ευρωπαϊκή Εβδομάδα Προγραμματισμού: Δίνοντας πνοή στις ιδέες με την #codeEU</a></li>
                </ul>
                <p>Μπορείτε επίσης να χρησιμοποιήσετε το <a href="https://github.com/codeeu/codeeu-resources/tree/master/Logo - generic">λογότυπο της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a>, αρκεί η εκδήλωση που διοργανώνετε να ακολουθεί τις κατευθυντήριες γραμμές μας.</p>


                <h2>Απορίες;</h2>
                <p>Αν έχετε απορίες για τη διοργάνωση και την προώθηση της εκδήλωσής σας #codeEU, επικοινωνήστε με έναν από τους <a href="/ambassadors">Πρέσβεις της Ευρωπαϊκής Εβδομάδας Προγραμματισμού</a> της χώρας σας.</p>


            </div>
        </div>
    </section>@endsection