@extends('layout.base') @section('content')<section>

    <div class="container clearfix">

        <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
            <h1>ΔΗΛΩΣΗ ΕΧΕΜΥΘΕΙΑΣ</h1><span>ΕΥΡΩΠΑΪΚΗ ΕΒΔΟΜΑΔΑ ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΥ 2018</span><ol class="breadcrumb">
			    <li><a href="http://codeweek.eu">Αρχική σελίδα</a></li>
			    <li class="active">Δήλωση εχεμύθειας</li>
		    </ol>
	    </div>
    </div>
</section><!-- #page-title end --> <!-- Content --><section id="content">
	<div class="content-wrap">
		<div class="container clearfix">
			<p>Η παρούσα Δήλωση Εχεμύθειας διέπει τον τρόπο με τον οποίον η Ευρωπαϊκή Εβδομάδα Προγραμματισμού συλλέγει, χρησιμοποιεί, διατηρεί και δημοσιοποιεί στοιχεία που έχουν συλλεχθεί από χρήστες (στον ενικό, «Χρήστης») του δικτυακού τόπου <a href="http://codeweek.eu">http://codeweek.eu</a> («Ιστότοπος»). Η παρούσα δήλωση εχεμύθειας ισχύει για τον Ιστότοπο και όλα τα προϊόντα και όλες τις υπηρεσίες που προσφέρονται από την Ευρωπαϊκή Εβδομάδα Προγραμματισμού.</p>

<p><strong>Προσωπικά στοιχεία ταυτότητας</strong></p>

<p>Ενδέχεται να συλλέξουμε προσωπικά στοιχεία ταυτότητας από Χρήστες με ποικίλους τρόπους, μεταξύ άλλων, αλλά όχι αποκλειστικά με αυτούς, κατά την επίσκεψη των Χρηστών στον ιστότοπό μας, κατά την εγγραφή τους στον ιστότοπο, και στο πλαίσιο άλλων δραστηριοτήτων, υπηρεσιών, λειτουργιών ή πόρων που διαθέτουμε στον Ιστότοπό μας. Μπορεί να ζητηθεί από τους χρήστες, κατά περίπτωση, το όνομα και η διεύθυνση του ηλεκτρονικού ταχυδρομείου τους. Ωστόσο, οι χρήστες μπορούν να επισκέπτονται την ιστοσελίδα μας ανώνυμα. Συλλέγουμε προσωπικά στοιχεία ταυτότητας από Χρήστες μόνο εφόσον αυτοί μας υποβάλλουν εθελοντικά τέτοιου είδους στοιχεία. Οι χρήστες μπορούν σε κάθε περίπτωση να αρνούνται να παρέχουν προσωπικά στοιχεία ταυτότητας, μόνο που αυτό ενδέχεται να τους στερεί τη συμμετοχή σε ορισμένες σχετικές δραστηριότητες του Ιστότοπου.</p>

<p><strong>Μη προσωπικά στοιχεία ταυτότητας</strong></p>

<p>Ενδέχεται να συλλέγουμε μη προσωπικά στοιχεία ταυτότητας που αφορούν Χρήστες, όποτε αυτοί αλληλεπιδρούν με τον Ιστότοπό μας. Τα μη προσωπικά στοιχεία ταυτότητας ενδέχεται να περιλαμβάνουν τον όνομα του προγράμματος περιήγησης, τον τύπο του υπολογιστή και τεχνικές πληροφορίες για τα μέσα σύνδεσης των Χρηστών στον ιστότοπό μας, όπως το λειτουργικό σύστημα και τους χρησιμοποιούμενους φορείς παροχής υπηρεσιών στο διαδίκτυο, καθώς και άλλες συναφείς πληροφορίες.</p>

<p><strong>Cookies προγράμματος περιήγησης</strong></p>

<p>Ο Ιστότοπός μας ενδέχεται να χρησιμοποιεί «cookies» προκειμένου να βελτιώνεται η εμπειρία του Χρήστη. Το πρόγραμμα περιήγησης των χρηστών τοποθετεί cookies στον σκληρό δίσκο τους για λόγους τήρησης αρχείου και, ενίοτε, για να εντοπίζει στοιχεία που τους αφορούν. Ο χρήστης μπορεί να επιλέξει να ρυθμίσει το πρόγραμμα περιήγησης έτσι ώστε να αρνείται τα cookies, ή να λαμβάνει ειδοποιήσεις κατά την αποστολή cookies. Αν προβεί σε αυτήν την ενέργεια, σας εφιστούμε την προσοχή ότι ορισμένα μέρη του Ιστοτόπου ίσως δεν λειτουργούν σωστά.</p>

<p><strong>Πώς χρησιμοποιούμε τα στοιχεία που συλλέγουμε</strong></p>

<p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού ενδέχεται να συλλέγει και να χρησιμοποιεί τα προσωπικά στοιχεία ταυτότητας των χρηστών για τους ακόλουθους σκοπούς:</p>
<ul>
<li><i>Βελτίωση της υπηρεσίας εξυπηρέτησης πελατών</i>: Τα στοιχεία που παρέχετε μας βοηθούν να ανταποκρινόμαστε στα αιτήματα εξυπηρέτησης πελατών και να ικανοποιούμε τις ανάγκες αποτελεσματικότερα.</li>
<li><i>Εξατομίκευση της εμπειρίας χρήστη</i>: Μπορεί να χρησιμοποιούμε τα στοιχεία συνολικά για να κατανοούμε πώς οι Χρήστες, ως ομάδα, χρησιμοποιούν τις υπηρεσίες και τους πόρους που παρέχονται στον Ιστότοπό μας.</li>
<li><i>Περιοδική αποστολή ηλεκτρονικών μηνυμάτων</i>: Ενδέχεται να χρησιμοποιούμε τη διεύθυνση ηλεκτρονικού ταχυδρομείου για να απαντούμε στις απορίες, τις ερωτήσεις τους ή/και σε άλλα αιτήματα.</li>
</ul>
<p><strong>Πώς προστατεύουμε τα στοιχεία σας</strong></p>

<p>Υιοθετούμε κατάλληλες πρακτικές συλλογής, αποθήκευσης και επεξεργασίας στοιχείων, καθώς και μέτρα ασφαλείας για την προστασία κατά της μη εξουσιοδοτημένης πρόσβασης, αλλοίωσης, δημοσιοποίησης ή καταστροφής των προσωπικών στοιχείων σας, του ονόματος χρήστη, του κωδικού πρόσβασης, των πληροφοριών συναλλαγής και των δεδομένων που αποθηκεύονται στον Ιστότοπό μας.</p>

<p><strong>Κοινοποίηση των προσωπικών στοιχείων σας</strong></p>

<p>Δεν πωλούμε, εμπορευόμαστε ή ενοικιάζουμε προσωπικά στοιχεία ταυτότητας Χρηστών σε άλλους. Ενδέχεται να κοινοποιήσουμε σε επιχειρηματικούς εταίρους μας, έμπιστες συνδεόμενες επιχειρήσεις και διαφημιστές γενικά συνολικά δημογραφικά στοιχεία που δεν συνδέονται με προσωπικά στοιχεία ταυτότητας επισκεπτών και χρηστών, για τους σκοπούς που αναφέρονται παραπάνω. Ενδέχεται να προσφύγουμε στην παροχή υπηρεσιών τρίτων ώστε να βοηθηθούμε στη λειτουργία της επιχείρησής μας και του Ιστότοπου, ή να διαχειριζόμαστε δραστηριότητες μόνοι μας, όπως είναι η αποστολή ενημερωτικών δελτίων ή ερευνών. Ενδέχεται να κοινοποιούμε τα στοιχεία σας στους εν λόγω τρίτους για τους εν λόγω περιορισμένους σκοπούς, υπό τον όρο ότι μας έχετε δώσει τη συγκατάθεσή σας.</p>

<p><strong>Αλλαγές στην παρούσα δήλωση εχεμύθειας</strong></p>

<p>Η Ευρωπαϊκή Εβδομάδα Προγραμματισμού έχει τη διακριτική ευχέρεια να επικαιροποιεί την παρούσα δήλωση εχεμύθειας ανά πάσα στιγμή. Όταν αυτό συμβαίνει, αλλάζουμε την ημερομηνία επικαιροποίησης στο κάτω μέρος της παρούσας σελίδας. Καλούμε τους Χρήστες να ελέγχουν συχνά αυτήν τη σελίδα για τυχόν αλλαγές, ώστε να παραμένουν ενήμεροι για τον τρόπο που συμβάλλουμε στην προστασία των προσωπικών στοιχείων που συλλέγουμε. Αναγνωρίζετε και συμφωνείτε ότι είναι δική σας ευθύνη να ανατρέχετε στην παρούσα δήλωση εχεμύθειας ανά τακτά χρονικά διαστήματα και να ενημερώνεστε για τυχόν τροποποιήσεις.</p>

<p><strong>Η αποδοχή εκ μέρους σας των παρόντων όρων</strong></p>

<p>Η χρήση αυτού του Ιστότοπου, συνεπάγεται την αποδοχή της παρούσας δήλωσης εκ μέρους σας. Αν δεν συμφωνείτε με την παρούσα δήλωση, παρακαλείσθε να μην χρησιμοποιείτε τον Ιστότοπό μας. Αν συνεχίζετε να χρησιμοποιείτε τον Ιστότοπο μετά την ανάρτηση αλλαγών στην παρούσα δήλωση, θα σημαίνει ότι αποδέχεστε τις εν λόγω αλλαγές.</p>

<p><strong>Επικοινωνία μαζί μας</strong></p>

<p>Αν έχετε ερωτήσεις σε σχέση με την παρούσα δήλωση εχεμύθειας, τις πρακτικές αυτού του ιστότοπου ή τη χρήση αυτού του ιστότοπου, παρακαλείσθε να επικοινωνήσετε μαζί μας στη διεύθυνση: <a href="mailto:info@codeweek.eu">info@codeweek.eu</a></p>
<p>Το παρόν έγγραφο επικαιροποιήθηκε τελευταία φορά στις 12 Οκτωβρίου 2014</p>

<div style="font-size:10px;color:gray;">Δήλωση εχεμύθειας που δημιουργήθηκε από την <a style="font-size:10px;color:gray;text-decoration:none;cursor:default;" href="http://www.privacypolicies.com" target="_blank">Generate Privacy Policy</a></div>

		</div>
	</div>
</section>@endsection