@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>ЗА CODEWEEK</h1><span></span></div>

                    <hr>


                    <p>Во 2018 година ќе се одржи Европската недела на кодирање помеѓу <strong>6 и 21 октомври</strong>.</p>

                    <p>Европската недела на кодирање е движење на пошироко членство што ја слави креативноста, решавањето проблеми и соработката преку програмирање и други технички активности. Идејата е да се направи програмирањето повидливо, да им се покаже на младите, возрасните и постарите како да ги оживеат идеите со кодирање, да се демистифицираат овие вештини и да се доведат мотивирани луѓе заедно да учат.</p>

                    <h2>Управувана од волонтери</h2>

                    <p>Европската недела на кодирање е управувана од волонтери. Еден или повеќе, <a href="/ambassadors">Амбасадори на неделата на кодирање</a> ја координираат иницијативата во нивните земји, но секој може да организира своја сопствена активност и да ја додаде на мапата на <a href="/">codeweek.eu</a>.</p>

                    <h2>Поддржано од Европската комисија</h2>

                    <p>Европската недела на кодирање стартуваше во 2013 година од Младите советници за Дигитална агенда за Европа. Европската комисија ја поддржува Европската недела на кодирање, како дел од стратегијата за <a href="http://ec.europa.eu/priorities/digital-single-market/">Дигитален единствен пазар</a>. Во <a href="https://ec.europa.eu/education/initiatives/european-education-area/digital-education-action-plan_en">Акциониот план за дигитално образование</a> Комисијата особено ги охрабрува училиштата да се придружат на иницијативата. Целта е да се вклучат 50% од сите училишта во Европа до 2020 година.</p>

                    <h2>Училишта</h2>

                    <p>Училишта од секое ниво и наставници по сите предмети се особено поканети да учествуваат во Европската недела на кодирање, да им дадат можност на своите ученици да ја истражуваат дигиталната креативност и кодирањето. Научете повеќе за иницијативата и како да ја организирате вашата активност преку веб-локацијата наменета за наставници: <a href="/schools">CodeWeek.eu/Schools</a></p>

                    <h2>Зошто кодирање?</h2>

                    <p>Поради Пиа, која чувствуваше дека мора да студира право иако секогаш уживаше во математика и во играње со компјутери. Поради Марк, кој имаше идеја за подобра социјална мрежа, но сам не можеше да ја направи. Поради Алис, која сонуваше за правење роботи, бидејќи нејзините родители не ѝ дозволуваа да има мачка.</p>

                    <p>Поради сите вас што веќе помагате да се исполнат тие соништа.</p>

                    <p>Всушност, тоа е за сите нас. Нашата иднина. Технологијата ни го обликува животот, но ние дозволуваме малцинството да реши како и за што ќе ја користиме. Можеме да направиме повеќе отколку само споделување и да ни се допаѓаат нештата. Можеме да ги оживееме нашите луди идеи, да направиме нешта што ќе им носат радост на другите.</p>

                    <p>Никогаш не било полесно да направите сопствена апликација, да направите сопствен робот или да измислите летачки автомобили, зошто да не! Не е лесно патување, но е патување полно со креативни предизвици, заедница што дава поддршка и многу забава. Подготвени сте да го прифатите предизвикот и да станете творец?</p>

                    <p>Кодирањето исто така помага да се развијат способности како што е компјутерско мислење, решавање проблеми, креативност и тимска работа - навистина добри вештини за сите патеки во животот.</p>

                    <p>Алесандро Бољоло, координатор на тим од амбасадори волонтери на Европската недела на кодирање вели:<blockquote>
                            <p>&bdquo;Од почетокот на постоењето направивме многу нешта користејќи камен, железо, хартија и молив кои ни го трансформираа животот. Сега ние живееме во различна ера каде што светот е обликуван во код. Различните ери имаат различни барања за работни места и вештини. Во текот на Неделата на кодирање сакаме да му ја дадеме на секој Европеец шансата да го открие кодирањето и да се забавува со него. Ајде да учиме кодирање за да ја обликуваме нашата иднина'.</p>
                        </blockquote>
                    </p>

                    <h2>Недела на кодирање во бројки</h2>

                    <p>Во 2017 година, 1,2 милиони луѓе во повеќе од 50 земји низ светот учествуваа во Европската недела на кодирање. Дополнителни 1,3 милиони млади луѓе беа ангажирани во <a href="http://africacodeweek.org/">Неделата на кодирање во Африка</a>, која претставува секундарна иницијатива управувана од SAP и непрофитни организации.</p>

                    <p>Ако вашата земја уште не е вклучена, може да организирате активности и да ги ставите на <a href="/events">мапата</a> или <a href="mailto:info@codeweek.eu">да волонтирате</a> како амбасадор на Неделата на кодирање.</p>

                    <div class="container clearfix">
                        <div class="col_half" id="PeopleChart" style="opacity: 0;width: 100%;text-align: center">
                            <h3 class="center">Учесници</h3>
                            <canvas id="PeopleChartCanvas" style="width: 70%;height:400px;"></canvas>
                        </div>
                    </div>


                    <h2>Придружете се на Европската недела на кодирање</h2>

                    <p>Придружете се на Европската недела на кодирање со <a href="/guide">организирање активност на кодирање</a> во вашиот град, придружувајќи се на <a href="/codeweek4all">Предизвикот Code Week 4 All</a> и на активности на поврзување преку заедници и граници или така што ќе ни помогнете да ја рашириме визијата за неделата на кодирање како <a href="/ambassadors">Амбасадор на европската недела на кодирање</a> за вашата земја!</p>


                </div>
            </div>
        </div>
    </section>@endsection @push('scripts')<script type="text/javascript">
        $(function($){

            var peopleChartData = {
                labels: ["2013", "2014", "2015", "2016", "2017"],
                datasets: [
                    {
                        fillColor: "rgba(60, 161, 206, 0.61)",
                        strokeColor: "rgba(220,220,220,1)",
                        data: [10000, 150000, 570000, 970000, 1200000]
                    }
                ]

            };

            var globalGraphSettings = {animation: Modernizr.canvas};


            function showBarChart() {
                var ctx = document.getElementById("PeopleChartCanvas").getContext("2d");
                new Chart(ctx).Bar(peopleChartData, globalGraphSettings);
            }


            $('#PeopleChart').appear(function () {
                $(this).css({opacity: 1});
                setTimeout(showBarChart, 300);
            }, {accX: 0, accY: -155}, 'easeInCubic');



        });

    </script>@endpush