@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap nopadding">


                <div class="container clearfix ">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Станете Амбасадор на Европската недела на кодирање</h1><span></span></div>


                    <p><a href="http://events.codeweek.eu/ambassadors/">Амбасадорите на Европската недела на кодирање</a> се главните личности за контакт за неделата на кодирање во секоја земја и помагаат во ширењето на визијата на Неделата на кодирање до локалните заедници. Дали верувате во <a href="/about">визијата на Неделата на кодирање</a> и сакате да го промовирате кодирањето во вашата сопствена земја? Продолжете со читање!</p>

                    <p><strong>Како Амбасадор на Европската недела на кодирање, треба да бидете во можност да одвоите неколку часа неделно да:</strong></p>
                    <ul>
                        <li>поврзувате луѓе, компании и заедници заинтересирани да направат нешто за Неделата на кодирање.</li>
                        <li>Да ги охрабрувате организаторите на настан да ги додаваат нивните настани за кодирање на веб-локацијата на Неделата на кодирање.</li>
                        <li>Да охрабрувате да се организираат нови настани во вашата земја со промовирање на Неделата на кодирање.</li>
                        <li>Да одговарате на е-пораки за Неделата на кодирање на вашиот јазик.</li>
                        <li>Да одобрувате настани на веб-локацијата на Неделата на кодирање за вашата земја.</li>
                        <li>Да одржувате список со ресурси за учење на јазикот на вашата земја.</li>
                        <li>Да наоѓате интересни статии за успех и новости за да ги промовирате на каналите на Неделата на кодирање.</li>
                        <li>Да промовирате материјали за Неделата на кодирање преку вашата мрежа.</li>
                        <li>Да соработувате со други национални амбасадори низ цела Европа.</li>
                    </ul>

                    <p><strong>За возврат, ќе може да:</strong></p>
                    <ul>
                        <li>запознавате многу умни, интересни луѓе од различни бранши.</li>
                        <li>Станете суштински дел на една од најголемите иницијативи во Европа за движење на пошироко членство.</li>
                        <li>Ни помогнете да ја подигнеме свесноста за важноста на кодирањето и правењето на Европа навистина дигитална.</li>
                        <li>Додадете титула &bdquo;Амбасадор на Европската недела на кодирање&ldquo; на и онакавеќе неверојатната работна биографија што ја имате.</li>
                        <li>Научете да кодирате! (во случај сѐ уште да не сте научиле)</li>
                    </ul>
                    <hr/>
                    <p><strong>Еве што  значи сето тоа со малку повеќе детали:</strong></p>
                    <ul>
                        <li>Една од нашите цели е да поврзе различни кодирачки и образовни мрежи. <strong>Ако знаете за одржување некакви настани на кодирање, запознајте ги организаторите на Неделата на кодирање и помогнете им да го додадат настанот на веб-страницата на Неделата на кодирање</strong> па ќе имаме сеопфатен список на сите настани на кодирање во Европа.</li>
                        <li>Исто така се надеваме дека ќе видиме повеќе организирани настани за Неделата на кодирање. Може да помогнете со <strong>охрабрување</strong> <strong>училишта, организации, заедници на развивачи и поединци-ентузијасти во вашата земја да започнат нови настани, погодни за почетници</strong>. Тоа не мора да биде во текот на самата Недела на кодирање, иако тоа ќе биде најдоброто време за нашите промотивни активности. За да ви помогнеме, подготвуваме список со предлози за компании, <a href="http://events.codeweek.eu/guide">упатство за потенцијални организатори на настан</a> и исто така градиме спектар на други <a href="https://github.com/codeeu/codeeu-resources">промотивни ресурси</a>.</li>
                        <li>Потребна ни е вашата помош да <strong>одговараме на е-пораки во врска со Неделата на кодирање во вашата земја.</strong> Вие ќе бидете главното лице за контакт за сѐ што се случува во вашата земја па може да <strong>поврзувате луѓе и компании од вашата земја што може да имаат корист од поврзувањето еден со друг</strong> и да давате одговори на вашиот јазик. Не грижете се ако с&egrave; уште не ги знаете сите одговори, тука сме да ви помогнеме.</li>
                        <li>Секој може да го додаде својот настан на кодирање на <a href="http://events.codeweek.eu">http://events.codeweek.eu</a>, но вие ќе бидете модераторот за настаните во вашата земја. Сѐ што треба да правите е редовно<strong> да ги прегледувате поднесените настани и да видите дали одговараат за Неделата на кодирање</strong>.&nbsp;</li>
                        <li>Треба да биде лесно за секого да започне настан на кодирање. Вам ви се веројатно познати некои извонредни материјали за учење на интернет за кодери-почетници на вашиот јазик <strong>па може да одржувате список со ресурси за вашата земја на веб-локацијата на Европската недела на кодирање</strong>.&nbsp;</li>
                        <li><strong>Да обезбедувате интересни новости и содржина за кодирањето од вашата земја</strong> што ние може да ги промовираме на каналите на социјалните медиуми на Неделата на кодирање. Главно бараме содржина на англиски јазик, па може да помогнете така што ќе побарате од организаторите да ги споделат нивните приказни и совети на англиски јазик за <a href="http://blog.codeweek.eu">нашиот блог</a>. Дополнително, може исто така да поставите ваши национални канали на социјални медиуми за Неделата на кодирање да промовирате содржина на вашиот сопствен јазик.&nbsp;</li>
                        <li>Заедно со ваша помош, ќе градиме библиотека со материјали од Неделата на кодирање што може да се користат да се промовира кодирањето како вештина. <strong>Потребна ни е ваша помош да ги распространиме материјалите во вашата земја па дури и да охрабриме различни групи да обезбедат преводи</strong>.&nbsp;</li>
                        <li>Ние создаваме мрежа на национални амбасадори да ја промовираат Неделата на кодирање и ние исто така ќе се обидеме да одредиме време за месечни повици преку интернет да дискутираме за нашата работа, да разменуваме добри практики и да се инспирираме едни со други со идеи за идни активности. Не мора да присуствувате на сите состаноци, но се надеваме дека ќе може да ни се придружите најчесто што можете. Исто така имаме список со адреси на амбасадорите на Европската недела на кодирање што може да ги користите во кое било време да добиете совет или помош од другите амбасадори. <strong>Ќе бидете во можност да ја проширите вашата сопствена мрежа и да добиете свежи идеи низ соработката со другите амбасадори од цела Европа.</strong></li>
                    </ul>

                    <p>С&egrave; уште сте заинтересирани? Сакаме да се вклучите во ова! Брзо погледнете го <a href="http://events.codeweek.eu/ambassadors">списокот за Амбасадори на Европската недела на кодирање</a>. Ако постои некој за вашата земја, слободно директно остварете контакт со неа/него и видете како може да соработувате. Како и да е, ќе очекуваме е-порака од вас на <a href='mailto:info@codeweek.eu?subject=EU Code Week Ambassador'/>info@codeweek.eu</a>.</p>



                </div>
        </div>

    </section>@endsection