@extends('layout.base') @section('content')<section id="codeweek-privacy-page" class="codeweek-page">

        <section class="codeweek-content-wrapper" style="margin-top: 0;">

            <h1 style="margin-bottom:10px;">Политика на колачиња</h1>

            <h3><strong>Што се колачиња?</strong></h3>

            <p>
            <div>Колаче е мала текстуална датотека која веб-локацијата ја складира на компјутерот или мобилен уред кога ја посетувате локацијата.</div>

            <div>
                <ul>
                    <li><strong>Директни колачиња</strong> се колачиња поставени од веб-локацијата што ја посетувате. Само таа веб-локација може да ги прочита. Освен тоа, веб-локацијата може потенцијално да користи надворешни услуги, кои исто така поставуваат свои колачиња, познати како <strong>колачиња од трета страна</strong>.</li>
                    <li>Постојани колачиња се колачиња зачувани на компјутерот кои не се бришат автоматски кога излегувате од прегледувачот, за разлика од колаче за сесија, кое се брише кога ќе излезете од прегледувачот.</li>
                </ul>

            </div>

            <p>Кога прв пат ќе ја посетите веб-локацијата на Неделата на кодирање, од вас ќе се побара да <strong>прифатите или одбиете колачиња</strong>.</p>

            <p>Целта е да ѝ овозможите на локацијата да ви ги запамети претпочитаните вредности (како корисничко име, јазик и сл.) за одреден временски период.</p>

            <p>На тој начин, не мора повторно да ги внесувате кога прегледувате низ локацијата во текот на истата посета.</p>

            <p>Колачињата исто така може да се користат да воспостават анонимизирана статистика за искуството при прегледувањето на нашите локации.</p>
            </p>


            <h3><strong>Како ги користиме колачињата?</strong></h3>

            <p>Неделата на кодирање најмногу користи „директни колачиња“. Ова се колачиња поставени и контролирани од нас, не од некоја надворешна организација.</p>

            <p>Сепак, за да видите некои од нашите локации, ќе треба да прифатите колачиња од надворешни организации.</p>

            <div><strong>3-те типа на директно колаче</strong> што ги користиме се за:<ul>
                    <li>зачувување на претпочитаните вредности на посетителот</li>
                    <li>да се направат нашите веб-локации функционални</li>
                    <li>да се соберат аналитички податоци (за однесувањето на корисникот)</li>
                </ul>
            </div>

            <h4>Претпочитани вредности на посетител</h4>
            <p>Овие се поставени од нас и само ние може да ги прочитаме. Тие паметат:<ul>
                <li>ако сте ја прифатиле (или сте ја одбиле) политиката на колачиња на локацијата</li>

            </ul>
            </p>

            <table class="codeweek-table">
                <thead>
                <tr>
                    <th>Име</th>
                    <th>Услуга</th>
                    <th>Цел</th>
                    <th>Тип и траење на колаче</th>
                </tr>
                </thead>
                <tbody>

                <tr>
                    <td>codeweek_cookie_consent</td>
                    <td>Пакет за согласност за колачиња</td>
                    <td>Ви ги зачувува претпочитаните вредности за колаче (па така нема повторно да ве праша)</td>
                    <td>Директното колаче за сесија е избришано откако ќе излезете од прегледувачот</td>
                </tr>

                </tbody>
            </table><br/><h4>Функционални колачиња</h4>
            <p>
            <div>Постојат некои колачиња кои мора да ги вклучиме за да може одредени веб-локации да функционираат. Поради оваа причина, тие не бараат согласност од вас. Особено:<ul>
                    <li>технички колачиња кои се потребни за одредени ИТ-системи</li>
                </ul>
            </div>
            </p><br/><h4>Технички колачиња</h4>

            <table class="codeweek-table">
                <thead>
                <tr>
                    <th>Име</th>
                    <th>Услуга</th>
                    <th>Цел</th>
                    <th>Тип и траење на колаче</th>
                </tr>
                </thead>
                <tbody>

                <tr>
                    <td>codeweek_session</td>
                    <td>PHP</td>
                    <td>Одржува безбедна сесија за вас, во текот на посетата.</td>
                    <td>Директното колаче за сесија е избришано откако ќе излезете од прегледувачот</td>
                </tr>

                <tr>
                    <td>remember_web</td>
                    <td>PHP</td>
                    <td>Одржува безбедна сесија за вас подолго време спречувајќи да ја изгубите сесијата при затворање на прегледувачот.</td>
                    <td>Директно постојано колаче, 60 месеци</td>
                </tr>

                <tr>
                    <td>јазик</td>
                    <td>PHP</td>
                    <td>Го зачувува претпочитаниот јазик на корисникот</td>
                    <td>Директното колаче за сесија е избришано откако ќе излезете од прегледувачот</td>
                </tr>

                </tbody>
            </table><br/><h4>Аналитички колачиња</h4>

            <p>Овие ги користиме единствено за внатрешно истражување за тоа како може да ја подобриме услугата што ја обезбедуваме за сите наши корисници.</p>

            <p>Колачињата едноставно проценуваат како комуницирате со нашата веб-локација - како анонимен корисник (тие собрани податоци не ве идентификуваат вас лично).</p>

            <p>Исто така, овие податоци не се споделуваат со никакви трети страни и не се користат за некоја друга цел. Анонимизираната статистика може да се сподели со изведувачите кои работат на проектите за комуникација според договор за дело со Комисијата.</p>

            <p>Сепак, слободно може да ги одбиете овие видови колачиња – или преку банерот за колачиња што ќе го видите на првата страница што ќе ја посетите или со посетување на оваа <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">наменска страница.</a>.</p>

            <table class="codeweek-table">
                <thead>
                <tr>
                    <th>Име</th>
                    <th>Услуга</th>
                    <th>Цел</th>
                    <th>Тип и траење на колаче</th>
                </tr>
                </thead>
                <tbody>

                <tr>
                    <td>_pk_id#</td>
                    <td>Услужна веб-аналитика, заснована на софтверот од отворен извор Matomo</td>
                    <td>Ги препознава посетителите на веб-локацијата (анонимно - не се собираат лични информации за корисникот).</td>
                    <td>Директно постојано колаче, 20 дена</td>
                </tr>

                <tr>
                    <td>_pk_ses#</td>
                    <td>Услужна веб-аналитика, заснована на софтверот од отворен извор Matomo</td>
                    <td>Ги идентификува страниците прегледани од истиот корисник во текот на истата посета. (анонимно - не се собираат лични информации за корисникот).</td>
                    <td>Директно постојано колаче, 30 минути</td>
                </tr>

                </tbody>
            </table><br/><h3><strong>Колачиња од трета страна</strong></h3>

            <div>
                <p>Некои од нашите локации прикажуваат содржина од надворешни обезбедувачи на содржина, на пр. YouTube, Facebook и Twitter.</p>

                <p>За да ја видите оваа содржина од трета страна, прво треба да ги прифатите нивните конкретни одредби и услови. Ова ги вклучува нивните политики за колачиња, врз кои немаме контрола.</p>

                <p>Но ако не ја гледате оваа содржина, не се инсталирани колачиња од трета страна на уредот.</p>Обезбедувачи на содржини од трета страна на Неделата на кодирање<ul>
                    <li><a href="https://www.facebook.com/legal/terms">Facebook</a></li>
                    <li><a href="https://twitter.com/en/tos?wcmmode=disabled#intlTerms">Twitter</a></li>
                    <li><a href="https://www.tumblr.com/policy/en/terms-of-service">Tumblr</a></li>
                    <li><a href="https://www.youtube.com/t/terms">YouTube</a></li>
                </ul>Овие услуги од трета страна се надвор од рамките на контролата на веб-локацијата на Неделата на кодирање. Обезбедувачите на содржини може, во секое време, да ги сменат своите услови за услугата, целта и употребата на колачињата и сл.</div><br/><h3><strong>Како може да управувате со колачиња?</strong></h3>

            <p>Може да <strong>управувате/бришете</strong> колачиња како што сакате - за детали, видете <a
                        href="https://aboutcookies.org">aboutcookies.org</a>.<p><strong>Отстранување колачиња од уред</strong></p>

            <p>Може да ги избришете сите колачиња кои ви се веќе на уредот со чистење на  историјата на прегледи на прегледувачот. Ова ќе ги отстрани сите колачиња од сите веб-локации што сте ги посетиле.</p>

            <p>Имајте на ум дека може исто така да изгубите некои зачувани информации (пр. зачувани детали за најавување, претпочитани вредности за локацијата).</p><strong>Управување со колачиња соодветни за локација</strong><p>За подетална контрола врз колачиња соодветни за локација, проверете ги поставките за приватност и колачиња во претпочитаниот прегледувач</p><strong>Блокирање колачиња</strong><p>Може да ги поставите најсовремените прегледувачи да спречат какви било колачиња да се сместат на уред, но тогаш можеби ќе треба рачно да приспособувате некои претпочитани вредности секогаш кога ќе посетувате некоја локација/страница. И некои услуги и функционалности може воопшто да не работат правилно (пр. најавување на профил).</p><strong>Управување со нашите аналитички колачиња</strong><p>Може да управувате со вашите претпочитани вредности кои се однесуваат на колачиња од нашата Аналитика на <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">наменската страница.</a></p>


        </section>

    </section>@endsection
