@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Придружете се на Европската недела на кодирање и организирајте настани #codeEU</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Регистрирајте го настанот овде</a></div>
                    </div>


                </div>


                <h4><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/codeeu_toolkit.pdf"
                       alt="#codeEU Toolkit"><i class="fa fa-download"></i> Преземете ја целосната #codeEU програмска алатка во PDF</a></h4>
                <h2>#codeEU програмска алатка</h2>
                <h2>Што е Европска недела на кодирање?</h2>
                <p>Европска недела на кодирање е движење на пошироко членство управувано од волонтери кои промовираат кодирање во своите земји како <a
                            href="/ambassadors">Амбасадори на неделата на кодирање</a>. Сите &acirc;€&ldquo; училишта, наставници, библиотеки, клубови за кодирање деловни субјекти, јавни органи &acirc;€&ldquo; може да организираат #CodeEU настан и да го додадат на мапата <a href="/">codeweek.eu</a>.</p>
                <h2>Кој може да организира настан на Неделата на кодирање?</h2>
                <p>Секој може да организира настан на Неделата на кодирање.</p>
                <ul>
                    <li><strong>Деца/тинејџери/возрасни</strong> може да организираат настани на кодирање да им покажат на другите како креирате со код.</li>
                    <li><strong>Училишта / вонучилишни клубови / вечерни училишта за возрасни</strong> може да организираат настани за своите ученици. Кодирањето на интернет или без интернет е забавно и н? учи на компјутерско размислување!</li>
                    <li><strong>Наставници и библиотекари</strong> кои кодираат може да држат часови за кодирање, да споделуваат тематски планови, да организираат работилници за колегите.</li>
                    <li><strong>Наставници и библиотекари кои не кодираат</strong> може да ги поканат родителите или учениците да ги научат учесниците да кодираат.</li>
                    <li><strong>Кодерите</strong> може да организираат работилници во локалните училишта, на &bdquo;хакерспејс&ldquo; или во центри на заедницата и да поканат луѓе да креираат со код.</li>
                    <li><strong>Клубовите за кодирање</strong> може да организираат работилници за нови учесници и да им покажат како да направат игра или апликација со код.</li>
                    <li><strong>Деловните субјекти и непрофитните организации</strong> може да одржуваат работилници за кодирање, да го позајмуваат својот персонал да обучува на различни настани, да организираат забавни предизвици со кодирање, да нудат спонзорство за настани на кодирање.</li>
                </ul>

                <h2>Што ви е потребно?</h2>
                <ul>
                    <li><strong>Група луѓе кои се желни за учење.</strong> На пример, ваши пријатели, деца, тинејџери, возрасни колеги, родители или баби и дедовци. Запомнете, двајца се веќе група!</li>
                    <li><strong>Обучувачи или тренери</strong> кои знаат да кодираат, како да подучуваат и да ги инспирираат другите. Бројот зависи од типот и големината на настанот. За работилници со активно учество, може да ви е потребен еден обучувач на 5-8 учесници, но сетотоа е индивидуално. Учесниците исто така може да си помагаат еден на друг! За поголеми настани, можеби е добра идеја да се има домаќин кој ќе проверува дали сите имаат с? што им е потребно и ќе овозможува нештата да се одвиваат непречено.</li>
                    <li><strong>Место на кое треба да се биде.</strong> Училници, библиотеки, конференциски сали и различни јавни места, се одличен избор за одржување настан.</li>
                    <li><strong>Компјутери.</strong> Во зависност од вашата целна група, може да побарате од учесниците да си донесат лаптопи, во тој случај не заборавајте да обезбедите доволно приклучоци за напојување.</li>
                    <li><strong>Интернет врска</strong> &acirc;€&ldquo; WiFi или фиксни врски. Осигурете се дека врската ќе може да го издржи сообраќајот што го прави вашата група</li>
                    <li><strong>Кодирање без интернет.</strong> Вам всушност не ви се потребни компјутери и интернет врска за да научите компјутерско размислување. Обидете се со некое офлајн кодирање со нашиот прибор <a
                                href="http://codeweek.it/codyroby/">Cody-Roby</a>.</li>
                    <li><strong>Нешто со кое може да работите и да учите.</strong>Покажете им на учесниците колку забавно може да биде самите да креираат нешто. Проверете го нашиот <a href="http://codeweek.eu/resources/">список на ресурси</a> и пребарајте на интернет за постоојни тематски планови, програми за работилница и приспособете ги на потребите на вашата група. Ако имате постојна компјутерска опрема во местото на одржување, уверете се дека на неа веќе е инсталиран потребниот софтвер и дајте им на учесниците упатства како може да инсталираат на нивните уреди.</li>
                    <li><strong>Регистрирајте учесници.</strong> Ако имате ограничен достапен простор, може да користите алатки во вид на онлајн форми како Wufoo, Google Forms или страници за настан на Facebook или Eventbrite да соберете регистрации. Додека ние ја даваме услугата за бесплатно учество на настани, вие може да наплаќате мал надоместок за да ги покриете трошоците на настанот. Алтернативно, може да се обратите до локалните ИТ компании или стартап компании за спонзорство.</li>
                    <li><a href="/add">Прикачете го вашиот настан</a> на <a href="/">мапата на Неделата на кодирање</a>!</li>
                </ul>


                <h2>Како да го организирате настанот?</h2>
                <ul>
                    <li>Форматот на вашиот настан на кодирање зависи од вас, но ние препорачуваме да вклучите одредено <strong>практично, време за непосредна работа</strong>, каде што учесниците може сами да креираат и, или да се обидат да подобрат некаков хардвер.</li>
                    <li>Може да користите какви било <strong>алатки и технологии</strong> што ги сакате, но ние претпочитаме <a
                                href="http://codeweek.eu/resources/">бесплатно достапни материјали со отворен код</a>.</li>
                    <li><strong>Смејте се!</strong> Пријателската атмосфера ќе го скрши мразот и ќе мотивира за учење.</li>
                    <li><strong>Ужинки и пијалаци</strong>. Ако вашиот настан трае неколку часа, на учесниците ќе им биде потребна пауза. Ако не може да обезбедите ужинки и пијалаци, побарајте од учесниците да донесат и поделете ги помеѓу себе.</li>
                    <li>Побарајте од учесниците да <strong>покажат и презентираат</strong> еден на друг што креирале на крајот на настанот. Направете ги сите горди!</li>
                    <li><strong>Зборувајте за вашиот настан!</strong> Зборувајте за вашиот настан на социјалните медиуми. Користете #CodeEU и @CodeWeekEU. Разговарајте со пријателите, локалните медиуми, одржете прес-конференција!</li>
                    <li>Не заборавајте да го<a href="/add">додадете вашиот настан</a> на <a href="/">мапата на Неделата на кодирање</a>!</li>
                </ul>


                <h2>Промотивен материјал</h2>
                <p>Слободно користете кои било делови од следните прес конференции за ваш сопствен маркетинг:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/eu-code-week-celebrating-its-5th-birthday-7-22-october-get-ready-join-and-learn-how-create-code">Европската Недела на кодирање го прославува својот 5-ти роденден од 7-22 октомври &acirc;€&ldquo; подгответе се, придружете се и научете како да креирате со код!</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/million-coded-in-record-2016-EU-code-week">Нов рекорд на Европската недела на кодирање: милион кодирања во текот на изданието 2016</a></li>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/save-date-eu-code-week-10-18-october-2015-bringing-ideas-life-codeeu">Европска недела на кодирање: оживување идеи со #codeEU</a></li>
                </ul>
                <p>Исто така може да го користите <a href="https://github.com/codeeu/codeeu-resources/tree/master/Logo - generic">логото на Европската недела на кодирање</a>, с? додека настанот што го планирате соодветствува со нашите упатства.</p>


                <h2>Прашања?</h2>
                <p>Ако имате прашања за организирање и промовирање на вашиот #codeEU настан, остварете контакт со еден од <a href="/ambassadors">Амбасадорите на Европската недела на кодирање</a> од вашата земја.</p>


            </div>
        </div>
    </section>@endsection