@extends('layout.base') @section('content')<section>


        <div class="container">


            <div class="content-wrap breathe">


                <div class="container clearfix">


                    <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
                        <h1>Организирајте сопствена активност со #CodeWeek</h1><span></span><div><a href="/add" target="_blank" class="btn btn-xl mt-8">Регистрирајте ја активноста овде</a></div>
                    </div>


                </div>


                <h2>Што е Европска недела на кодирање?</h2>
                <p>Европска недела на кодирање е движење на пошироко членство предводено од волонтери и поддржано од Европската Комисија. Сите - училишта, наставници, библиотеки, клубови за кодирање, деловни субјекти, јавни органи - може да организираат #CodeWeek активност и да ја додадат на мапата <a href="/events">codeweek.eu</a>.</p>


                <h2>Што ви е потребно за да организирате активност?</h2>
                <ul>
                    <li><strong>Група луѓе кои се желни за учење.</strong> На пример, ваши пријатели, деца, тинејџери, возрасни колеги, родители или баби и дедовци. Запомнете, двајца се веќе група!</li>
                    <li><strong>Наставници или тренери</strong> на кои им е позната активноста на кодирање и знаат како да подучуваат и инспирираат други. Бројот зависи од типот и големината на настанот.</li>
                    <li><strong>Место за учење.</strong> Училници, библиотеки, конференциски сали и различни јавни места, се одличен избор за одржување настан.</li>
                    <li><strong>Компјутери и интернет врска.</strong> Во зависност од вашата целна група, може да побарате од учесниците да донесат свои лаптопи.</li>

                    <li><strong>Кодирање без интернет.</strong> Вам всушност не ви се потребни компјутери и интернет врска за да научите компјутерско размислување. Погледнете го нашето <a href="/training/coding-without-computers">делче за учење без интернет</a> за да започнете.</li>


                    <li><strong>Материјали за учење.</strong> Покажете им на учесниците колку забавно може да биде самите да креираат нешто. Проверете ја нашата <a
                                href="/resources">страница со ресурси</a> и <a href="/training">делчињата за учење</a> со видео упатства и планови за лекции и прилагодете ги на потребите на вашата група.</li>


                    <li><strong>Регистрирајте учесници.</strong> Ако имате ограничен расположлив простор, може да користите онлајн алатки какви што се <a href="https://docs.google.com/forms/">Google forms</a> и <a
                                href="https://www.eventbrite.com/">Eventbrite</a> да регистрирате учесници.</li>
                    <li>Не заборавајте да ја <a href="/add">прикачите вашата активност</a> на <a href="/events">мапата на Неделата на кодирање</a>!</li>
                </ul>


                <h2>Како да организирате активност?</h2>
                <ul>
                    <li>Формата на вашиот настан на кодирање зависи од вас, но наша препорака е да испланирате одредено <strong>време за практична работа</strong>, каде што учесниците ќе можат сами да креираат и/или да се обидат да унапредат одреден хардвер.</li>
                    <li>Употребувајте <strong>алатки и технологии</strong> соодветни за вашата целна група. Препорачуваме користење на <a href="http://codeweek.eu/resources/">слободно достапен материјал од отворен извор</a>.</li>

                    <li>Охрабрете ги учесниците да <strong>покажат и презентираат</strong> еден на друг што креирале на крајот од настанот.</li>

                    <li><strong>Споделете ги вестите!</strong> Промовирајте и споделете што сте направиле во текот на активноста на социјален медиум со користење на хаштагот #CodeWeek. Исто така може да споделувате на <a
                                href="https://www.facebook.com/groups/774720866253044/">групата за наставници на Европската недела на кодирање</a> и на Twitter (<a href="https://twitter.com/CodeWeekEU">@CodeWeekEU</a>). Разговарајте со пријателите, колегите, локалните медиуми и одржете прес-конференција.</li>

                    <li>Не заборавајте да ја<a href="/add">додадете вашата активност</a> на <a href="/events">мапата на Неделата на кодирање</a>!</li>


                </ul>


                <h2>Промотивен материјал</h2>
                <p>Проверувајте го нашиот <a href="http://blog.codeweek.eu/">блог</a> за најнови информации и слободно адаптирајте ги најскорешните прес-конференции на вашите потреби или создадете сопствени:</p>
                <ul>
                    <li><a href="https://ec.europa.eu/digital-single-market/en/news/gearing-celebrate-eu-code-week-2019">Забрзани подготовки за славење на Европската недела на кодирање 2019</a> (достапно на 29 јазици)</li>

                </ul>


                <h2>Преземете ги следните прибори со алатки за да ви помогнат да започнете:</h2>
                <ul>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BCommunications%2BToolkit.zip">Прибор со алатки за комуникација</a></li>
                    <li><a href="https://s3-eu-west-1.amazonaws.com/codeweek-s3/docs/EU%2BCode%2BWeek%2B2019%2BTeachers%2BToolkit.zip">Прибор со алатки за наставници</a></li>
                </ul>

                <h2>Прашања?</h2>Ако имате прашања за организирање и промовирање на вашиот #codeEU настан, остварете контакт со еден од <a href="/ambassadors">Амбасадорите на Европската недела на кодирање</a> од вашата земја.</div>
        </div>
    </section>@endsection