@extends('layout.base') @section('content')<section>

    <div class="container clearfix">

        <div class="flex flex-col justify-center text-center w-full mb-8 uppercase">
            <h1>Политика на приватност</h1><span>Европска недела на кодирање 2018</span><ol class="breadcrumb">
			    <li><a href="http://codeweek.eu">Почетна</a></li>
			    <li class="active">Политика на приватност</li>
		    </ol>
	    </div>
    </div>
</section><!-- #page-title end --> <!-- Content --><section id="content">
	<div class="content-wrap">
		<div class="container clearfix">
			<p>Оваа Политика на приватност раководи со начинот на кој Европската недела на кодирање ги собира, користи, одржува и открива информациите собрани од корисници (секој, &bdquo;Корисник&ldquo;) на <a href="http://codeweek.eu">http://codeweek.eu</a> веб-локацијата (&bdquo;Веб-локација&ldquo;). Оваа политика на приватност се однесува на веб-локацијата и на сите производи и услуги што се нудат од Европската недела на кодирање.</p>

<p><strong>Лични информации за идентификација</strong></p>

<p>Може да собираме лични информации за идентификација од корисници на различни начини, вклучувајќи но без ограничување, кога корисници ќе ја посетат нашата веб-локација, ќе се регистрираат на локацијата и во врска со други активности, услуги, карактеристики или ресурси што ние ги правиме достапни на нашата веб-локација. Од корисниците може да се побара, како што е соодветно, име, адреса за е-пошта. Корисниците може, сепак, да ја посетат нашата веб-локација анонимно. Ние ќе собираме лични информации за идентификација од корисници само ако тие доброволно ни достават такви информации. Корисниците може секогаш да одбијат да ни достават лични информации за идентификација, со исклучок на тоа што тоа може да ги спречи да се вклучат во одредени активности поврзани со веб-локацијата.</p>

<p><strong>Нелични информации за идентификација</strong></p>

<p>Ние може да собираме нелични информации за идентификација за корисници секогаш кога тие ќе имаат контакт со нашата веб-локација. Нелични информации за идентификација може да го вклучат името на прегледувачот, типот на компјутер и техничките информации за корисниците за начините на поврзување со веб-локацијата, како што се информации за оперативниот систем и давателите на интернет услуги што се користат и други слични информации.</p>

<p><strong>Колачиња на веб-прегледувач</strong></p>

<p>Веб-локацијата може да користи &bdquo;колачиња&ldquo; за да го подобри корисничкото искуство. Веб-прегледувачот на корисниците поставува колачиња на нивниот тврд диск за цели на евиденција и понекогаш за следење на информациите за нив. Корисникот може да избере да го постави неговиот веб-прегледувач да одбие колачиња или да ве информира кога се испратени колачиња. Ако направи така, имајте предвид дека некои делови од веб-локацијата може да не функционираат правилно.</p>

<p><strong>Како ги користиме собраните информации</strong></p>

<p>Европската недела на кодирање може да собира и да користи лични информации на корисниците за следните цели:</p>
<ul>
<li><i>да ја подобри корисничката услуга</i>: Информациите што ни ги давате ни помагаат да одговориме на вашите барања за корисничка услуга и поефикасно да ги поддржиме потребите.</li>
<li><i>Да го персонализираме корисничкото искуство</i>: може да користиме збирни информации да разбереме како нашите корисници како група ги користат услугите и ресурсите што се наоѓаат на веб-локацијата.</li>
<li><i>Да испраќаме периодични е-пораки</i>: Може да ја користиме адресата за е-пошта да одговориме на нивните барања за информации, прашања, и/или други барања.</li>
</ul>
<p><strong>Како ги заштитуваме вашите информации</strong></p>

<p>Ние усвојуваме соодветно собирање на податоци, практики на складирање и обработка и мерки на безбедност за заштита против неовластен пристап, измена, откривање или уништување на вашите лични информации, корисничко име, лозинка, информации за трансакции и податоци складирани на веб-локацијата.</p>

<p><strong>Споделување ваши лични информации</strong></p>

<p>Ние не продаваме, не разменуваме, ниту изнајмуваме лични информации за идентификација на корисници на други. Може да споделуваме генерични, збирни демографски информации што не се поврзани со никакви лични информации за идентификација во врска со посетители и корисници со нашите деловни партнери, подружници од доверба и огласувачи за целите наведени погоре. Може да користиме даватели на услуги од други компании да ни помогнат за функционирањето на нашиот бизнис и за работењето на веб-локацијата или да извршуваат активности во наше име, како што е испраќање билтени или анкети. Може да ги споделуваме вашите информации со овие трети страни за овие ограничени цели доколку сте ни дале дозвола.</p>

<p><strong>Промени на оваа политика за приватност</strong></p>

<p>Европската недела на кодирање ја задржува дискрецијата да ја ажурира оваа политика на приватност во секое време. Кога ќе го направиме тоа, ние ќе го ревидираме ажурираниот датум на долниот дел на оваа веб-локација. Ги охрабруваме корисниците често да ја проверуваат оваа веб-локација за какви било промени за да останат информирани за тоа како ние помагаме да се заштитат личните информации што ги собираме. Вие прифаќате и се согласувате дека е ваша одговорност периодично да ја разгледате оваа политика на приватност и да се запознаете со измените.</p>

<p><strong>Прифаќање на овие одредби</strong></p>

<p>Со користењето на оваа веб-локација, потврдувате дека ја прифаќате оваа политика. Ако не се согласувате со оваа политика, не користете ја веб-локацијата. Вашата понатамошна употреба на веб-локацијата по објавувањето на промените на оваа политика ќе се смета за ваше прифаќање на овие промени.</p>

<p><strong>Контактирајте со нас</strong></p>

<p>Ако имате прашања за оваа политика на приватност, практиките на оваа веб-локација или вашите интеракции со оваа веб-локација, ве молиме контактирајте со нас на: <a href="mailto:info@codeweek.eu">info@codeweek.eu</a></p>
<p>Овој документ последен пат бил ажуриран на 12 октомври 2014 година</p>

<div style="font-size:10px;color:gray;">Политика на приватност креирана од <a style="font-size:10px;color:gray;text-decoration:none;cursor:default;" href="http://www.privacypolicies.com" target="_blank">Генерирај Политика на приватност</a></div>

		</div>
	</div>
</section>@endsection