<?php

return [

    'title' => 'Політика щодо файлів cookie',
    'what' => [
        'title' => 'Що таке файли cookie?',
        'text' => '<p>Файл cookie — це невеликий текстовий файл, що його зберігає сайт на вашому комп’ютері або мобільному пристрої, коли ви відвідуєте сайт.</p>',
        'first_party' => '<strong>Файли cookie першої сторони</strong> — це файли cookie, налаштовані сайтом, який ви відвідуєте. Лише цей сайт може прочитати їх. Проте сайт може використовувати зовнішні служби, які налаштовують власні файли cookie, відомі як <strong>файли cookie третіх сторін</strong>.',
        'persistent_cookies' => 'Постійні файли cookie — це файли cookie, які зберігаються на вашому комп’ютері та не видаляються автоматично, коли ви виходите з браузера, на відміну від файлів cookie сесії, які видаляються після виходу з браузера.',
        'items' => '<p>
 Коли ви вперше зайдете на сайт Тижня кодування, вам запропонують <strong>прийняти або відхилити файли cookie</strong>.</p>
            <p>Мета — надати можливість сайту запам’ятати ваші налаштування (напр., ім’я користувача, мова тощо) на певний період часу.</p>
            <p>Саме тому вам не потрібно вводити ці дані повторно на сайті під час того самого візиту.</p>
            <p>Файли cookie можуть також використовувати для зібрання анонімних статистичних даних про користування нашим сайтом.</p>',
    ],
    'how' => [
        'title' => 'Як ми використовуємо файли cookie?',
        'text1' => '<p>Тиждень кодування використовує здебільшого файли cookie першої сторони. Налаштування цих файлів та контроль за ними здійснюємо безпосередньо ми, а не будь-яка зовнішня організація.</p>',
        'text2' => '<p>Проте щоб переглянути деякі наші сторінки, ви повинні прийняти файли cookie зовнішніх організацій.</p>',
        '3types' => [
            'title' => 'Ми використовуємо <strong>три типи файлів cookie першої сторони,</strong> щоб:',
            '1' => 'зберегти налаштування відвідувача',
            '2' => 'забезпечити функціонування наших сайтів',
            '3' => 'зібрати аналітичні дані (про поведінку користувачів)',
        ],
        'table' => [
            'name' => 'Найменування',
            'service' => 'Служба',
            'purpose' => 'Призначення',
            'type_duration' => 'Тип та тривалість зберігання файлу',
        ],
        'visitor_preferences' => [
            'title' => 'Налаштування відвідувача',
            'text' => '<p>Їх налаштовуємо та читаємо лише ми. Їх запам’ятовують:</p>',
            'item' => 'якщо ви прийняли (або відхилили) політику щодо файлів cookie на цьому сайті',
            'table' => [
                '1' => [
                    'service' => 'Набір файлів cookie для отримання згоди',
                    'purpose' => 'Зберігання ваших налаштувань щодо файлів cookie (щоб не запитувати повторно)',
                    'type_duration' => 'Файли cookie сесії від першої сторони, видалення після виходу з браузера',
                ],
            ],
        ],
        'operational_cookies' => [
            'title' => 'Функціональні файли cookie',
            'text' => '<p>Ми повинні включити деякі файли cookie, щоб забезпечити функціонування певних сторінок. Саме тому для них ваша згода не потрібна. Зокрема:</p>',
            'item' => 'технічні файли cookie, що їх вимагають певні IT-системи',
        ],
        'technical_cookies' => [
            'title' => 'Технічні файли cookie',
            'table' => [
                '1' => [
                    'purpose' => 'Забезпечення безпеки сесії для вас під час вашого візиту.',
                    'type_duration' => 'Файли cookie сесії від першої сторони, видалення після виходу з браузера',
                ],
                '2' => [
                    'purpose' => 'Забезпечення безпеки сесії для вас протягом тривалішого періоду для запобігання перериванню сесії в разі закриття браузера.',
                    'type_duration' => 'Постійні файли cookie першої сторони, 60 місяців',
                ],
                '3' => [
                    'purpose' => 'Зберігання вибраної користувачем мови',
                    'type_duration' => 'Файли cookie сесії від першої сторони, видалення після виходу з браузера',
                ],
            ],
        ],
        'analytics_cookies' => [
            'title' => 'Аналітичні файли cookie',
            'items' => '<p>
 Ми використовуємо їх лише для цілей внутрішнього вивчення способів покращення якості послуг, які ми надаємо для всіх наших користувачів.
            </p>
            <p>
 Файли cookie просто оцінюють те, як ви взаємодієте з нашим сайтом як анонімний користувач (на основі зібраних даних не можливо ідентифікувати особисто вас).
            </p>
            <p>
 Ці дані також не передають жодним третім особам та не використовують для будь-яких інших цілей. Деперсоніфіковані статистичні дані можуть бути передані підрядникам, що працюють на комунікаційних проектах за договором підряду з Комісією.
            </p>
            <p>
 Однак ви можете відхилити ці файли cookie у віконці, що спливає з інформацією про файли на першій сторінці, яку ви відвідаєте, або на <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">спеціальній сторінці.</a>.
            </p>',
            'table' => [
                '1' => [
                    'service' => 'Служба аналітики сайтів на основі відкритого програмного забезпечення Matomo',
                    'purpose' => 'Розпізнання відвідувачів сайту (анонімно, без збирання персональних даних користувача).',
                    'type_duration' => 'Постійні файли cookie першої сторони, 20 днів',
                ],
                '2' => [
                    'service' => 'Служба аналітики сайтів на основі відкритого програмного забезпечення Matomo',
                    'purpose' => 'Визначення сторінок, що їх переглядає той самий користувач під час одного візиту. (анонімно, без збирання персональних даних користувача).',
                    'type_duration' => 'Постійні файли cookie першої сторони, 30 хвилин',
                ],
            ],
        ],

    ],
    'third-party' => [
        'title' => 'Файли cookie третьої сторони',
        'items' => [
            '1' => '<p>На деяких наших сторінках відображено контент зовнішніх провайдерів, напр., YouTube, Facebook і Twitter.</p>
                    <p>Щоб переглянути цей контент третіх сторін, вам необхідно спершу прийняти їхні конкретні умови. До них відносяться і політики щодо файлів cookie, які ми не контролюємо.</p>
                    <p>Та якщо ви не переглядаєте цей контент, то на вашому пристрої не буде встановлено файли cookie третіх сторін.</p>
 Провайдери-треті сторони на сайті Тижня кодування',
            '2' => 'Сайт Тижня кодування не контролює ці послуги третіх сторін. Провайдери можуть у будь-який час змінити умови надання своїх послуг, призначення або використання файлів cookie тощо.',
        ],
    ],
    'how-manage' => [
        'title' => 'Як управляти файлами cookie?',
        'items' => '<p>Ви можете <strong>управляти файлами cookie/видаляти їх</strong> як завгодно; детальніше читайте на <a
 href="https://aboutcookies.org">aboutcookies.org</a>.</p>
                    <p><strong>Вилучення файлів cookie зі свого пристрою</strong></p>
                    <p>Ви можете видалити всі файли cookie, що вже знаходяться на вашому пристрої, очистивши історію веб-перегляду в своєму браузері. Так усі файли cookie з усіх сайтів, які ви відвідували, буде вилучено.</p>
                <p>Зауважте, що ви можете так втратити певну збережену інформацію (напр., збережені дані для входу, налаштування на сайті). </p>
                <strong>Управління файлами cookie, що характерні для певних сайтів</strong>
                <p>Детальнішу інформацію про управління файлами cookie, що характерні для певних сайтів, можна знайти в налаштуваннях конфіденційності та файлів cookie вибраного браузера </p>
                <strong>Блокування файлів cookie</strong>
                <p>Ви можете налаштувати найсучасніші браузери так, щоб запобігти розміщенню будь-яких файлів cookie на вашому пристрої, однак вам доведеться тоді вручну вибирати певні налаштування щоразу, коли ви відвідуєте сайт/сторінку. Деякі сервіси та функції можуть не працювати належно (напр., вхід у профіль). </p>
                <strong>Управління нашими аналітичними файлами cookie</strong>
                <p>Управляти своїми налаштуваннями щодо наших аналітичних файлів cookie можна на <a href="https://www.cnect-stats.com/index.php?module=CoreAdminHome&action=optOut&language=en&backgroundColor=&fontColor=&fontSize=&fontFamily=">спеціальній сторінці.</a></p>',
    ],
];
